[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209833\">@Chandan Kumar</span> (and everybody else who is interested in GSoC 2019) Beside <a href=\"https://brlcad.org/wiki/Google_Summer_of_Code/Project_Ideas\" target=\"_blank\" title=\"https://brlcad.org/wiki/Google_Summer_of_Code/Project_Ideas\">https://brlcad.org/wiki/Google_Summer_of_Code/Project_Ideas</a> there is another page with additional project ideas: <a href=\"https://github.com/opencax/GSoC/issues\" target=\"_blank\" title=\"https://github.com/opencax/GSoC/issues\">https://github.com/opencax/GSoC/issues</a>. You can also have a look at <a href=\"https://opencax.github.io\" target=\"_blank\" title=\"https://opencax.github.io\">https://opencax.github.io</a>.</p>",
        "id": 159547440,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1551297650
    },
    {
        "content": "<p>Hi everyone<br>\nI am Romit Kumar. I am interested to contribute under GSoC 2019. <a href=\"https://github.com/opencax/GSoC/issues/6\" target=\"_blank\" title=\"https://github.com/opencax/GSoC/issues/6\">https://github.com/opencax/GSoC/issues/6</a> ... this issue particularly grabbed my attention. I talked about it on the IRC channel as well.Besides OpenSCAD, I find Slic3r interesting. I am using the OpenSCAD software and getting quite the hang of it. I will like to know how can I contribute to the project or some issues which I can solve. Thank you :)</p>",
        "id": 160570041,
        "sender_full_name": "ROMIT KUMAR",
        "timestamp": 1552397747
    },
    {
        "content": "<p>Hello everyone. I am Sasmit Biswas I have working knowledge of Python and Qt. I am a newbie to open source and I am aspiring to participate in Gsoc 19. As I can see that I am already late int he party,  I would like to know how to get started for contributing. I have been using BRL-CAD for past few weeks. <br>\nThank you.</p>",
        "id": 160687952,
        "sender_full_name": "Sasmit Biswas",
        "timestamp": 1552494264
    },
    {
        "content": "<p>Hey everyone! I am Sagen Soren and currently, I am studying mechanical engineering. I have a working knowledge of C, C++, Python, and Qt. I am new to open source and I would like to know how to start contributing as I am aspiring to participate in GSoC 2019.<br>\nThank you.</p>",
        "id": 160702906,
        "sender_full_name": "Sagen Soren",
        "timestamp": 1552496145
    },
    {
        "content": "<p>Not sure if this is the right place, but hello everyone, I'm Andrey Mazépas, 5th Computer Science student with experience in C++, C and mostly javascript. My work with open source software has mostly been with low level programming but im really interested in computer graphics, more specifically, webGL, so  the Online Geometry Viewer project really caught my eye. Im trying to run it right now and intend to make some PR after im done. hope to get along with everyone</p>",
        "id": 161107879,
        "sender_full_name": "Andrey Mazépas",
        "timestamp": 1552953552
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"213854\">@Andrey Emmanuel Matrosov Mazépas</span> Welcome. This is the right place. For the online geometry viewer specific stuff there is also an OGV topic under this stream here. You may want to scroll back and read the chat of the last days there.</p>",
        "id": 161129144,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1552982778
    }
]