[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"273836\">@Christopher Horler</span> Just FYI, we did get interest from a GSoC candidate interested in working on STEP testing infrastructure</p>",
        "id": 191052570,
        "sender_full_name": "Sean",
        "timestamp": 1584571685
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"273295\">@Muhammad Usman</span> Care to share more about what ideas you had in mind?</p>",
        "id": 191052608,
        "sender_full_name": "Sean",
        "timestamp": 1584571731
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"102902\">@Sean</span>  great!  I started introducing additional (lower level) tests on develop branch (which needs rebasing - on my TODO list!) - using the fff.h header library.  you can see some examples from the commit sha b9d1b135c2e653ab9c0360a3fec965ade597be4c forward  (these will change after I rebase).</p>",
        "id": 191291045,
        "sender_full_name": "Chris Horler",
        "timestamp": 1584732415
    },
    {
        "content": "<p>also, to understand the ways that are possible to introduce tests into older code bases - I bought the book \"Working Effectively with Legacy Code\" - recommended reading!</p>",
        "id": 191291721,
        "sender_full_name": "Chris Horler",
        "timestamp": 1584732742
    },
    {
        "content": "<p>That is a favorite book of mine; got it years ago when it came out and it's a go-to.  Probably the best \"timeless\" CS book I own.</p>",
        "id": 191293807,
        "sender_full_name": "Sean",
        "timestamp": 1584733857
    },
    {
        "content": "<p>same here</p>",
        "id": 191296771,
        "sender_full_name": "Chris Horler",
        "timestamp": 1584735375
    },
    {
        "content": "<p>hi i'm Jagadish and i'm intrested in making exporter for stp code , can i get any directions , refrences or anything i can use ?</p>",
        "id": 192259751,
        "sender_full_name": "Jagadish BC",
        "timestamp": 1585577020
    },
    {
        "content": "<p>right now what i'm thinking of is going though other opensource CAD software export stp files and use it as refrence think of ways to improve it if possible and impliment it in BRL CAD</p>",
        "id": 192260074,
        "sender_full_name": "Jagadish BC",
        "timestamp": 1585577152
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"278909\">@Jagadish BC</span> and thanks for the intro.  Unfortunately there's not really any time to talk details before the deadline, but just try to include as much detail as possible in your proposal.  If you have made any patches, it's important to include those too.</p>",
        "id": 192348612,
        "sender_full_name": "Sean",
        "timestamp": 1585635298
    },
    {
        "content": "<p>But yeah, the most important at this point is to incorporate more detail and demonstrate you can tackle this complex of a project (via patches).</p>",
        "id": 192349735,
        "sender_full_name": "Sean",
        "timestamp": 1585636734
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"278909\">@Jagadish BC</span> have you been able to make any progress with the code?  Have you made any progress on demonstrating a useful code modification?</p>",
        "id": 194838148,
        "sender_full_name": "Sean",
        "timestamp": 1587491289
    },
    {
        "content": "<p>I'm interested in this <a href=\"https://github.com/opencax/GSoC/issues/65\">idea</a><br>\nRIght now i'm getting familiar with brlcad source and working towards submitting my first patch.<br>\nThen i will be working on STEP importer.</p>\n<p>I'm new to open source, and to computational geometry but i have good foundation in math and programming. So, i think i can learn and get through this project.</p>\n<p>I will get back with more details soon</p>\n<p>And where can i find a copy of iso10303</p>",
        "id": 342941890,
        "sender_full_name": "Nishanth",
        "timestamp": 1679235530
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"594562\">@Nishanth</span> and glad to hear about your interest on STEP import!  That said, STEP is a super complicated standard and can take weeks or months to understand if you've never encountered anything like it before.  Your patch will hopefully give a better idea whether you can handle something like AP242, but note that there are easier related projects you could also propose that would also be valuable.</p>",
        "id": 343018185,
        "sender_full_name": "Sean",
        "timestamp": 1679282965
    },
    {
        "content": "<p>As for STEP AP242 import, you can look at our existing conversion logic (which is in src/conv/step and is for AP203).  You will have to learn STEP using existing code and resources available to you on the web.   You won't easily get access to ISO10303 as ISO sells it.  We can't give you our copy until you're a core developer, or at least not until you sign an agreement.</p>",
        "id": 343018475,
        "sender_full_name": "Sean",
        "timestamp": 1679283150
    },
    {
        "content": "<p>As for alternative projects, in BRL-CAD is geometry conversion infrastructure called \"GCV\" which you can find in the src/libgcv subdirectory.  That's a newer plugin-based conversion system but it only has some of BRL-CAD's converters.  You could propose and work on migrating any/all converters in src/conv that are not yet in src/libgcv/plugins.   Even just doing one or two converters there would be very helpful forward progress and nowhere near as hard as implementing AP242 import support will be for someone with no STEP experience.</p>",
        "id": 343018681,
        "sender_full_name": "Sean",
        "timestamp": 1679283300
    },
    {
        "content": "<p>Alright, I better do a simpler project first, I'll look into GCV</p>",
        "id": 343098481,
        "sender_full_name": "Nishanth",
        "timestamp": 1679313664
    }
]