[
    {
        "content": "<p>Thank you @Sean for your response about why you started developing for BRL-CAD.</p>\n<p>Looking at the Open-Source community I see a lot of hardworking and intelligent people spending their valuable time on projects that might not having any monetary value; and I can't help but question their motives. I strongly believe Open-Source development is the key to a better future as it is one of the only places I see true cooperation. Sure, maybe at a nice software engineering company there's going to be tons of like-minded people helping each other out but its probably not the same kind of passion seen in Open-Source. I mean, how do you really know if the person working with you actually enjoys doing so? It's only when someone dedicates their own free time that you can truly see their character.</p>\n<p>In the media these days all you see are people fighting about trivial issues and every message or event seems to have an underlying purpose that's motivated by greed. Take for example this contest: Google is probably only hosting GCI to improve their public relations as they plan to introduce more school-based tech platforms. Regardless, what they're doing isn't necessarily a bad thing since more kids are learning about the benefits and conditions of Open Source development and that's always nice. </p>\n<p>I'm just really glad that even though we live in such tremulous times there's still silver linings like Open-Source that remind you that people aren't all that bad and that we can come together regardless of culture, race, sex, or political beliefs.</p>",
        "id": 119420252,
        "sender_full_name": "Mahdi",
        "timestamp": 1512595152
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"cixix@balanc3r.com\" data-user-id=\"104255\">@Mahdi</span> If you win, you'll get to hear directly from them why Google does things like GCI and GSoC.  Sure it's not bad for public relations, but the Google Open Source Programs Office very clearly haven't being doing this for 10+ years, costing millions of dollars per year, just for PR.  They very evidently don't do this as a recruitment strategy either.  There's a consistency in what they do and in their message for why they do it.  They're trying to get more people involved in open source.  This includes getting you introduced as early as possible.  They don't embrace open source just because it's good for them, but because it's good for everyone.  It's a better way of doing development.</p>",
        "id": 119439895,
        "sender_full_name": "Sean",
        "timestamp": 1512636118
    },
    {
        "content": "<p>Google IS one of the well-known open source developers. You can't deny that. They develop a lot of Open Source software. By introducing you to open source, Google can directly benefit from you (i.e you will contribute to Google's open source projects, etc.). Google even use open source software not developed by them (Linux for example, they can benefit from your bug-fixes for Linux)</p>",
        "id": 119445145,
        "sender_full_name": "Naseef",
        "timestamp": 1512647836
    },
    {
        "content": "<p>What's wrong about non-free software? Was GNU being insane about such software?</p>",
        "id": 121049325,
        "sender_full_name": "Naseef",
        "timestamp": 1515944639
    },
    {
        "content": "<p>I don't think proprietary software is inherently bad but the way it has been used has made me believe that we're better off using open source. With all the different licensing issues and copyright claims people might start thinking that even though they might have a cool idea they can't execute it without being called out on it. The legal hurdles really limit peoples' creativity because even if your idea was only somewhat based off of someone else's they could potentially bring you down.</p>",
        "id": 121049468,
        "sender_full_name": "Mahdi",
        "timestamp": 1515944891
    },
    {
        "content": "<p>With open source software everyone feels as if they're a part of a community instead of just grunts trying to satisfy their bosses</p>",
        "id": 121049475,
        "sender_full_name": "Mahdi",
        "timestamp": 1515944992
    },
    {
        "content": "<p>How do people working with open source make money to live? Most of them have a day job in which they develop non-free software.</p>",
        "id": 121049572,
        "sender_full_name": "Naseef",
        "timestamp": 1515945169
    },
    {
        "content": "<p>Yeah because you need to work to survive. Paid software creates jobs and feeds families but the underlying motives for developing those kinds of products aren't really genuine. Usually, it's just about getting money rather than contributing something or feeling content.</p>",
        "id": 121049672,
        "sender_full_name": "Mahdi",
        "timestamp": 1515945434
    },
    {
        "content": "<p>I think the whole philosophy behind open source stems off of the decade long rift between socialism vs capitalism</p>",
        "id": 121049673,
        "sender_full_name": "Mahdi",
        "timestamp": 1515945463
    },
    {
        "content": "<p>Do you study philosophy?</p>",
        "id": 121049769,
        "sender_full_name": "Naseef",
        "timestamp": 1515945629
    },
    {
        "content": "<p>Not academically but I suppose if you can critically process things you can be considered a philosopher.</p>",
        "id": 121049823,
        "sender_full_name": "Mahdi",
        "timestamp": 1515945753
    },
    {
        "content": "<p>Wbu</p>",
        "id": 121049825,
        "sender_full_name": "Mahdi",
        "timestamp": 1515945756
    },
    {
        "content": "<p>NULL</p>",
        "id": 121049833,
        "sender_full_name": "Naseef",
        "timestamp": 1515945840
    },
    {
        "content": "<blockquote>\n<p>How do people working with open source make money to live?Most of them have a day job in which they develop non-free software.</p>\n</blockquote>\n<p>I don't think that's true.  Many working in open source make money in a day job that supports them working on open source.  The</p>",
        "id": 121116639,
        "sender_full_name": "Sean",
        "timestamp": 1516088141
    },
    {
        "content": "<p>it's not to say that is the whole picture, but you certainly can get paid to work on open source.  they tend to be companies that see open source as commodity or promoting their business interests or saves them money in the long run or a host of other reasons.</p>",
        "id": 121116771,
        "sender_full_name": "Sean",
        "timestamp": 1516088272
    }
]