[
    {
        "content": "<p>Hello, I am participating in GCI. The BRL-CAD tasks are very ineteresting.</p>",
        "id": 185125686,
        "sender_full_name": "Alin Tcaci",
        "timestamp": 1578498608
    },
    {
        "content": "<p>Then Welcome to BRL-CAD <span class=\"user-mention\" data-user-id=\"257344\">@Alin Tcaci</span></p>",
        "id": 185125883,
        "sender_full_name": "Thusal Ranawaka",
        "timestamp": 1578498687
    },
    {
        "content": "<p>Hello, I am participating in GCI. The BRL-CAD tasks are very ineteresting, especially the task \"Do our 3D chess set tutorial and submit feedback\" because I like chess and I can learn many things from it.</p>",
        "id": 185199190,
        "sender_full_name": "Alin Tcaci",
        "timestamp": 1578565368
    },
    {
        "content": "<p>hello world , i m also participating in GCI. the tasks are educational and intresting at the same time!!!!</p>",
        "id": 185301887,
        "sender_full_name": "adI bhai",
        "timestamp": 1578655717
    },
    {
        "content": "<p>Yash Patel: Hello,</p>\n<p>I hope you all are doing good and most importantly safe.</p>\n<p>I am aiming for participating in this year's Google Season Of Docs and can't wait to help developing documentation.</p>\n<p>I really liked this organization and went thoroughly through the website, documentation, and Github and it seems like I am really interested in contributing to this throughout the period of GSoD as well as later too.<br>\n.<br>\nI am eager to start working on it and would like to share my proposal statement of interest with you in a couple of days. As a part of it, I am really interested to get started on the development of documentation and eager to have some inputs from your side for a kickstart if there are some important points to consider.</p>\n<p>Also, I hope I am not too late (primarily because of university end-semester exams) and have the slot still open for applying. It would be great to confirm from your side before any miscommunication.</p>\n<p>If eligible, I would like to share my resume and some other links/samples for your reference. Hope to hear from you soon.</p>\n<p>Thanking You.</p>\n<p>Regards,<br>\nYash R Patel</p>\n<p>Yash Patel: I would like to receive some updates and guidance to start with if the technical writer is yet not hired for BRL-CAD GSoD 2021 :)</p>",
        "id": 236319153,
        "sender_full_name": "Yash Patel",
        "timestamp": 1619522539
    },
    {
        "content": "<p>i want open dwg file</p>",
        "id": 462485566,
        "sender_full_name": "qy",
        "timestamp": 1723704295
    }
]