[
    {
        "content": "<p>Hi all, just FYI, I did submit an application for BRL-CAD to participate in the 2021 Season of Docs.  There were a number of significant changes this year including the proposal and stipend format.  As such, if we're approved, there is the option for up to three mentors to be reimbursed $500 for their efforts, and $7560 to a technical writer.</p>\n<p>If you are interested in mentoring, please send me a private message.  If you're interested in participating as a technical writer, please open a topic thread here and introduce yourself.  As always, priority will go towards technical writers interested in getting involved in open source more, interested in learning technical infrastructure.  Students that apply to GSoC are generally not ideally suited for the Season of Docs.</p>",
        "id": 232004030,
        "sender_full_name": "Sean",
        "timestamp": 1616779828
    },
    {
        "content": "<p>Hello everyone,i am seun by name and i am interested in migrating BRL-CAD's Documentation Infrastructure,i am excited and energised  to see Docbook files are fully converted to AsciiDoc.</p>\n<p>Thank you</p>",
        "id": 235073464,
        "sender_full_name": "Seun",
        "timestamp": 1618753761
    },
    {
        "content": "<p>Hi everyone. My name is Indermohan Singh. I'm a technical writer, author, and software developer interested in working with BRL-CAD in this GSoD. I'd like to work on the \"Organize and publish developer docs\" project. I have extensive experience in writing developer-centric docs and tutorials. Looking forward to it.</p>",
        "id": 235963390,
        "sender_full_name": "Indermohan Singh",
        "timestamp": 1619263812
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"102902\">@Sean</span> ,<br>\nI'm Kritika Srivastava and interested in working as a Technical Writer for BRL-CAD under GSoD '21.<br>\nI have gone through the details mentioned <a href=\"https://brlcad.org/wiki/Google_Season_of_Docs/Proposal#Project_Budget\">here</a>.<br>\nYou can find my previous work on my <a href=\"https://github.com/kritika-srivastava\">GitHub </a> and <a href=\"https://kritikajournals.tech/\">personal blog</a>.<br>\nI had to ask about the prerequisites, getting started, and the application process for this project.<br>\nI also wish to draft a detailed proposal for this project with detailed information on the points mentioned in the application along with the set timelines once approved by project mentors to start working on my proposal.</p>",
        "id": 235988407,
        "sender_full_name": "Kritika Srivastava",
        "timestamp": 1619285836
    },
    {
        "content": "<p>Welcome <span class=\"user-mention\" data-user-id=\"407874\">@Indermohan Singh</span> and <span class=\"user-mention\" data-user-id=\"407919\">@Kritika Srivastava</span> !  Thank you for your introductions.  What can you tell me about the project and how you'd intend to approach it?</p>",
        "id": 236280801,
        "sender_full_name": "Sean",
        "timestamp": 1619496510
    },
    {
        "content": "<p>Hi, <span class=\"user-mention\" data-user-id=\"102902\">@Sean</span> thanks for the welcome message. For the project \"Organize and publish developer docs\". Following are the things I would like to do:</p>\n<ol>\n<li><strong>Deeper Understanding of the API</strong>: In my opinion, the quality of documentation is the most important aspect of this project. So understanding the fine detail of BRL-CAD is a must. That's number one on my list. </li>\n<li><strong>Writing Documentation</strong>: As mentioned on the project's page, Writing Doxygen-based documentation is the project's main deliverables. That's something I would be doing for sure. But again my priority would be to go for quality first and then reach for full code coverage.</li>\n<li><strong>Generating HTML/PDF Docs</strong>: This would be the last and final step. I'd also like to explore if there is a possibility of <strong>writing a theme/custom website</strong> for HTML Docs myself. </li>\n<li>And finally one of the most crucial steps is to get as much feedback from the BRL-CAD dev community and guidance from the assigned mentor. </li>\n</ol>\n<p>This is an informal and brief proposal. I'll be soon finishing my formal proposal and submit that. Meantime here is some of my work on writing documentation and tutorials: <a href=\"https://auth0.com/blog/authors/indermohan-singh/\">Auth0 Blog</a>, <a href=\"https://blog.logrocket.com/author/indermohansingh/\">Logrocket Blog</a>, <a href=\"https://imsingh.github.io/rxjs-audio/\">RxJS-Audio Docs</a></p>\n<p>Looking forward to your comment.<br>\nInder</p>",
        "id": 236856103,
        "sender_full_name": "Indermohan Singh",
        "timestamp": 1619797387
    },
    {
        "content": "<p>Hello all!  I'm happy to announce that we have invited <span class=\"user-mention\" data-user-id=\"405360\">@Dashamir Hoxha</span> to work for us this season on our documentation infrastructure.</p>\n<p>Thank you all for your interest, proposals, discussion, and consideration getting selected for the 2021 Google Season of Docs.   It was a very complicated decision this year with several very strong candidates under final consideration.  Among them, Dashamir was selected for his early, frequent, and strong communication skills; extensive Docbook experience (author of docbookwiki); technical writing experience; and solid alignment with the needs of BRL-CAD's documentation project this year.</p>\n<p>If any that were not accepted are interested in providing documentation infrastructure testing and review support for the Season of Docs project, we do have a mentoring position open to anyone.  It entails approximately 10 hours of effort over 4 weeks, compensated.  Please send me a private message if you're interested.</p>",
        "id": 239128999,
        "sender_full_name": "Sean",
        "timestamp": 1621272587
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"102902\">@Sean</span> thank you for trusting me this year. I will try to do my best.</p>\n<p>I am starting by reading HACKING_BRL-CAD.pdf, while at the same time getting familiar with Antora and AsciiDoc. I estimate that this should take me about 2-3 weeks.</p>\n<p>If you don't have any other preferences, I am going to report on this channel at the end of each week about the progress and what I plan to do next.</p>",
        "id": 239192264,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1621307661
    },
    {
        "content": "<p>Awesome! Welcome <span class=\"user-mention\" data-user-id=\"405360\">@Dashamir Hoxha</span> We're glad to have you here.</p>",
        "id": 239202342,
        "sender_full_name": "Sahibpreet Kaur",
        "timestamp": 1621317805
    },
    {
        "content": "<p>I had a look at <code>HACKING_BRL-CAD.pdf</code> and at the directory <code>doc/docbook/</code>. I also started to read the docs of Antora. It seems that this project is going to be more exciting than I thought. I am trying to figure out how to categorize  the docs of BRL-CAD and how to display them on the Antora structure.</p>\n<p>Usually the docs of a project are divided into <strong>user docs</strong> and <strong>developer docs</strong> (which includes also how to contribute). The <strong>user docs</strong> are usually categorized further into <strong>tutorials</strong> (including how to get started), <strong>guides</strong>, <strong>howto-s</strong>, and <strong>manuals</strong>. I should find out (maybe with some help) how to fit the existing docs into these categories, and how to represent them in the new docs site.</p>\n<p>Another thing is versioning of the docs, which is supported by Antora, and translations to other languages, which I am not sure yet whether it can be supported, but I have to see (Antora is extensible and maybe can be customized to support this as well).</p>\n<p>Although  <code>HACKING_BRL-CAD.pdf</code> recommends using the SVN repo on SourceForge, I would prefer to start a new repo for the new docs on <a href=\"https://github.com/BRL-CAD\">https://github.com/BRL-CAD</a>, separate from the main code repo. Maybe later it can also be merged with the wiki repo and the homepage repo.</p>\n<p>For the next week I will continue to learn more about the details of Antora and AsciiDoc, from <a href=\"https://docs.antora.org/\">https://docs.antora.org/</a></p>",
        "id": 239806387,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1621627652
    },
    {
        "content": "<p>Yes, the SVN advice is obsolete - we have transitioned to Github now.</p>",
        "id": 239809405,
        "sender_full_name": "starseeker",
        "timestamp": 1621629223
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"405360\">@Dashamir Hoxha</span> that's great and all your observations look spot-on.  Historically, I would have agreed about user docs vs. dev docs too, but there has been a trend the last few years to adjust that categorization/characterization.</p>",
        "id": 240134838,
        "sender_full_name": "Sean",
        "timestamp": 1621908144
    },
    {
        "content": "<p>In a nutshell, the trend has been towards recognizing all the potential roles of participants whether users or not, as anyone can be a contributor, but to also value other non-dev forms of contribution including graphic designers, community management, public relations, and developers.</p>",
        "id": 240134940,
        "sender_full_name": "Sean",
        "timestamp": 1621908266
    },
    {
        "content": "<p>We emphasize contributors in our HACKING BRL-CAD book, and I do think that is a central theme to our project in general.  The project is also lacking several important governance docs that I started working on a couple months back but will be a process.</p>",
        "id": 240135056,
        "sender_full_name": "Sean",
        "timestamp": 1621908399
    },
    {
        "content": "<p>A good article on the subject: <a href=\"https://opensource.com/article/19/12/open-source-contributors\">https://opensource.com/article/19/12/open-source-contributors</a></p>",
        "id": 240135151,
        "sender_full_name": "Sean",
        "timestamp": 1621908563
    },
    {
        "content": "<p>As for docs, definitely good idea to plan for a new github repo, so you have a clean slate to work with at least initially.  I suggest just starting without any categorization or organization, and focus on setting up the About BRL-CAD article which presently resides in the repo in a couple languages.  From there, maybe do the MGED tutorial series next (which is essentially 16 tutorials).</p>\n<p>That will give some time and familiar context/content to consider next steps and organizational needs next.  I don't think we'll have time to solve all our doc organizing needs, but that way will give more time for thinking about it and not having you spend too much time on something that might change (a lot).</p>",
        "id": 240135357,
        "sender_full_name": "Sean",
        "timestamp": 1621908834
    },
    {
        "content": "<p>I agree. Let me first finish the conversion/migration of the docs without worrying much about the \"perfect\" structure, and later we can think about better organization, de-duplication, etc.</p>",
        "id": 240136056,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1621909696
    },
    {
        "content": "<p>I finished reading the Antora docs (or at least skimming through them).<br>\nI also read some other blogs and tutorials about Antora and AsciiDoc, like:</p>\n<ul>\n<li><a href=\"https://fedoramagazine.org/using-antora-for-your-open-source-documentation/\">https://fedoramagazine.org/using-antora-for-your-open-source-documentation/</a></li>\n<li><a href=\"https://blog.swwomm.com/2020/10/antora-quick-start-tutorial.html\">https://blog.swwomm.com/2020/10/antora-quick-start-tutorial.html</a></li>\n<li><a href=\"https://www.vogella.com/tutorials/AsciiDoc/article.html\">https://www.vogella.com/tutorials/AsciiDoc/article.html</a></li>\n<li><a href=\"https://dzone.com/articles/continuous-documentation-with-antora-and-travis-1\">https://dzone.com/articles/continuous-documentation-with-antora-and-travis-1</a></li>\n<li><a href=\"https://evaparish.com/blog/2018/10/19/antora-and-docusaurus-duke-it-out\">https://evaparish.com/blog/2018/10/19/antora-and-docusaurus-duke-it-out</a></li>\n</ul>\n<p>I also tested a few tools for converting DocBook to AsciiDoc, like:</p>\n<ul>\n<li><a href=\"http://pandoc.org/\">http://pandoc.org/</a></li>\n<li><a href=\"https://github.com/oreillymedia/docbook2asciidoc/\">https://github.com/oreillymedia/docbook2asciidoc/</a></li>\n<li><a href=\"https://github.com/asciidoctor/docbookrx\">https://github.com/asciidoctor/docbookrx</a></li>\n</ul>\n<p>The best one seems to be <code>docbookrx</code>, although it is not perfect. For example it does not handle <code>&lt;part&gt;</code> elements (I submitted a pull request for fixing it: <a href=\"https://github.com/asciidoctor/docbookrx/pull/69\">https://github.com/asciidoctor/docbookrx/pull/69</a>).</p>\n<p>Then I started to convert the HACKING book into the Antora format:</p>\n<ul>\n<li><a href=\"https://brlcad.fs.al/docs/\">https://brlcad.fs.al/docs/</a></li>\n<li><a href=\"https://github.com/dashohoxha/brlcad-docs\">https://github.com/dashohoxha/brlcad-docs</a></li>\n</ul>\n<p>It seems like splitting each chapter into a separate page gives the best results.<br>\nFor the time being I am using a single component for all the docs, where each book is a module (and also a group of related articles is going to be a module).</p>\n<p>To handle translations of docs to other languages, I am using a separate component for each language. Another solution could have been to use a different playbook for each language. This approach could also allow the UI template to be different for each language (and potentially translated and customized). However the first approach (using separate components) allows different language docs to (potentially) use the same figures, the same examples, etc.</p>\n<p>It seems that the issue of multiple-language support is still being discussed and developed in the Antora community:</p>\n<ul>\n<li><a href=\"https://gitlab.com/antora/antora/-/issues/208\">https://gitlab.com/antora/antora/-/issues/208</a></li>\n<li><a href=\"https://gitlab.com/antora/antora/-/merge_requests/548\">https://gitlab.com/antora/antora/-/merge_requests/548</a></li>\n</ul>\n<p>For the time being I am not planning any versioning for the docs, but this can be handled easily in Antora with a (git) branch of the docs matching each version of the software.</p>\n<p>Next week I am going to continue with converting some more docs and adding them to the test site.</p>",
        "id": 240664519,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1622238596
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"405360\">@Dashamir Hoxha</span> this is excellent progress.  Love that you submitted a fix to the docbookrx folks.</p>",
        "id": 241346272,
        "sender_full_name": "Sean",
        "timestamp": 1622692905
    },
    {
        "content": "<p>A couple issues I noticed, <a href=\"https://brlcad.fs.al/docs/hacking-brlcad/part2/chapter3.html\">https://brlcad.fs.al/docs/hacking-brlcad/part2/chapter3.html</a> has stray footnote tags that don't appear to have converted cleanly.</p>",
        "id": 241346319,
        "sender_full_name": "Sean",
        "timestamp": 1622692941
    },
    {
        "content": "<p>Also, the spanish about page appears to be in english -- what happened there?</p>",
        "id": 241346328,
        "sender_full_name": "Sean",
        "timestamp": 1622692978
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/241346319\">said</a>:</p>\n<blockquote>\n<p><a href=\"https://brlcad.fs.al/docs/hacking-brlcad/part2/chapter3.html\">https://brlcad.fs.al/docs/hacking-brlcad/part2/chapter3.html</a> has stray footnote tags that don't appear to have converted cleanly.</p>\n</blockquote>\n<p>The footnotes of that page seem to be correct. I don't see where is the problem.</p>",
        "id": 241487383,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1622777614
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/241346328\">said</a>:</p>\n<blockquote>\n<p>Also, the spanish about page appears to be in english -- what happened there?</p>\n</blockquote>\n<p>Actually the about page is not translated in Spanish (at least I cannot find it).<br>\nMaybe I used the English page just just for mocking, and later forgot to delete it.<br>\nI am going to remove it.</p>",
        "id": 241487732,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1622777996
    },
    {
        "content": "<p>By the way, I have started using <a href=\"https://github.com/dashohoxha/brlcad-docs/issues\">https://github.com/dashohoxha/brlcad-docs/issues</a> and <a href=\"https://github.com/dashohoxha/brlcad-docs/projects/1\">https://github.com/dashohoxha/brlcad-docs/projects/1</a> to manage the tasks, bugs, etc. and track/record the progress of the project.</p>",
        "id": 241487993,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1622778325
    },
    {
        "content": "<p>I created an issue there about the Spanish about page: <a href=\"https://github.com/dashohoxha/brlcad-docs/issues/11\">https://github.com/dashohoxha/brlcad-docs/issues/11</a><br>\nBut you (the mentors etc.) can create bug reports yourself, if you wish.</p>",
        "id": 241488122,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1622778487
    },
    {
        "content": "<p>In general, the automatic conversion has lots of problems (as you probably know), and there are many things that need to be fixed manually. For example image paths need to be fixed, <code>&lt;informalfigure&gt;</code> is not converted, sometimes titles are broken, paragraphs have a broken formatting, sometimes tables are not converted properly, etc.</p>\n<p>I am trying to fix as many of these problems as I can, but sometimes it is a bit difficult for me to spot a problem because I am not quite familiar with the BRL-CAD itself and its docs. For example I suspect that some of the tables in the MGED tutorials have not been converted properly, however I cannot tell quickly which ones are broken.</p>\n<p>If you (the mentors and the community) could make a quick review of the converted docs and report any problems (for example by opening bug issues at <a href=\"https://github.com/dashohoxha/brlcad-docs/issues\">https://github.com/dashohoxha/brlcad-docs/issues</a>), it would be great.</p>\n<p>But let me make the first pass of the review myself. For the time being I am still reviewing the MGED tutorials myself, and then I am going to review the About pages and the HACKING book. I will let you know when I am done, so that you can start reviewing them.</p>",
        "id": 241488889,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1622779434
    },
    {
        "content": "<p>For the next week, besides the review of the existing docs, I will also try to convert and add the articles and the rest of the books.</p>",
        "id": 241489001,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1622779546
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/241346319\">said</a>:</p>\n<blockquote>\n<p><a href=\"https://brlcad.fs.al/docs/hacking-brlcad/part2/chapter3.html\">https://brlcad.fs.al/docs/hacking-brlcad/part2/chapter3.html</a> has stray footnote tags that don't appear to have converted cleanly.</p>\n</blockquote>\n<p>Now I see the problem.<br>\n<a href=\"https://github.com/dashohoxha/brlcad-docs/issues/13\">https://github.com/dashohoxha/brlcad-docs/issues/13</a><br>\nI am fixing it.</p>",
        "id": 241927256,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1623162228
    },
    {
        "content": "<blockquote>\n<p>But let me make the first pass of the review myself.</p>\n</blockquote>\n<p>I am done with the About pages and the HACKING book. I also fixed the MGED lessons (English): <a href=\"https://brlcad.fs.al/docs/lessons/mged.html\">https://brlcad.fs.al/docs/lessons/mged.html</a></p>\n<p>However I am  still working to fix the tables on the Spanish lessons (I should be able to do it quickly since I already know how to fix them). Besides the tables, there were many other things to be fixed manually in the lessons, so it took me longer than expected.</p>\n<p>I am planning to make an update of the English lessons, once the conversion of all the docs is finished:<br>\n<a href=\"https://github.com/dashohoxha/brlcad-docs/issues/17\">https://github.com/dashohoxha/brlcad-docs/issues/17</a><br>\nAny suggestions about what to fix or improve are welcome.<br>\nPlease add them as comments to the issue above, or create new issues at:<br>\n<a href=\"https://github.com/dashohoxha/brlcad-docs/issues/\">https://github.com/dashohoxha/brlcad-docs/issues/</a></p>",
        "id": 242440116,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1623490680
    },
    {
        "content": "<blockquote>\n<p>I am still working to fix the tables on the Spanish lessons </p>\n</blockquote>\n<p>Done: <a href=\"https://brlcad.fs.al/docs/es/lecciones/mged.html\">https://brlcad.fs.al/docs/es/lecciones/mged.html</a></p>",
        "id": 242462862,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1623520273
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"405360\">@Dashamir Hoxha</span> awesome progress!  This is looking really great.</p>",
        "id": 242549831,
        "sender_full_name": "Sean",
        "timestamp": 1623644291
    },
    {
        "content": "<p>So right now, it looks like translations are basically being handled as separate documents, manually inserted into the hierarchy?</p>",
        "id": 242550086,
        "sender_full_name": "Sean",
        "timestamp": 1623644620
    },
    {
        "content": "<p>Is there a way to register them automatically so that while looking at an article or lesson, for example, it's possible to see a list of translations available?</p>",
        "id": 242550141,
        "sender_full_name": "Sean",
        "timestamp": 1623644659
    },
    {
        "content": "<p>I'm seeing in <a href=\"https://gitlab.com/antora/antora/-/issues/208\">https://gitlab.com/antora/antora/-/issues/208</a> that multilingual support appears to be lacking for anything beyond having separate doc sets.  Maybe adopting a convention internally, but not something Antora itself can help manage.</p>",
        "id": 242551336,
        "sender_full_name": "Sean",
        "timestamp": 1623645802
    },
    {
        "content": "<p>looks like what the fedora folks are doing is running their english docs through something that extracts pot/po files during a compilation step, which are then translated and re-constituted into new .adoc files.  so instead of having es/ru/whatever copies of docs, they're just extracting the phrases and maintaining the translations through toolings.</p>",
        "id": 242551616,
        "sender_full_name": "Sean",
        "timestamp": 1623646027
    },
    {
        "content": "<p>we're definitely not set up to go in that direction right now, so I'm thinking your work is strong evidence that we should re-focus our efforts on just english for now.  the rest is</p>",
        "id": 242551949,
        "sender_full_name": "Sean",
        "timestamp": 1623646297
    },
    {
        "content": "<p>the rest can be revisited, and by then maybe antora will have something more to offer.  looks like they're somewhat working on it.</p>",
        "id": 242552023,
        "sender_full_name": "Sean",
        "timestamp": 1623646340
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/242550086\">said</a>:</p>\n<blockquote>\n<p>So right now, it looks like translations are basically being handled as separate documents, manually inserted into the hierarchy?</p>\n</blockquote>\n<p>Currently I am generating a separate documentation site for the Spanish docs (with <code>antora translations/build-es.yml</code>). This HTML files for this site are saved at <code>/var/www/html/docs/es/</code>.</p>\n<p>For the rest of the languages (including English) I am currently using a separate antora component for each language. All of them are generated with <code>antora build.yml</code> (or <code>antora build-dev.yml</code> for a local site). The HTML output is saved at <code>/var/www/html/docs/</code>, <code>/var/www/html/docs-it/</code>, etc.</p>\n<p>So, the Spanish docs are inserted inside the English docs directory, and English docs directory is inserted inside the BRL-CAD website directory. Hence the would be accessed like <code>https://brlcad.org/docs/</code>, <code>https://brlcad.org/docs/es/</code>, <code>https://brlcad.org/docs-it/</code>, etc.</p>\n<p>It is also possible to use subdomains, if wished, like: <code>https://docs.brlcad.org/</code>, <code>https://es.docs.brlcad.org</code> (or <code>https://docs.brlcad.org/es/</code>), <code>https://docs-it.brlcad.org/</code>, etc. But it seems like the first approach is simpler.</p>",
        "id": 242771426,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1623778943
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/242550141\">said</a>:</p>\n<blockquote>\n<p>Is there a way to register them automatically so that while looking at an article or lesson, for example, it's possible to see a list of translations available?</p>\n</blockquote>\n<p>For the time being I am using a list <a href=\"https://raw.githubusercontent.com/dashohoxha/brlcad-docs/main/translations/es/modules/ROOT/partials/translations.adoc\">like this</a>, which is included on the docs site and looks <a href=\"https://brlcad.fs.al/docs/es/#_translations\">like this</a>. This approach can be made more granular (for each article or lesson) and maybe embedded nicely on a doc page (for example like a drop-down list on a corner). These translation lists can be maintained manually, or maybe can be generated automatically with some scripts. But I think it's not worth (to make them more granular and to make efforts to generate them automatically), especially since BRL-CAD does not have lots or doc pages translated.</p>",
        "id": 242772471,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1623779418
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/242551616\">said</a>:</p>\n<blockquote>\n<p>looks like what the fedora folks are doing is running their english docs through something that extracts pot/po files during a compilation step, which are then translated and re-constituted into new .adoc files.  so instead of having es/ru/whatever copies of docs, they're just extracting the phrases and maintaining the translations through toolings.</p>\n</blockquote>\n<p>Some people on that discussion issue think that this approach is not a good one (because translation gets out of context, it is easy to break the structure of asciidoc and it is difficult to debug and fix, etc.) I agree with them.</p>",
        "id": 242772896,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1623779627
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/242552023\">said</a>:</p>\n<blockquote>\n<p>the rest can be revisited, and by then maybe antora will have something more to offer.  looks like they're somewhat working on it.</p>\n</blockquote>\n<p>In my opinion translation is a difficult topic, and maybe there is no correct approach that works for all the cases.</p>\n<p>I even think that translation is not necessary, unless the software is a very popular one (like GNOME, KDE, LibreOffice, etc.) BRL-CAD does not seem to me like a software that needs to be translated, but maybe I am wrong.</p>\n<p>For example I tried to translate the About page into Albanian, and I gave up, because I was not able to translate properly the very first paragraph <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 242773935,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1623780078
    },
    {
        "content": "<p>I agree that the dir-approach is simpler (and with the point that editing po/pot statements out of context is suboptimal).  We could always introduce rewrite rules on the server too.  But again, I think it's fine to just focus on getting the english site working as best possible, keep what you've done with the translations, but put them on a back shelf for now.</p>",
        "id": 243221583,
        "sender_full_name": "Sean",
        "timestamp": 1624067269
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"405360\">Dashamir Hoxha</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/242773935\">said</a>:</p>\n<blockquote>\n<p>For example I tried to translate the About page into Albanian, and I gave up, because I was not able to translate properly the very first paragraph <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>\n</blockquote>\n<p>LOL!</p>",
        "id": 243221641,
        "sender_full_name": "Sean",
        "timestamp": 1624067344
    },
    {
        "content": "<p>The about page is overdue a good re-writing.  It was originally written for a very different audience.</p>",
        "id": 243221723,
        "sender_full_name": "Sean",
        "timestamp": 1624067487
    },
    {
        "content": "<p>I have already converted the articles: <a href=\"https://brlcad.fs.al/docs/articles/index.html\">https://brlcad.fs.al/docs/articles/index.html</a><br>\nI had to split the <a href=\"https://brlcad.fs.al/docs/articles/mged/index.html\">MGED article</a> into smaller parts, because it was too big.</p>\n<p>However the user commands and developer commands of the MGED article still need to be reformatted and fixed (manually):</p>\n<ul>\n<li><a href=\"https://brlcad.fs.al/docs/articles/mged/developer-commands.html\">https://brlcad.fs.al/docs/articles/mged/developer-commands.html</a></li>\n<li><a href=\"https://brlcad.fs.al/docs/articles/mged/user-commands.html\">https://brlcad.fs.al/docs/articles/mged/user-commands.html</a></li>\n</ul>\n<p>I have decide to postpone this for later (after the conversion of all the other docs is done), because there is too much manual work to be done and may take a long time: <a href=\"https://github.com/dashohoxha/brlcad-docs/issues/19\">https://github.com/dashohoxha/brlcad-docs/issues/19</a><br>\nOr maybe this could be a good task for a student.</p>\n<p>Next week I am going to continue with converting the tutorials: <a href=\"https://github.com/dashohoxha/brlcad-docs/issues/10\">https://github.com/dashohoxha/brlcad-docs/issues/10</a></p>",
        "id": 243267366,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1624134333
    },
    {
        "content": "<p>That's looking fantastic <span class=\"user-mention\" data-user-id=\"405360\">@Dashamir Hoxha</span> !</p>",
        "id": 243391692,
        "sender_full_name": "Sean",
        "timestamp": 1624286222
    },
    {
        "content": "<p>I like the MGED breakup.  Begs for re-organization as it obviously has a Tutorial section and then there's the top-level Tutorials section.. and they overlap heavily in what they teach.</p>",
        "id": 243391957,
        "sender_full_name": "Sean",
        "timestamp": 1624286324
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"405360\">Dashamir Hoxha</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/243267366\">said</a>:</p>\n<blockquote>\n<p>I had to split the <a href=\"https://brlcad.fs.al/docs/articles/mged/index.html\">MGED article</a> into smaller parts, because it was too big.</p>\n</blockquote>\n<p>Too big of a page or too big for Antora to handle?</p>",
        "id": 243392533,
        "sender_full_name": "Sean",
        "timestamp": 1624286535
    },
    {
        "content": "<p>I did notice the command links on <a href=\"https://brlcad.fs.al/docs/articles/mged/developer-commands.html\">https://brlcad.fs.al/docs/articles/mged/developer-commands.html</a> aren't working -- is that part of the reformatting and fixing you mention?</p>",
        "id": 243393800,
        "sender_full_name": "Sean",
        "timestamp": 1624287083
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/243392533\">said</a>:</p>\n<blockquote>\n<p>Too big of a page or too big for Antora to handle?</p>\n</blockquote>\n<p>Too big of an article, Antora does not mind. Also, as you noticed, it mixes tutorials, command references, etc.</p>",
        "id": 243405745,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1624291872
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/243393800\">said</a>:</p>\n<blockquote>\n<p>I did notice the command links on <a href=\"https://brlcad.fs.al/docs/articles/mged/developer-commands.html\">https://brlcad.fs.al/docs/articles/mged/developer-commands.html</a> aren't working -- is that part of the reformatting and fixing you mention?</p>\n</blockquote>\n<p>Yes. The automatic conversion has failed to convert the id-s to anchors for each command, so the links are broken.</p>",
        "id": 243406369,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1624292179
    },
    {
        "content": "<p>Actually, to be honest, the <a href=\"https://github.com/BRL-CAD/brlcad/blob/main/doc/docbook/articles/mged.xml\">XML file</a> itself does not seem to be very well formatted, so maybe the converter is not to be blamed for all the mistakes and problems.</p>",
        "id": 243406748,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1624292372
    },
    {
        "content": "<p>If memory serves, it was originally a word doc, converted to an html doc, converted to docbook xml ... I think.</p>",
        "id": 243436951,
        "sender_full_name": "Sean",
        "timestamp": 1624306596
    },
    {
        "content": "<p>So not terribly surprising that the format could be less than optimal.  That said, it \"should\" be valid xml at least.  I'm pretty sure it goes through our conversion process which includes a validation pass and produces html/pdf output during doc compilation.</p>",
        "id": 243437118,
        "sender_full_name": "Sean",
        "timestamp": 1624306678
    },
    {
        "content": "<p>It is valid XML, and maybe valid DocBook too, but still the semantic structure is broken.<br>\nFor example look at <a href=\"https://github.com/BRL-CAD/brlcad/blob/main/doc/docbook/articles/mged.xml#L5677-L5724\">the details for <code>%</code></a>. There are some example paragraphs outside the definition of the term.<br>\nEven if we try to fix the XML file first, or fix the converter, it would still need to be done manually.</p>",
        "id": 243443068,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1624309632
    },
    {
        "content": "<p>Finished the tutorials: <a href=\"https://brlcad.fs.al/docs/tutorials/index.html\">https://brlcad.fs.al/docs/tutorials/index.html</a><br>\nCustom CSS styles: <a href=\"https://github.com/dashohoxha/brlcad-docs/blob/main/ui/src/css/custom.css\">https://github.com/dashohoxha/brlcad-docs/blob/main/ui/src/css/custom.css</a><br>\nI have also added some AsciiDoc examples on the TEMPLATE: <a href=\"https://brlcad.fs.al/docs/articles/TEMPLATE.html#_asciidoc_examples\">https://brlcad.fs.al/docs/articles/TEMPLATE.html#_asciidoc_examples</a><br>\nHowever I am not sure whether this is the right place for them. Maybe they should be added as a section to the HACKING book. What do you think?</p>",
        "id": 243972566,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1624656146
    },
    {
        "content": "<p>Next week I am going to look at the rest of the docs: devguides, presentations and specifications  (<a href=\"https://github.com/dashohoxha/brlcad-docs/issues/22\">https://github.com/dashohoxha/brlcad-docs/issues/22</a>)</p>",
        "id": 243972771,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1624656269
    },
    {
        "content": "<p>I don't remember my docbook xml well enough to know if a para is valid at the same level as a variablelist, but I see what you mean.. it's not grouped into a section or other logical construct.  It looks like several if not most of the examples are like that.</p>",
        "id": 243993299,
        "sender_full_name": "Sean",
        "timestamp": 1624680282
    },
    {
        "content": "<p>Not to say it's okay, but I imagine it's technically valid structure and a side-effect of the html-to-xml conversion.  It's like the whole thing is just one big stream of para's and lists.</p>",
        "id": 243993326,
        "sender_full_name": "Sean",
        "timestamp": 1624680353
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"405360\">Dashamir Hoxha</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/243972566\">said</a>:</p>\n<blockquote>\n<p>Finished the tutorials: <a href=\"https://brlcad.fs.al/docs/tutorials/index.html\">https://brlcad.fs.al/docs/tutorials/index.html</a></p>\n</blockquote>\n<p>That's looking really good.  Where are the navigation controls through?  Is that a setting or something that has to be manaully set up somewhere?</p>",
        "id": 243993561,
        "sender_full_name": "Sean",
        "timestamp": 1624680681
    },
    {
        "content": "<p>I'm referering to seeing Prev and Next controls at the bottom of each page so one can continue reading from section to section, doc to doc</p>",
        "id": 243993620,
        "sender_full_name": "Sean",
        "timestamp": 1624680749
    },
    {
        "content": "<blockquote>\n<p>Custom CSS styles: <a href=\"https://github.com/dashohoxha/brlcad-docs/blob/main/ui/src/css/custom.css\">https://github.com/dashohoxha/brlcad-docs/blob/main/ui/src/css/custom.css</a><br>\nI have also added some AsciiDoc examples on the TEMPLATE: <a href=\"https://brlcad.fs.al/docs/articles/TEMPLATE.html#_asciidoc_examples\">https://brlcad.fs.al/docs/articles/TEMPLATE.html#_asciidoc_examples</a><br>\nHowever I am not sure whether this is the right place for them. Maybe they should be added as a section to the HACKING book. What do you think?</p>\n</blockquote>\n<p>Yeah, I think it belongs elsewhere.  The template is intended to be just that -- a simple template for starting a new document, a new article.  An authorship guide like that is really necessary too, but probably belongs with either the HACKING BRL-CAD document or a stand-alone article of some sort incorporated into it.</p>",
        "id": 243994470,
        "sender_full_name": "Sean",
        "timestamp": 1624682432
    },
    {
        "content": "<p>So this is all looking really good enough that we'll soon want to look at what's needed to transition this into the production setup on <a href=\"http://brlcad.org\">brlcad.org</a> and into our repo.  Do you have thoughts on that -- what do you need?</p>",
        "id": 243994493,
        "sender_full_name": "Sean",
        "timestamp": 1624682518
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/243993326\">said</a>:</p>\n<blockquote>\n<p>Not to say it's okay, but I imagine it's technically valid structure and a side-effect of the html-to-xml conversion.  It's like the whole thing is just one big stream of para's and lists.</p>\n</blockquote>\n<p>The AsciiDoc output generated by the converter looks like a mess. But maybe I can fix some of the problems automatically using Emacs macros. I haven't tried it yet. Otherwise it would be too much manual work, because it is a huge section.</p>",
        "id": 243997001,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1624687035
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/243993561\">said</a>:</p>\n<blockquote>\n<p>Where are the navigation controls through?  Is that a setting or something that has to be manaully set up somewhere?</p>\n</blockquote>\n<p>I am not sure. So far I have been using the default settings. Maybe it is a setting or maybe I need to customize the UI template. I am going to look into it: <a href=\"https://github.com/dashohoxha/brlcad-docs/issues/26\">https://github.com/dashohoxha/brlcad-docs/issues/26</a></p>",
        "id": 243997158,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1624687315
    },
    {
        "content": "<p>Example is right in antora's own docs, e.g., <a href=\"https://docs.antora.org/antora/2.3/run-antora/\">https://docs.antora.org/antora/2.3/run-antora/</a></p>",
        "id": 243997333,
        "sender_full_name": "Sean",
        "timestamp": 1624687576
    },
    {
        "content": "<p>It's interesting that it even jumps from doc to doc, like this one: <a href=\"https://docs.antora.org/antora/2.3/antora-container/\">https://docs.antora.org/antora/2.3/antora-container/</a></p>",
        "id": 243997344,
        "sender_full_name": "Sean",
        "timestamp": 1624687634
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/243994493\">said</a>:</p>\n<blockquote>\n<p>So this is all looking really good enough that we'll soon want to look at what's needed to transition this into the production setup on <a href=\"http://brlcad.org\">brlcad.org</a> and into our repo.  Do you have thoughts on that -- what do you need?</p>\n</blockquote>\n<p>We can fork or migrate the repo to <a href=\"https://github.com/BRL-CAD/\">https://github.com/BRL-CAD/</a> at anytime. I am not sure whether the issues and the project (<a href=\"https://github.com/dashohoxha/brlcad-docs/projects/1\">https://github.com/dashohoxha/brlcad-docs/projects/1</a>) can be migrated as well.</p>\n<p>I would need some info about how you host and manage your website (<a href=\"https://brlcad.org/\">https://brlcad.org/</a>). Maybe we can schedule an online meeting with the webmaster(s) and discuss about how to publish the antora docs on the website.</p>\n<p>Basically, antora needs to be installed, repository should be cloned, and then these commands can generate the docs: <code>antora build.yml</code> and <code>antora translations/build-es.yml</code>.</p>",
        "id": 243997700,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1624688180
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/243993561\">said</a>:</p>\n<blockquote>\n<p>Where are the navigation controls through?  Is that a setting or something that has to be manaully set up somewhere?</p>\n</blockquote>\n<p>It was fixed by setting the attribute <code>page-pagination</code>: <a href=\"https://github.com/dashohoxha/brlcad-docs/issues/26\">https://github.com/dashohoxha/brlcad-docs/issues/26</a></p>",
        "id": 244030871,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1624736375
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/243994493\">said</a>:</p>\n<blockquote>\n<p>So this is all looking really good enough that we'll soon want to look at what's needed to transition this into the production setup on <a href=\"http://brlcad.org\">brlcad.org</a> and into our repo.  Do you have thoughts on that -- what do you need?</p>\n</blockquote>\n<p>It seems that if you give me access to create new repos on <a href=\"https://github.com/BRL-CAD/\">https://github.com/BRL-CAD/</a>, I should be able to transfer my repo there (including issues and everything).</p>\n<p><a href=\"/user_uploads/1549/pdsETK2O3OtXepvHXJ5fJ_H9/transfer-ownership.png\">transfer-ownership.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/1549/pdsETK2O3OtXepvHXJ5fJ_H9/transfer-ownership.png\" title=\"transfer-ownership.png\"><img src=\"/user_uploads/1549/pdsETK2O3OtXepvHXJ5fJ_H9/transfer-ownership.png\"></a></div>",
        "id": 244083252,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1624825594
    },
    {
        "content": "<p>The other way may also be possible:<br>\nif I give you full access to my repo, you should be able to transfer it to <a href=\"https://github.com/BRL-CAD/\">https://github.com/BRL-CAD/</a></p>",
        "id": 244083381,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1624825815
    },
    {
        "content": "<p><code>BRL_CAD_g_format_V5</code> and <code>BRL_CAD_g_format_V6</code> seem to be almost identical, so I published only the latest. Please let me know if I am missing something.</p>",
        "id": 244344255,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1624999070
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"405360\">Dashamir Hoxha</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/244083252\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/243994493\">said</a>:<br>\nIt seems that if you give me access to create new repos on <a href=\"https://github.com/BRL-CAD/\">https://github.com/BRL-CAD/</a>, I should be able to transfer my repo there (including issues and everything).</p>\n<p><a href=\"/user_uploads/1549/pdsETK2O3OtXepvHXJ5fJ_H9/transfer-ownership.png\">transfer-ownership.png</a></p>\n</blockquote>\n<p>Awesome, let's do that then.  I sent you an invitation request.</p>",
        "id": 244350951,
        "sender_full_name": "Sean",
        "timestamp": 1625002411
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"405360\">Dashamir Hoxha</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/244344255\">said</a>:</p>\n<blockquote>\n<p><code>BRL_CAD_g_format_V5</code> and <code>BRL_CAD_g_format_V6</code> seem to be almost identical, so I published only the latest. Please let me know if I am missing something.</p>\n</blockquote>\n<p>We're currently on v5.  Our next major release that breaks file compatibility is going to be v6, so that document was a placeholder for all the hard-breaking changes.  There's not so much on 'main' but there may be more changes on the v6 development branch but I don't know that for sure.  There might not be much to say about v6.  If there's not, I'd suggest we eliminate the document until there's something important to say.  What were the differences you noticed?</p>",
        "id": 244351372,
        "sender_full_name": "Sean",
        "timestamp": 1625002674
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/244350951\">said</a>:</p>\n<blockquote>\n<p>Awesome, let's do that then.  I sent you an invitation request.</p>\n</blockquote>\n<p>I did it and it worked: <a href=\"https://github.com/BRL-CAD/brlcad-docs\">https://github.com/BRL-CAD/brlcad-docs</a><br>\nI also wanted to rename the repo from <code>brlcad-docs</code> to <code>docs</code>, but it seems that now I don't have access to the settings of the repo.</p>",
        "id": 244352308,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1625003245
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/244351372\">said</a>:</p>\n<blockquote>\n<p>What were the differences you noticed?</p>\n</blockquote>\n<p>Almost no differences at all (I used <code>diff</code> on the asciidoc files).<br>\nSo, I should keep v5 instead of v6, at least for the time being.<br>\nWhen the development branch is released, we can update the docs accordingly.</p>",
        "id": 244352962,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1625003639
    },
    {
        "content": "<p>Yeah, keep v5</p>",
        "id": 244353673,
        "sender_full_name": "Sean",
        "timestamp": 1625004001
    },
    {
        "content": "<p>I have tried to convert the man pages to AsciiDoc.<br>\nA problem is that while DocBook uses lots of details and information for a man page,  AsciiDoc uses a very constraint formatting, so the conversion will result in loss of details and information. For example an AsciiDoc man page looks like this: <a href=\"https://raw.githubusercontent.com/asciidoctor/asciidoctor/master/man/asciidoctor.adoc\">https://raw.githubusercontent.com/asciidoctor/asciidoctor/master/man/asciidoctor.adoc</a></p>\n<p>It basically uses only bold and underline inline formatting (which actually is the only formatting used on a man page displayed on a terminal). The information about <code>&lt;command&gt;</code>, <code>&lt;prompt&gt;</code>, <code>&lt;option&gt;</code>, <code>&lt;replaceable&gt;</code> etc. is not present. This makes it impossible to generate a nice HTML page from an AsciiDoc manpage document. For example in Antora this man page looks like this: <a href=\"https://brlcad.fs.al/docs/man/1/asciidoctor.html\">https://brlcad.fs.al/docs/man/1/asciidoctor.html</a><br>\nAn HTML man page generated from a DocBook document usually has much more details that can be styled.</p>\n<p>In the man pages that I have converted I have tried to preserve some formatting, so that the HTML page could be a bit nicer. For example the man page of <code>mged</code> looks like this:</p>\n<ul>\n<li><a href=\"https://raw.githubusercontent.com/BRL-CAD/brlcad-docs/main/docs/modules/man/pages/1/mged.adoc\">https://raw.githubusercontent.com/BRL-CAD/brlcad-docs/main/docs/modules/man/pages/1/mged.adoc</a> (needs some manual fixes)</li>\n<li><a href=\"https://brlcad.fs.al/docs/man/1/mged.html\">https://brlcad.fs.al/docs/man/1/mged.html</a></li>\n</ul>\n<p>But this is a bit tricky because some formatting may cause failure to convert to a man page (that can be viewed with the <code>man</code> command). For example the command in SYNOPSIS has to be enclosed in stars (<code> * </code>) otherwise it will fail. This is what the converter assumes and expects.</p>\n<p>This extra formatting also makes the document cluttered and more difficult to edit. So I am not sure it is worth keeping it, just to make the HTML page a little bit nicer.<br>\nWhat do you think?</p>",
        "id": 244512229,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1625106900
    },
    {
        "content": "<p>I have already finished the rest of the docs:</p>\n<ul>\n<li><a href=\"https://brlcad.fs.al/docs/devguides/bool_eval_development.html\">https://brlcad.fs.al/docs/devguides/bool_eval_development.html</a></li>\n<li><a href=\"https://brlcad.fs.al/docs/presentations/brlcad-app-devel.html\">https://brlcad.fs.al/docs/presentations/brlcad-app-devel.html</a></li>\n<li><a href=\"https://brlcad.fs.al/docs/presentations/intro-to-tcltk.html\">https://brlcad.fs.al/docs/presentations/intro-to-tcltk.html</a></li>\n<li><a href=\"https://brlcad.fs.al/docs/specifications/BRL_CAD_g_format_V5.html\">https://brlcad.fs.al/docs/specifications/BRL_CAD_g_format_V5.html</a></li>\n</ul>\n<p>I have also customized a bit the UI templates, but still need some help (for example to find a better logo, etc.):</p>\n<ul>\n<li><a href=\"https://github.com/BRL-CAD/brlcad-docs/issues/28\">https://github.com/BRL-CAD/brlcad-docs/issues/28</a></li>\n</ul>\n<p>I have played as well with converting man pages from DocBook to AsciiDoc (see also the previous message). I tried different ways and the best one seemed to be converting DocBook to man, and then using <code>pandoc</code> to convert man to asciidoc. However this would completely loose any DocBook formatting. So, I tried to customize the docbookrx to convert man pages as well (it currently does not support this):</p>\n<ul>\n<li><a href=\"https://github.com/asciidoctor/docbookrx/pull/70\">https://github.com/asciidoctor/docbookrx/pull/70</a></li>\n</ul>\n<p>It does preserve most of the formatting, but I am still not happy with the result. I am going to look further at it. But in any case, the resulting asciidoc pages would need a lot of manual review and corrections.</p>",
        "id": 244732839,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1625246455
    },
    {
        "content": "<p>This is outstanding progress <span class=\"user-mention\" data-user-id=\"405360\">@Dashamir Hoxha</span>.  I'm going to review this in more detail and should have feedback for you tomorrow.  I'd also like to get you connected with one of our other documenters to test/review and iterate on some feedback as well.</p>",
        "id": 245004492,
        "sender_full_name": "Sean",
        "timestamp": 1625556948
    },
    {
        "content": "<p>I have tried to migrate the wiki pages to GitHub (using <a href=\"https://github.com/outofcontrol/mediawiki-to-gfm\">https://github.com/outofcontrol/mediawiki-to-gfm</a>).<br>\nThe result does not look very impressive: <a href=\"https://github.com/BRL-CAD/brlcad-docs/wiki\">https://github.com/BRL-CAD/brlcad-docs/wiki</a><br>\nGitHub wiki pages can be cloned with <code>git clone https://github.com/BRL-CAD/brlcad-docs.wiki</code>, and then processed locally with advanced tools or editors, so maybe some problems can be fixed automatically.</p>\n<p>This attempt was the first step towards merging wiki pages into the Antora documentation. It seems like not all the wiki pages are about documentation, so not all of them should be merged to Antora. Deciding which ones should to be moved to Antora most probably cannot be done automatically.</p>",
        "id": 245012427,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1625562291
    },
    {
        "content": "<p>So the wiki is tricky.  Half the docs really belong in the repository.  The other \"working documents\" arguably belong in the repo or belong on the wiki because they're works in progress.  We don't have pedigree/criteria spelled out for when a document is \"good enough\" but there are definitely a slew on the wiki that would be best in the repo, if not most of the wiki pages.</p>",
        "id": 245075213,
        "sender_full_name": "Sean",
        "timestamp": 1625594068
    },
    {
        "content": "<p>So yeah, your analysis is spot on.  They're not all docs ;)</p>",
        "id": 245075290,
        "sender_full_name": "Sean",
        "timestamp": 1625594107
    },
    {
        "content": "<p>I am not quite familiar with mediawiki, so I didn't notice it at first, but actually the categories provide a good guidance about what wiki pages belong to the docs, and even how to organize (categorize) them on the Antora site.</p>",
        "id": 245080055,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1625596252
    },
    {
        "content": "<p>Except we've not been terribly consistent with using the category labels except for the developer working docs label, and even that is spotty</p>",
        "id": 245084070,
        "sender_full_name": "Sean",
        "timestamp": 1625598122
    },
    {
        "content": "<p>It's all ad hoc.</p>",
        "id": 245084151,
        "sender_full_name": "Sean",
        "timestamp": 1625598137
    },
    {
        "content": "<p>I finished converting and fixing the man pages: <a href=\"https://brlcad.fs.al/docs/man/1.html\">https://brlcad.fs.al/docs/man/1.html</a><br>\nThe automatic conversion was far from perfect and I had to do a lot of manual correction. There are too many man pages,  so it took me a lot of time. Since I am not familiar with the details of BRL-CAD, some mistakes in the content may have slipped me, so another review (by someone who is familiar) might be useful.</p>\n<p>I also added a <a href=\"https://github.com/BRL-CAD/brlcad-docs/issues/34\">search box</a> for searching the docs.<br>\nAdded also a <a href=\"https://github.com/BRL-CAD/brlcad-docs/blob/main/README.adoc\">README</a> with installation instructions etc.</p>",
        "id": 245966665,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1626272546
    },
    {
        "content": "<p>That is awesome <span class=\"user-mention\" data-user-id=\"405360\">@Dashamir Hoxha</span>  !!  You are rocking this project.  I met with a web dev last week to see if they can help you get the docs instantiated on <a href=\"http://brlcad.org\">brlcad.org</a>, but they weren't sure they'd have time - so looks like it'll fall on me (which is great, but we'll have to schedule some time to sort through things).  In the meantime, I'll take a look at the README and see how it goes!</p>",
        "id": 245998335,
        "sender_full_name": "Sean",
        "timestamp": 1626286417
    },
    {
        "content": "<p>I am happy that you like it, and I am enjoying it too <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> <br>\nBut I am not done yet.</p>\n<p>Please let me know when is a suitable meeting time for you.<br>\nI don't think that it is going to take more than 1 hour.</p>",
        "id": 246045735,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1626316668
    },
    {
        "content": "<p>What do you think about replacing the <a href=\"https://brlcad.org/gallery/\">image gallery</a>  with a static one? This would get rid of the need for MySQL+PHP on the host.<br>\nI have listed some possible solutions <a href=\"https://github.com/BRL-CAD/brlcad-docs/issues/36\">on this issue</a>, but I think that Antora can handle an image gallery quite well too.</p>",
        "id": 246047222,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1626318385
    },
    {
        "content": "<p>I have been playing with GitHub pages: <a href=\"https://github.com/dashohoxha/brlcad-docs/tree/gh-pages\">https://github.com/dashohoxha/brlcad-docs/tree/gh-pages</a><br>\nOne of the advantages of hosting the docs (and the website) on GitHub pages is that it is possible to automate rebuilding and publishing them whenever there are some changes. The playbook looks like this: <a href=\"https://github.com/dashohoxha/brlcad-docs/blob/main/.github/workflows/build-and-deploy-gh-pages.yml\">https://github.com/dashohoxha/brlcad-docs/blob/main/.github/workflows/build-and-deploy-gh-pages.yml</a><br>\nFor the time being it seems to work, but maybe it can be optimized further, I am not sure.</p>\n<p>However GitHub pages require a website that does not depend on MySQL and dynamic PHP.</p>",
        "id": 246310754,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1626506869
    },
    {
        "content": "<blockquote>\n<p>So the wiki is tricky. </p>\n</blockquote>\n<p>I am giving it a try anyway.</p>\n<p>There are lots of pages about MGED commands, which start with \"MGED CMD\" (265 of them). These seem like generated automatically, maybe from man pages (having the footer \"Page Generated by David Loman on: 10/11/2007\").<br>\nIs it worth including them in the Antora site, given that we already have the man pages included?</p>",
        "id": 246478250,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1626712276
    },
    {
        "content": "<p>Hm, probably not, but we'll need to reconcile the list to make sure.  I <em>think</em> the were gereated from the manpages, but then dave augmented them too if I recall.  Still, I think you can safely ignore them.</p>",
        "id": 246548258,
        "sender_full_name": "Sean",
        "timestamp": 1626761238
    },
    {
        "content": "<p>Just for the record, I have started already with the wiki pages:<br>\n<a href=\"https://brl-cad.fs.al/docs/wiki/Documentation.html\">https://brl-cad.fs.al/docs/wiki/Documentation.html</a><br>\nBut there is lots of manual work to be done and it is going slowly.</p>\n<p>My aim is to move to Antora the wiki pages that are related to documentation,<br>\nand the rest of them (about GSoC etc.) will be moved to GitHub wiki:<br>\n<a href=\"https://github.com/BRL-CAD/brlcad-docs/wiki\">https://github.com/BRL-CAD/brlcad-docs/wiki</a></p>\n<p>The final goal is to get rid of MediaWiki, since it depends on MySQL and PHP.</p>",
        "id": 247021462,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1627068560
    },
    {
        "content": "<p>The new image gallery, which is hosted on GitHub pages:</p>\n<ul>\n<li><a href=\"https://github.com/BRL-CAD/gallery\">https://github.com/BRL-CAD/gallery</a></li>\n<li><a href=\"https://brl-cad.github.io/gallery/\">https://brl-cad.github.io/gallery/</a></li>\n</ul>",
        "id": 249880670,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1629306396
    },
    {
        "content": "<p>I saw the github pages site, that's awesome.  Stashing images in a repo is far better than the manual maintenance hell that is the current piwigo site.  Will just need to eventually pull all the newer/better images from the facebook gallery... let me know if you know a way to automate/facilitate that as it's a lot of images.</p>",
        "id": 250131411,
        "sender_full_name": "Sean",
        "timestamp": 1629472589
    },
    {
        "content": "<p>Is there some way to capture the captions as well?  (see, for example, <a href=\"https://brlcad.org/gallery/picture.php?/32/category/3\">https://brlcad.org/gallery/picture.php?/32/category/3</a>)</p>\n<p>Even imgname.txt files in the repo next to the images would be better than losing the info, if we can't display it...</p>",
        "id": 250143212,
        "sender_full_name": "starseeker",
        "timestamp": 1629478237
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/250131411\">said</a>:</p>\n<blockquote>\n<p>Will just need to eventually pull all the newer/better images from the facebook gallery... let me know if you know a way to automate/facilitate that as it's a lot of images.</p>\n</blockquote>\n<p>I know that it should be possible with the Facebook API, but I have never used it before.<br>\nBut it seems that it is also possible to download all the images in bulk:</p>\n<ul>\n<li><a href=\"https://www.howtogeek.com/345963/how-to-download-your-photos-from-facebook/\">https://www.howtogeek.com/345963/how-to-download-your-photos-from-facebook/</a></li>\n<li><a href=\"https://www.alphr.com/download-all-photos-facebook/\">https://www.alphr.com/download-all-photos-facebook/</a></li>\n</ul>\n<p>I am not sure if this download includes the status/description of the photo as well. Also I am afraid that the photos may need to be renamed and categorized manually.</p>\n<p>If nothing else works, downloading them manually should still be possible (for example as a Code-In task or something like this), because there are only about 50 photos published:</p>\n<ul>\n<li><a href=\"https://www.facebook.com/brlcad/photos\">https://www.facebook.com/brlcad/photos</a></li>\n<li><a href=\"https://www.facebook.com/brlcad/videos/\">https://www.facebook.com/brlcad/videos/</a></li>\n</ul>",
        "id": 250148080,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1629480680
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112516\">starseeker</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/250143212\">said</a>:</p>\n<blockquote>\n<p>Is there some way to capture the captions as well?  (see, for example, <a href=\"https://brlcad.org/gallery/picture.php?/32/category/3\">https://brlcad.org/gallery/picture.php?/32/category/3</a>)</p>\n<p>Even imgname.txt files in the repo next to the images would be better than losing the info, if we can't display it...</p>\n</blockquote>\n<p>There are only 105 photos in all the albums, so doing it manually is also an option (as a Code-In task or something).</p>\n<p>I used some bash kung-fu to download the images. Maybe it is possible to scrape the description as well, but I haven't tried it.</p>",
        "id": 250148552,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1629480891
    },
    {
        "content": "<p>It may be better to just upload originals again anyways as facebook downsamples them pretty heavily, now that I think about it.</p>",
        "id": 250155273,
        "sender_full_name": "Sean",
        "timestamp": 1629484118
    },
    {
        "content": "<p>I'm not sure they keep the original uploaded resolution</p>",
        "id": 250155319,
        "sender_full_name": "Sean",
        "timestamp": 1629484137
    },
    {
        "content": "<p>but if you already got them, that's great too!</p>",
        "id": 250155419,
        "sender_full_name": "Sean",
        "timestamp": 1629484187
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/250155419\">said</a>:</p>\n<blockquote>\n<p>but if you already got them, that's great too!</p>\n</blockquote>\n<p>To clarify, I downloaded only the images from the gallery (<a href=\"https://brlcad.org/gallery/\">https://brlcad.org/gallery/</a>), not the photos from FB.<br>\nI downloaded the original versions, not the resized ones.</p>",
        "id": 250168510,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1629491227
    },
    {
        "content": "<p>Ah, okay, I did misunderstand you there.  I did notice the /gallery images were nice full res, and the static gallery generator it's using</p>",
        "id": 250233923,
        "sender_full_name": "Sean",
        "timestamp": 1629575379
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"434465\">Fareha Nousheen</span> <a href=\"#narrow/stream/104062-general/topic/STEP/near/250484361\">said</a>:</p>\n<blockquote>\n<p>Is there any scope I can contribute for the selected GSoD project? Kindly guide me</p>\n</blockquote>\n<p>You can start by installing Antora and building the docs locally:<br>\n<a href=\"https://github.com/BRL-CAD/brlcad-docs\">https://github.com/BRL-CAD/brlcad-docs</a></p>\n<p>Once you do that, have a look at AsciiDoc (if you are not already familiar with it):<br>\n<a href=\"https://docs.antora.org/antora/2.3/asciidoc/section-headings/\">https://docs.antora.org/antora/2.3/asciidoc/section-headings/</a></p>\n<p>Finally have a look at the currently open issues and see if there is any that you can do:<br>\n<a href=\"https://github.com/BRL-CAD/brlcad-docs/issues\">https://github.com/BRL-CAD/brlcad-docs/issues</a><br>\nActually it is my duty to complete them, but I am also happy to collaborate with the community, if possible.</p>",
        "id": 250819946,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1630003429
    },
    {
        "content": "<p>I am done with migrating doc pages from wiki to Antora: <a href=\"https://brl-cad.fs.al/docs/wiki/all-pages.html\">https://brl-cad.fs.al/docs/wiki/all-pages.html</a><br>\nMaybe some of the migrated pages do not belong to the docs (and should be removed), maybe I have missed some pages (they are doc pages but have not been migrated). If you spot such cases please let me know.</p>",
        "id": 250822037,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1630004327
    },
    {
        "content": "<p>I am moving the rest of the wiki pages to a separate GitHub repo, generating the HTML with <code>mkdocs</code> and hosting them on GitHub:</p>\n<ul>\n<li><a href=\"https://github.com/BRL-CAD/wiki\">https://github.com/BRL-CAD/wiki</a></li>\n<li><a href=\"https://brl-cad.github.io/wiki/\">https://brl-cad.github.io/wiki/</a></li>\n</ul>\n<p>I tried initially to host them on the Wiki of a github repo: <a href=\"https://github.com/BRL-CAD/brlcad-docs/wiki\">https://github.com/BRL-CAD/brlcad-docs/wiki</a><br>\nHowever the GitHub wiki (which is based on <a href=\"https://github.com/gollum/gollum/wiki\">Gollum</a>) does not have a good support for organizing pages into directories and subdirectories, so I tried other solutions. I considered <a href=\"http://dynalon.github.io/mdwiki/\">MDWiki</a> and <a href=\"https://docusaurus.io/docs\">Docusaurus</a>, but finally decided to use <a href=\"https://www.mkdocs.org/\">MkDocs</a>.</p>\n<p>Currently the wiki pages still need some reorganization, fixing some broken internal links (which are a bit tricky), etc.<br>\nAlso a few pages are missing because somehow they <a href=\"https://github.com/BRL-CAD/brlcad-docs/issues/41\">failed to be converted from Mediawiki</a>.</p>",
        "id": 250878733,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1630036675
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112516\">starseeker</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/250143212\">said</a>:</p>\n<blockquote>\n<p>Is there some way to capture the captions as well?</p>\n</blockquote>\n<p>It is <a href=\"https://github.com/BRL-CAD/gallery/commit/3902fb265c622c7ab67fa57be1181e9b62585fea\">done</a>.<br>\nI also use <a href=\"https://github.com/BRL-CAD/gallery/blob/main/set-image-description.sh\">this script</a> to add the description to each image.</p>",
        "id": 250963055,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1630084297
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"405360\">Dashamir Hoxha</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/250878733\">said</a>:</p>\n<blockquote>\n<p>I am moving the rest of the wiki pages to a separate GitHub repo, generating the HTML with <code>mkdocs</code> and hosting them on GitHub:</p>\n<ul>\n<li><a href=\"https://github.com/BRL-CAD/wiki\">https://github.com/BRL-CAD/wiki</a></li>\n<li><a href=\"https://brl-cad.github.io/wiki/\">https://brl-cad.github.io/wiki/</a></li>\n</ul>\n</blockquote>\n<p>I am done with the wiki. Unfortunately the automatic conversion was not perfect and most of the pages need some manual corrections, but at least they serve as an archive of the past activity, in case someone is interested.</p>\n<p><span class=\"user-mention\" data-user-id=\"102902\">@Sean</span> what do you think about it?</p>",
        "id": 251448150,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1630439725
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"405360\">@Dashamir Hoxha</span> I've been looking through it.  I think it looks really great overall.  I'm following your installation steps to get antora instanced on <a href=\"http://brlcad.org\">brlcad.org</a> and will let you know if I run into any roadblocks, but it looks like you've made it as simple as possible.  Hopefully the FreeBSD environment doesn't pose any challenges! (usually doesn't, but ... sometimes codes assume Linux)</p>",
        "id": 251582810,
        "sender_full_name": "Sean",
        "timestamp": 1630511559
    },
    {
        "content": "<p>I hope that it should not be too difficult to install Antora on FreeBSD.<br>\nHowever I was planning to move the whole website and documentation infrastructure to GitHub pages.<br>\nThis is usually done by adding a <strong>CNAME</strong> file on the <strong>gh-pages</strong> branch of the repo, and adding some records on the DNS configuration of the site. More details here:</p>\n<ul>\n<li><a href=\"https://docs.github.com/en/pages/configuring-a-custom-domain-for-your-github-pages-site\">https://docs.github.com/en/pages/configuring-a-custom-domain-for-your-github-pages-site</a></li>\n<li><a href=\"https://www.pluralsight.com/guides/using-github-pages-with-custom-domain\">https://www.pluralsight.com/guides/using-github-pages-with-custom-domain</a></li>\n</ul>\n<p>The documentation (Antora) site can be hosted on the GitHub pages:</p>\n<ul>\n<li><a href=\"https://github.com/BRL-CAD/brlcad-docs/pull/39/files\">https://github.com/BRL-CAD/brlcad-docs/pull/39/files</a></li>\n</ul>\n<p>The gallery is already hosted on the GitHub pages (it only needs the configuration of a custom domain):</p>\n<ul>\n<li><a href=\"https://brl-cad.github.io/gallery/\">https://brl-cad.github.io/gallery/</a></li>\n</ul>\n<p>The wiki is already hosted on the GitHub pages (needs only the configuration of a custom domain):</p>\n<ul>\n<li><a href=\"https://brl-cad.github.io/wiki/\">https://brl-cad.github.io/wiki/</a></li>\n</ul>\n<p>The main website (<a href=\"http://brlcad.org\">brlcad.org</a>) has not been transferred yet to GitHub pages, but it should not bee too difficult.<br>\nIs it just a plain HTML website, a static generated site (with Jekyll, Hugo, etc.) or something else?<br>\nIf you give me more details about it I can try to migrate it to GitHub pages.<br>\nIn case it is a plain HTML website, maybe a migration to a statically generated site (Jekyll or Hugo) should be done too.</p>",
        "id": 251594958,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1630516183
    },
    {
        "content": "<blockquote>\n<p>If you give me more details about it I can try to migrate it to GitHub pages.</p>\n</blockquote>\n<p>I realize that the code of the website is here: <a href=\"https://github.com/BRL-CAD/web\">https://github.com/BRL-CAD/web</a><br>\nIt seems that it is a plain HTML website. The <code>wiki/</code> subdir must be about the mediawiki pages. I am not sure what the WordPress (<code>wp/</code> subdir) is used for.<br>\nI have created an issue for updating it:  <a href=\"https://github.com/BRL-CAD/brlcad-docs/issues/43\">https://github.com/BRL-CAD/brlcad-docs/issues/43</a></p>",
        "id": 251621929,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1630527220
    },
    {
        "content": "<p>Hm, I hadn't really considered that.  What are the implications / benefits?   I mean, beside the obvious that it's hosted and maintained by the GH folks, probably nice replication and such going on -- but are there benefits from a deployment/maintenance/integration/editing or some other perspective?</p>",
        "id": 251657927,
        "sender_full_name": "Sean",
        "timestamp": 1630550393
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"405360\">@Dashamir Hoxha</span>  I noticed with the wiki that you used mkdocs instead of antora.   Was there a particular reason they're different?  Just easier to export+import?  Just wanting to try it out?  Easier than antora?  </p>\n<p>What are the implciations for merging them all to one or the other?  My original thinking at least was that we would merge most of the wiki docs (at least the non-working docs) with the new site/repo in asciidoc alongside our other documentation, and either retire/migrate/relegate the wiki to temporal content (like gsoc project logs, working docs, etc).</p>",
        "id": 251658230,
        "sender_full_name": "Sean",
        "timestamp": 1630550668
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/251658230\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"405360\">Dashamir Hoxha</span>  I noticed with the wiki that you used mkdocs instead of antora.   Was there a particular reason they're different?  Just easier to export+import?  Just wanting to try it out?  Easier than antora?  </p>\n<p>What are the implciations for merging them all to one or the other?  My original thinking at least was that we would merge most of the wiki docs (at least the non-working docs) with the new site/repo in asciidoc alongside our other documentation, and either retire/migrate/relegate the wiki to temporal content (like gsoc project logs, working docs, etc).</p>\n</blockquote>\n<p>Actually I did merge the wiki docs to Antora: <a href=\"https://brl-cad.fs.al/docs/wiki/all-pages.html\">https://brl-cad.fs.al/docs/wiki/all-pages.html</a><br>\nAt least the doc pages that I thought were important (please let me know if I have missed some important doc pages).</p>\n<p>Then I converted the rest of the wiki to a MkDocs site, which is quite similar to wiki, but better (in my opinion, since all the docs are saved as plain files and versioned by GitHub).<br>\nActually I included in the MkDocs site the doc pages as well, for convenience, since there are some references to them from the other pages.</p>\n<p>The migration of wiki pages to MkDocs was done in order to retire the MediaWiki site, since it depends on PHP, MySQL, etc. Because MkDocs does not use dynamically generated pages (PHP+MySQL) it is much easier to deploy, and safer. It can also be deployed on GitHub pages.</p>",
        "id": 251677079,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1630568262
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/251657927\">said</a>:</p>\n<blockquote>\n<p>Hm, I hadn't really considered that.  What are the implications / benefits?   I mean, beside the obvious that it's hosted and maintained by the GH folks, probably nice replication and such going on -- but are there benefits from a deployment/maintenance/integration/editing or some other perspective?</p>\n</blockquote>\n<p>If your website is hosted on GitHub pages, you don't need to maintain your own web server (if this counts as a benefit). And it is for free.</p>\n<p>Combined with GitHub Actions, your website can be updated automatically whenever a pull request is approved (or there is a commit on the main branch). This is CI/CD (Continuous Integration and Deployment). But maybe there are ways to do this with your own web server too.</p>\n<p>Using a suitable Jekyll or Hugo template, you have to care only about the content of the site; the styles, layout and other formatting is taken care by the template. This makes the maintenance and update of the web site easier.</p>\n<p>I am not sure if these reason are convincing, but it is up to you to decide. For me it is fine if you continue to host your website on your own webserver.</p>",
        "id": 251678331,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1630569086
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"405360\">Dashamir Hoxha</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/251677079\">said</a>:</p>\n<blockquote>\n<p>Actually I did merge the wiki docs to Antora: <a href=\"https://brl-cad.fs.al/docs/wiki/all-pages.html\">https://brl-cad.fs.al/docs/wiki/all-pages.html</a><br>\nAt least the doc pages that I thought were important (please let me know if I have missed some important doc pages).</p>\n</blockquote>\n<p>Aha!  I didn't realize some were migrated and some not, but that totally makes sense.  Is there a list of what wasn't converted?  It looks like the mkdocs site has just about everything that was on the wiki.  I was actually just really enjoying the categorized views you set up in mkdocs as it makes it really easy to sort through which docs are important that weren't on the main doc listing.</p>\n<blockquote>\n<p>The migration of wiki pages to MkDocs was done in order to retire the MediaWiki site, since it depends on PHP, MySQL, etc. Because MkDocs does not use dynamically generated pages (PHP+MySQL) it is much easier to deploy, and safer. It can also be deployed on GitHub pages.</p>\n</blockquote>\n<p>I guess I'm wondering what, if any benefits it has over Antora, not MediaWiki.  Def want to retire MW if we can.  The only question we'll need to decide is whether/how we want to support anonymous edits and how new pages from new contributors are supported (the one feature MW made super easy).</p>",
        "id": 251711421,
        "sender_full_name": "Sean",
        "timestamp": 1630588005
    },
    {
        "content": "<p>As for the GH hosting, I was originally thinking we'd still do all of that just on our server.  GH action that pushes updates  to the server whenever there's a commit/merge and CI passes (if we have any validation/review criteria, which we don't currently).</p>\n<p>The reason being that we've been bitten hard in the past by notable service providers having outages and the idea of their outage taking our website down is an unpleasant risk and would affect our industry partners.  Of course, there's always the risk our server has an issue too, but then that's on us and we have a pretty good track record in that department.</p>",
        "id": 251712329,
        "sender_full_name": "Sean",
        "timestamp": 1630588374
    },
    {
        "content": "<p>Will have to mull and think that one over a bit.  Not opposed, just wasn't in the original thinking/plan for the doc restructuring.</p>",
        "id": 251712384,
        "sender_full_name": "Sean",
        "timestamp": 1630588406
    },
    {
        "content": "<p>Thanks for your perspective on this.  Definitely helps to hear things from others'.  We get tied up in our bubble sometimes, focused on our industry users more than the bigger picture.</p>",
        "id": 251712526,
        "sender_full_name": "Sean",
        "timestamp": 1630588465
    },
    {
        "content": "<blockquote>\n<p>Is there a list of what wasn't converted? It looks like the mkdocs site has just about everything that was on the wiki.</p>\n</blockquote>\n<p>The wiki pages that start with <code>MGED_CMD_</code> were not converted, for example:</p>\n<ul>\n<li><a href=\"https://brlcad.org/wiki/MGED_CMD_Percent\">https://brlcad.org/wiki/MGED_CMD_Percent</a></li>\n</ul>\n<p>This information is already present on the Antora docs, for example:</p>\n<ul>\n<li><a href=\"https://brl-cad.fs.al/docs/articles/mged/user-commands.html#_percent\">https://brl-cad.fs.al/docs/articles/mged/user-commands.html#_percent</a></li>\n</ul>\n<p>Actually I am working right now to fix their formatting (which is a huge work, because there are too many commands and everything has to be fixed manually):</p>\n<ul>\n<li><a href=\"https://github.com/BRL-CAD/brlcad-docs/projects/1\">https://github.com/BRL-CAD/brlcad-docs/projects/1</a></li>\n<li><a href=\"https://github.com/BRL-CAD/brlcad-docs/issues/19\">https://github.com/BRL-CAD/brlcad-docs/issues/19</a></li>\n<li><a href=\"https://github.com/BRL-CAD/brlcad-docs/commit/4e181abb39b53cbdd8294e0161a644f3378c4225\">last commit</a></li>\n</ul>",
        "id": 251726517,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1630593743
    },
    {
        "content": "<blockquote>\n<p>I guess I'm wondering what, if any benefits it has over Antora, not MediaWiki.</p>\n</blockquote>\n<p>MkDocs uses GFM (GitHub Flavored Markdown), which is closer to MediaWiki markdown compared to AsciiDoc. This means that the conversion is a bit easier.<br>\nGFM is also much easier than AsciiDoc for users to get familiar to, which makes it more suitable for a Wiki site.</p>",
        "id": 251729326,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1630594797
    },
    {
        "content": "<blockquote>\n<p>The only question we'll need to decide is whether/how we want to support anonymous edits and how new pages from new contributors are supported (the one feature MW made super easy).</p>\n</blockquote>\n<p>With GitHub based MkDocs, anybody who has a GitHub account can contribute by submitting a pull request to <a href=\"https://github.com/BRL-CAD/wiki\">https://github.com/BRL-CAD/wiki</a>. Of course it has to be approved by someone before the contributions get published, but I think this is better than anonymous editing. I have noticed spam pages on the current MW site.</p>",
        "id": 251730339,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1630595158
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"405360\">Dashamir Hoxha</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/251726517\">said</a>:</p>\n<blockquote>\n<p>The wiki pages that start with <code>MGED_CMD_</code> were not converted, for example:</p>\n<ul>\n<li><a href=\"https://brlcad.org/wiki/MGED_CMD_Percent\">https://brlcad.org/wiki/MGED_CMD_Percent</a></li>\n</ul>\n<p>This information is already present on the Antora docs, for example:</p>\n<ul>\n<li><a href=\"https://brl-cad.fs.al/docs/articles/mged/user-commands.html#_percent\">https://brl-cad.fs.al/docs/articles/mged/user-commands.html#_percent</a></li>\n</ul>\n<p>Actually I am working right now to fix their formatting (which is a huge work, because there are too many commands and everything has to be fixed manually):</p>\n<ul>\n<li><a href=\"https://github.com/BRL-CAD/brlcad-docs/projects/1\">https://github.com/BRL-CAD/brlcad-docs/projects/1</a></li>\n<li><a href=\"https://github.com/BRL-CAD/brlcad-docs/issues/19\">https://github.com/BRL-CAD/brlcad-docs/issues/19</a></li>\n</ul>\n</blockquote>\n<p>I just finished fixing <code>mged/user-commands.adoc</code>:</p>\n<ul>\n<li><a href=\"https://brl-cad.fs.al/docs/articles/mged/user-commands.html\">https://brl-cad.fs.al/docs/articles/mged/user-commands.html</a></li>\n</ul>\n<p>I still have to fix <code>mged/developer-commands.adoc</code>:</p>\n<ul>\n<li><a href=\"https://brl-cad.fs.al/docs/articles/mged/developer-commands.html\">https://brl-cad.fs.al/docs/articles/mged/developer-commands.html</a></li>\n</ul>\n<hr>\n<p>I notice that the information on these pages is almost identical to these <code>man</code> pages:</p>\n<ul>\n<li><a href=\"https://brl-cad.fs.al/docs/man/n.html\">https://brl-cad.fs.al/docs/man/n.html</a></li>\n</ul>\n<p>I am not sure which one of them is more complete, up to date, etc. But I think that maintaining both of them is a pain. It seems to me that the doc pages (that I just fixed) are more practical for users and easier to maintain. So, I would suggest to drop the corresponding man pages.  <span class=\"user-mention\" data-user-id=\"102902\">@Sean</span> what do you think?</p>",
        "id": 252653382,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1631204297
    },
    {
        "content": "<p>I finished fixing <code>mged/developer-commands.adoc</code>:</p>\n<ul>\n<li><a href=\"https://brl-cad.fs.al/docs/articles/mged/developer-commands.html\">https://brl-cad.fs.al/docs/articles/mged/developer-commands.html</a> </li>\n</ul>\n<p>I realized that the <code>user-commands</code> and <code>developer-commands</code> references in these articles are somehow related to the appendixes of <a href=\"https://brl-cad.fs.al/docs/wiki/_attachments/Industry_Diagram.pdf\">Introduction to MGED (pdf)</a>. I don't know which one is the primary source of information, but I noticed that some user-commands on the PDF file are not listed on article (for example: <code>make_bb</code>, <code>memprint</code>,  <code>polybinout</code>, <code>pov</code>, <code>rmmats</code>, etc.) I'd like to believe that the article is more up to date than the PDF book and these are deprecated commands, but I am not sure. Otherwise, if they are missing by mistake, we should create a task/issue for adding them to the antora docs.</p>",
        "id": 252786165,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1631280361
    },
    {
        "content": "<p>Next, I am going to work on this task: <a href=\"https://github.com/BRL-CAD/brlcad-docs/issues/18\">Update the HACKING book</a></p>\n<p><span class=\"user-mention\" data-user-id=\"102902\">@Sean</span> do you think there is something else I should do, before we call this GSoD project finished?</p>",
        "id": 252786834,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1631280623
    },
    {
        "content": "<p>I have pushed some changes on this Pull Request: <a href=\"https://github.com/BRL-CAD/brlcad-docs/pull/46\">https://github.com/BRL-CAD/brlcad-docs/pull/46</a><br>\nYou can view most of them here:</p>\n<ul>\n<li><a href=\"https://brl-cad.fs.al/docs/hacking/part5/appendix2.html\">https://brl-cad.fs.al/docs/hacking/part5/appendix2.html</a></li>\n<li><a href=\"https://brl-cad.fs.al/docs/hacking/part5/appendix1.html\">https://brl-cad.fs.al/docs/hacking/part5/appendix1.html</a></li>\n<li><a href=\"https://brl-cad.fs.al/docs/hacking/part3/chapter6.html\">https://brl-cad.fs.al/docs/hacking/part3/chapter6.html</a></li>\n<li><a href=\"https://brl-cad.fs.al/docs/hacking/part3/chapter9.html\">https://brl-cad.fs.al/docs/hacking/part3/chapter9.html</a></li>\n</ul>\n<p>Anyone willing to review this pull request?</p>",
        "id": 253067920,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1631529462
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"405360\">Dashamir Hoxha</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/252786834\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> do you think there is something else I should do, before we call this GSoD project finished?</p>\n</blockquote>\n<p>I'd love to have a non-dev go over the docs and your work to review and give feedback from their fresh perspective.  We have a mentor that's agreed to do that, so I'll reach out to them to have them get started on that now.</p>",
        "id": 253693120,
        "sender_full_name": "Sean",
        "timestamp": 1631857152
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/197058-Google-Season.20of.20Docs/topic/GSoD.202021/near/253693120\">said</a>:</p>\n<blockquote>\n<p>I'd love to have a non-dev go over the docs and your work to review and give feedback from their fresh perspective.  We have a mentor that's agreed to do that, so I'll reach out to them to have them get started on that now.</p>\n</blockquote>\n<p>This would be really useful. I guess the reviewer can submit any noticed problems to the <a href=\"https://github.com/BRL-CAD/brlcad-docs/issues\">issues</a>, or (why not) submit any pull requests for fixing them, if it is something that can be fixed easily.</p>",
        "id": 253701305,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1631863334
    },
    {
        "content": "<p>For the time being I would like to shift my focus to other projects, but I am still available to reply to any questions or to help with integrating the docs to the website.</p>",
        "id": 253701573,
        "sender_full_name": "Dashamir Hoxha",
        "timestamp": 1631863476
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"102902\">@Sean</span> Can I do that? If you are still looking?</p>",
        "id": 257916984,
        "sender_full_name": "Sahibpreet Kaur",
        "timestamp": 1634475554
    }
]