[
    {
        "content": "<p>Hi everyone,<br>\nI am interested in the project \"Documentation that specifically caters to new users\" for GSoD. I am working on the proposal as well. I have been writing my proposal based on points like these: <br>\n- How will this documentation help new users who are not only new to BRL-CAD but might also be new to open-source.<br>\n-  How this documentation must be structured so that new users know where they are headed and what they are doing.<br>\n- How to make the new users feel at ease and not get overwhelmed by the big words.<br>\n- Make sure that documentation showcases the real power of BRL-CAD and what various things users can do using it.</p>\n<p>Is there anything else that must be included beside these points?</p>",
        "id": 169127948,
        "sender_full_name": "Sahibpreet Kaur",
        "timestamp": 1561637162
    },
    {
        "content": "<p>hello <span class=\"user-mention\" data-user-id=\"220380\">@Sahibpreet Kaur</span> It's technically your proposal, so it only must include the points you feel it must include.  The points you listed sound good on the surface.  I would also be interested in the process -- how do you go about writing documentation that fulfills those points, can you prove in some way that they do (beyond saying \"it does\"), how do you measure quality, etc.</p>",
        "id": 169132526,
        "sender_full_name": "Sean",
        "timestamp": 1561640758
    },
    {
        "content": "<blockquote>\n<p>hello <span class=\"user-mention silent\" data-user-id=\"220380\">Sahibpreet Kaur</span> It's technically your proposal, so it only must include the points you feel it must include.  The points you listed sound good on the surface.  I would also be interested in the process -- how do you go about writing documentation that fulfills those points, can you prove in some way that they do (beyond saying \"it does\"), how do you measure quality, etc.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"102902\">@Sean</span> Thanks for the reply. It surely gave me a head start. I will make sure to explain what exactly am I going to do in order to fulfill those points. <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 169156509,
        "sender_full_name": "Sahibpreet Kaur",
        "timestamp": 1561657209
    }
]