[
    {
        "content": "<p>Hi, I'm Rishabh and willing to contribute to BRL-CAD for this year's GSoC. I hope I'm not too late. I've prior experience with parallel programming and would like to work on improving the performance. I've compiled the code successfully on my laptop. I wanted to know if it's mandatory to submit a PR before proposal deadline? The OpenCL GPGPU Raytracing project looks comparatively doable but I'm more interested in implementing the coherent raytracing. Any leads on that would be appreciable. Thanks.</p>",
        "id": 191591950,
        "sender_full_name": "Rishabh Suthar",
        "timestamp": 1585046535
    },
    {
        "content": "<p>welcome <span class=\"user-mention\" data-user-id=\"276372\">@Rishabh Suthar</span>.  definitely not too late.  If you want to work on performance, I would say that yes a PR (actually a patch file) is required because that's one of the more advanced tasks that requires strong code reading ability</p>",
        "id": 191666263,
        "sender_full_name": "Sean",
        "timestamp": 1585081050
    },
    {
        "content": "<p>That is very much one of the more advanced topics in our list of ideas.  Do you have prior background with cache coherency or ray tracing or code optimization you can talk about or show?</p>",
        "id": 191666630,
        "sender_full_name": "Sean",
        "timestamp": 1585081237
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276372\">@Rishabh Suthar</span> : what does your past experience look like? cache coherency improvements would be awesome, but implementation and testing requires significant deep knowledge in several subjects... the opencl raytracer is the same, with a different set of deep subjects.</p>",
        "id": 191732878,
        "sender_full_name": "Erik",
        "timestamp": 1585136693
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276372\">@Rishabh Suthar</span> hello?</p>",
        "id": 191885558,
        "sender_full_name": "Sean",
        "timestamp": 1585230122
    },
    {
        "content": "<p>Hi, sorry, I'm new to Zulip, didn't check it regularly. Will do from now on. I was working on delivering the patch file for now.</p>",
        "id": 191940894,
        "sender_full_name": "Rishabh Suthar",
        "timestamp": 1585252866
    },
    {
        "content": "<p>Unfortunately, I don't have much knowledge in the domains you mentioned. Are there any good resources that I can learn from for this? Maybe I can start off with opencl raytracer and work it up with small developments in coherent raytracing? What do you suggest?</p>",
        "id": 191942314,
        "sender_full_name": "Rishabh Suthar",
        "timestamp": 1585253524
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276372\">@Rishabh Suthar</span> There are loads of resources, but you'll unlikely be able to prepare adequately to propose an opencl / gpgpu project.  There's simply too much to learn in the time given.  Even if you already had extensive experience, we have to be very careful to not let too much be proposed because BRL-CAD's ray tracing code is sufficiently complex in itself.</p>",
        "id": 191951116,
        "sender_full_name": "Sean",
        "timestamp": 1585257848
    },
    {
        "content": "<p>So back to Erik's question, what is your experience?  You should leverage your strengths and propose something related.</p>",
        "id": 191951168,
        "sender_full_name": "Sean",
        "timestamp": 1585257885
    },
    {
        "content": "<p>Oh. I'm well versed with GPGPU programming. I did my last internship at a research lab in ETS, Canada on parallelization of solvers in CUDA/OpenCL. My other technical expertise are in C, Matlab, AutoCAD and Python.</p>",
        "id": 191978617,
        "sender_full_name": "Rishabh Suthar",
        "timestamp": 1585287827
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"276372\">@Rishabh Suthar</span> can you share any examples of your opencl experience?  Or even better, successfully compile BRL-CAD with OpenCL enabled and make a useful patch?</p>",
        "id": 192751826,
        "sender_full_name": "Sean",
        "timestamp": 1585881052
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"102902\">@Sean</span> , yes I've done that already. Successfully compiled with opencl enabled and send a patch for CLINE primitive. I've shared the link in the proposal as well. Please share your reviews on the same.</p>",
        "id": 192914529,
        "sender_full_name": "Rishabh Suthar",
        "timestamp": 1586016230
    }
]