[
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"252475\">@Himanshu Sekhar Nayak</span>  sir,</p>\n<p>I hope this message finds you well! My name is Adnaan, and I'm currently studying Computer Science and Engineering at VNR Vignana Jyothi Institute of Engineering and Technology in Hyderabad.</p>\n<p>I'm reaching out to express my genuine interest in your project. Having delved into various technologies, my tech stack includes HTML, CSS, JavaScript, React, and Node.js. Your project seems like an exciting opportunity for me to apply my skills and learn more in the process.</p>\n<p>I'm keen to start contributing to your project and making a meaningful impact. Could you please guide me on how I can get started and become a valuable member of your team?</p>\n<p>Additionally, I'm also interested in participating in the Google Summer of Code (GSoC) program. Could you provide any insights or advice on how to prepare for and potentially participate in GSoC?</p>\n<p>Looking forward to your response!</p>\n<p>Best regards,<br>\nAdnaan</p>",
        "id": 426717451,
        "sender_full_name": "Mohammad Adnaan",
        "timestamp": 1710499760
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"701327\">Mohammad Adnaan</span> <a href=\"#narrow/stream/104063-new-members/topic/Want.20to.20contribute.20to.20this.20project.20also.20interested.20in.20.20gsoc/near/426717451\">said</a>:</p>\n<blockquote>\n<p>Hello <span class=\"user-mention silent\" data-user-id=\"252475\">Himanshu Sekhar Nayak</span>  sir,</p>\n<p>I hope this message finds you well! My name is Adnaan, and I'm currently studying Computer Science and Engineering at VNR Vignana Jyothi Institute of Engineering and Technology in Hyderabad.</p>\n<p>I'm reaching out to express my genuine interest in your project. Having delved into various technologies, my tech stack includes HTML, CSS, JavaScript, React, and Node.js. Your project seems like an exciting opportunity for me to apply my skills and learn more in the process.</p>\n<p>I'm keen to start contributing to your project and making a meaningful impact. Could you please guide me on how I can get started and become a valuable member of your team?</p>\n<p>Additionally, I'm also interested in participating in the Google Summer of Code (GSoC) program. Could you provide any insights or advice on how to prepare for and potentially participate in GSoC?</p>\n<p>Looking forward to your response!</p>\n<p>Best regards,<br>\nAdnaan</p>\n</blockquote>\n<p>Hi <span class=\"user-mention\" data-user-id=\"701327\">@Mohammad Adnaan</span>, welcome to our BRL-CAD community. I see you have some decent skills in web. How about  <a href=\"https://github.com/opencax/GSoC/issues/26\">https://github.com/opencax/GSoC/issues/26</a> ?</p>",
        "id": 426740481,
        "sender_full_name": "Himanshu",
        "timestamp": 1710508223
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"252475\">@Himanshu</span>  Sir <br>\nI’m Divy Singhvi, an engineering student at the College of Technology and Engineering, Udaipur. I’m genuinely interested in the BRL-CAD modeling system and would love to contribute to the project. I’m also a GSoC 2025 enthusiast and have experience in HTML, CSS, JavaScript, Django, Node.js, LLMs, and C++. I’m eager to learn whatever is necessary to contribute effectively. Looking forward to your response</p>",
        "id": 472523330,
        "sender_full_name": "Divy singhvi",
        "timestamp": 1727192702
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"759930\">@Divy singhvi</span>, did you installed BRL-CAD? You can find the necessary installation packages at <a href=\"https://github.com/BRL-CAD/brlcad/releases\">https://github.com/BRL-CAD/brlcad/releases</a>. This will install over 200 programs. Most of them are small command line tools. The most interesting for you are our old but still heavily used GUI mged and the more modern GUI archer. Go through the mged tutorial <a href=\"https://brlcad.org/w/images/c/cf/Introduction_to_MGED.pdf\">https://brlcad.org/w/images/c/cf/Introduction_to_MGED.pdf</a>.</p>\n<p>Gain an overview of the existing documentation at <a href=\"https://brlcad.org/wiki/Main_Page\">https://brlcad.org/wiki/Main_Page</a>.</p>\n<p>To start programming, download the source code from <a href=\"https://github.com/BRL-CAD/brlcad\">https://github.com/BRL-CAD/brlcad</a>, compile, and install the programs (<a href=\"https://brlcad.org/wiki/Compiling\">https://brlcad.org/wiki/Compiling</a>).</p>",
        "id": 472545243,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1727200192
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"102939\">@Daniel Rossberg</span> i have installed BRL-CAD on my system and started going through the mged tutorials, but i am more interested on the programming aspect, downloaded the source code and both of the <a href=\"https://brlcad.org/wiki/\">https://brlcad.org/wiki/</a> links are not working?</p>",
        "id": 472681695,
        "sender_full_name": "Divy singhvi",
        "timestamp": 1727266323
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"759930\">Divy singhvi</span> <a href=\"#narrow/stream/104063-new-members/topic/Want.20to.20contribute.20to.20this.20project.20also.20interested.20in.20.20gsoc/near/472681695\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"102939\">Daniel Rossberg</span> i have installed BRL-CAD on my system and started going through the mged tutorials, but i am more interested on the programming aspect, downloaded the source code and both of the <a href=\"https://brlcad.org/wiki/\">https://brlcad.org/wiki/</a> links are not working?</p>\n</blockquote>\n<p>Hey <span class=\"user-mention\" data-user-id=\"759930\">@Divy singhvi</span>, we're currently migrating to a new server so it will take some time for the wiki to be up. Welcome to our organization. If you're going to build brlcad in windows then just download the repo from github and install cmake, visual studio. Open cmake and provide src path and build path. Hit configure button 2 times then hit generate button. Then open the project. After opening, you can build it by opening cmake predefined targets and you will see <code>ALL_BUILD</code>. Then start building it.</p>",
        "id": 472721401,
        "sender_full_name": "Himanshu",
        "timestamp": 1727277397
    },
    {
        "content": "<p>Meanwhile, at least the PDFs con be downloaded from here: <a href=\"https://brlcad.org/docs/\">https://brlcad.org/docs/</a><br>\nE.g. <a href=\"https://brlcad.org/docs/VolumeII-Introduction_to_MGED.pdf\">VolumeII-Introduction_to_MGED.pdf</a></p>",
        "id": 472741138,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1727283948
    },
    {
        "content": "<p>hola</p>",
        "id": 482038627,
        "sender_full_name": "Hector Serrano",
        "timestamp": 1731445460
    },
    {
        "content": "<p>Hey Guys! I’m  David Uzor, a second-year Computer Science student at the University of Georgia, passionate about 3D graphics, computer-aided technologies (CAx), and AI-driven tools<strong>. My tech stack includes </strong>Python, C/C++, Java, Blender (3D modelling, ray tracing), OpenGL, and web development tools like Svelte and Spring Boot**. I’ve been exploring Blender since January 2024, diving into UV editing, texture mapping, and Python scripting. I’m excited about BRL-CAD’s work in solid geometry, ray tracing, and high-performance computing. While I know applications open in two days and I should’ve reached out earlier, I’d love to contribute to your projects and learn more about where to start!</p>",
        "id": 507466944,
        "sender_full_name": "david uzor",
        "timestamp": 1742661163
    },
    {
        "content": "<p>I'd really appreciate any help  regarding how to get started making a patch!</p>",
        "id": 507467010,
        "sender_full_name": "david uzor",
        "timestamp": 1742661235
    },
    {
        "content": "<p>hola <span class=\"user-mention\" data-user-id=\"779545\">@Hector Serrano</span> que haces?  estas aquí para GSoC?</p>\n<p><span class=\"user-mention\" data-user-id=\"891530\">@david uzor</span> welcome and thanks for the intro!  outstanding background that sounds very relevant to our community, so glad to have you here.  If you have experience with UVs and texture mapping, one particular potential project of interest would be to propose finishing the implementation of texture mapping support for BoTs in BRL-CAD.  There's not a write-up on our ideas page, but happy to talk with you about it more if that's a potential area of interest that you're experienced with.</p>",
        "id": 507473849,
        "sender_full_name": "Sean",
        "timestamp": 1742666111
    },
    {
        "content": "<p>There's also of course a bunch of other great topics on the ideas list like continuation of the appleseed Physically Based Rendering infrastructure also that would be great to have someone propose.</p>",
        "id": 507473963,
        "sender_full_name": "Sean",
        "timestamp": 1742666166
    },
    {
        "content": "<p>(assuming they have the skills for the project, and willingness to learn/to do the work needed!)</p>",
        "id": 507474002,
        "sender_full_name": "Sean",
        "timestamp": 1742666191
    },
    {
        "content": "<p>Hello everyone!<br>\nI hope you're all doing well. I'm Shahaban, a final-year Computer Science undergraduate specializing in Machine Learning (particularly Computer Vision) with a minor in UI/UX. I also have experience in web development and competitive programming.</p>\n<p>I discovered BRL-CAD while exploring GSoC projects and became interested in it's working especially in <strong>CSG</strong>. I've already spent time working through MGED and the official lessons (<a href=\"https://brlcad.org/docs/cad/toc.html\">https://brlcad.org/docs/cad/toc.html</a>), creating various 3D objects ,  (I also saw potential for improving the GUI, making it more intuitive and user-friendly, like blender?maybe..)</p>\n<p>I'd love to actively contribute to BRL-CAD, both as part of the community and through GSoC (if possible). I've looked into some of the projects listed in the(<a href=\"https://github.com/opencax/GSOC\">https://github.com/opencax/GSOC</a>), but I'd truly appreciate your guidance on where I can best contribute.</p>\n<p>while I too know I should've reached out earlier, I'll continue exploring and aim to contribute wherever possible. I'm eager to learn from everyone here and look forward to making meaningful contributions. Thankyou.</p>",
        "id": 507603365,
        "sender_full_name": "Shaban Mallick",
        "timestamp": 1742762321
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"891760\">@Shaban Mallick</span> awesome setup on your part, and good job finding the tutorials.  Lots of room for UI/UX improvements indeed.  We've been working on that for years, and have several UI/UX projects in the works that you can help with or otherwise propose.</p>",
        "id": 507605450,
        "sender_full_name": "Sean",
        "timestamp": 1742763649
    },
    {
        "content": "<p>For the short term, for applying to GSoC, you're not too late by any stretch -- the biggest determining factor is communication, demonstrating your passion and coding ability by working on a patch (a PR), some small change, and discussing with others while you work on it.</p>",
        "id": 507605686,
        "sender_full_name": "Sean",
        "timestamp": 1742763812
    },
    {
        "content": "<p>Understood!, I shall do it. Thankyou</p>",
        "id": 507606558,
        "sender_full_name": "Shaban Mallick",
        "timestamp": 1742764382
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"891760\">@Shaban Mallick</span>  Some of the current UI/UX projects on our ideas list include OGV (web-based UI), a V&amp;V GUI (in Qt), New BRL-CAD GUI (in Qt), appleseed PBR/GUI integration (continuation of prior effort), and Intel OSPRay GUI integration (continuation of prior effort).</p>",
        "id": 507642879,
        "sender_full_name": "Sean",
        "timestamp": 1742788975
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 507788245,
        "sender_full_name": "Himanshu",
        "timestamp": 1742827684
    },
    {
        "content": "<p>Hello everyone,<br>\nI'm Almoiz Khan, a 3rd-year Computer Science undergraduate. I primarily work with the MERN stack and have previously contributed to Meshery, OpenTelemetry, and other Layer 5 projects, mainly focusing on UI development and enhancements.<br>\nHere’s my portfolio: <a href=\"https://almoizkhan.me/\">https://almoizkhan.me</a><br>\nI code in C++ and Python, and as a newbie here, I’m looking to start with UI improvements or beginner-friendly contributions. I'd love to have your guidance as I explore and get involved!</p>",
        "id": 507986385,
        "sender_full_name": "Almoiz Khan",
        "timestamp": 1742899325
    },
    {
        "content": "<p>welcome <span class=\"user-mention\" data-user-id=\"875616\">@Almoiz Khan</span> -- that's a diverse set of projects you've worked with.  None caught your attention long enough to contribute long term?  What are you looking to get out of GSoC?</p>",
        "id": 508891154,
        "sender_full_name": "Sean",
        "timestamp": 1743228743
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"102902\">@Sean</span>! Since open source allows to choose freely and contribute, I like to  to explore various projects and tech stacks. Aside from my main stack, My main motive of participation in GSOC is to commit long-term and grow with the project, regardless of the tech involved.</p>\n<p>As for Optimizations I have experience in optimizing UI .</p>",
        "id": 508898861,
        "sender_full_name": "Almoiz Khan",
        "timestamp": 1743234740
    },
    {
        "content": "<p>Hi sir, I m Bhuwan. I m new to this can you guide me what do i need to do in BRL-CAD contribution for a good impact?</p>",
        "id": 562466009,
        "sender_full_name": "Bhuwan Sharma",
        "timestamp": 1765200411
    }
]