[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"102939\">@Daniel Rossberg</span> There's been a team of students working on a V&amp;V interface for geometry that is built on top of Arbalest.  From a user's perspective, they've added a \"compile\" button next to the rendering button that presents the user with a suite of tests that can be run (e.g., are there overlaps; is there a title set; are there any region ID, los, aircode mismatches; are there regions within regions; etc).  Results display in a table view similar to how warnings are displayed in MSVC.</p>",
        "id": 307885023,
        "sender_full_name": "Sean",
        "timestamp": 1667538405
    },
    {
        "content": "<p>What are your thoughts on either keeping it separate or integrating it back?</p>",
        "id": 307885039,
        "sender_full_name": "Sean",
        "timestamp": 1667538424
    },
    {
        "content": "<p>I'd like to integrate it back so it continues to benefit from the improvements you and <span class=\"user-mention\" data-user-id=\"252475\">@Himanshu Sekhar Nayak</span> have been making, and would likely be a tool that will continue to receive attention as this is intended to become a new production capability that can audit, report on, help visualize, and (later) potentially fix geometry issues.</p>",
        "id": 307885373,
        "sender_full_name": "Sean",
        "timestamp": 1667538627
    },
    {
        "content": "<p>I like the idea of integrating it back. What is this V&amp;V compilation based on? Before, you said libged. This would however have the touch of a bad hack (based on what was available to them). Not a show stopper, but doing it right would need some additional work.</p>\n<p>In addition, a plugin like architecture for including such extensions in arbalest would be desirable. Hacking is easy, but hard to maintain.</p>",
        "id": 307908623,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1667552373
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"102939\">@Daniel Rossberg</span> Yes, it's still based on calls into libged, specifically just ged_exec(), calling commands for which there is no other API or mechanism available to do the testing it's doing (e.g., running \"lc -m\" to detect mismatches or sifting through gqa output to see if objects are unhittable or testing conversion via facetize, etc).  The calls are encapsulated through a single call site -- essentially calls ged_exec() and parses what a given test needs out of the results, which varies from command to command and is expected to change (and get expanded to other tests+parsings).</p>",
        "id": 309243392,
        "sender_full_name": "Sean",
        "timestamp": 1668191672
    },
    {
        "content": "<p>Here's a few screenshots of the current progress:  <br>\n<a href=\"/user_uploads/1549/3dP2V-ifSEHt21pQ1b95nldk/Screen-Shot-2022-11-10-at-8.37.05-PM.png\">Screen-Shot-2022-11-10-at-8.37.05-PM.png</a> <a href=\"/user_uploads/1549/oz_qr4iuhNIGjpPwFslMqrII/Screen-Shot-2022-11-10-at-8.39.54-PM.png\">Screen-Shot-2022-11-10-at-8.39.54-PM.png</a> <a href=\"/user_uploads/1549/6LRkYOGhtoPhpiC7EloNs-fu/Screen-Shot-2022-11-10-at-8.41.00-PM.png\">Screen-Shot-2022-11-10-at-8.41.00-PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/1549/3dP2V-ifSEHt21pQ1b95nldk/Screen-Shot-2022-11-10-at-8.37.05-PM.png\" title=\"Screen-Shot-2022-11-10-at-8.37.05-PM.png\"><img src=\"/user_uploads/1549/3dP2V-ifSEHt21pQ1b95nldk/Screen-Shot-2022-11-10-at-8.37.05-PM.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/1549/oz_qr4iuhNIGjpPwFslMqrII/Screen-Shot-2022-11-10-at-8.39.54-PM.png\" title=\"Screen-Shot-2022-11-10-at-8.39.54-PM.png\"><img src=\"/user_uploads/1549/oz_qr4iuhNIGjpPwFslMqrII/Screen-Shot-2022-11-10-at-8.39.54-PM.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/1549/6LRkYOGhtoPhpiC7EloNs-fu/Screen-Shot-2022-11-10-at-8.41.00-PM.png\" title=\"Screen-Shot-2022-11-10-at-8.41.00-PM.png\"><img src=\"/user_uploads/1549/6LRkYOGhtoPhpiC7EloNs-fu/Screen-Shot-2022-11-10-at-8.41.00-PM.png\"></a></div>",
        "id": 309243563,
        "sender_full_name": "Sean",
        "timestamp": 1668191758
    },
    {
        "content": "<p>There's a new button next to the render button that kicks off the test.  The menu option still needs to go away / get hidden under a settings section.</p>",
        "id": 309243744,
        "sender_full_name": "Sean",
        "timestamp": 1668191831
    },
    {
        "content": "<p>I have a binary build ready for testing if you or anyone else wants to try it out.  They would love to have feedback (scope is fixed, but they have a couple weeks remaining to make changes).</p>",
        "id": 309243973,
        "sender_full_name": "Sean",
        "timestamp": 1668191924
    },
    {
        "content": "<p>It can also be compiled from their fork of the arbalest repo.</p>",
        "id": 309244005,
        "sender_full_name": "Sean",
        "timestamp": 1668191939
    },
    {
        "content": "<p>It would be interesting to see how it was done, even if the code is not suited to be integrated back. Himanshu wants to port arbalest to MOOSE after his GSoC project. This would make <code>CommandString</code> available there.</p>",
        "id": 309922918,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1668450313
    },
    {
        "content": "<p>I would actually hope it's suitable to be integrated back or get a list of issues preventing integration.  I have a binary for Windows that can be tested and the code is at <a href=\"http://github.com/isaacy13/arbalest\">http://github.com/isaacy13/arbalest</a></p>",
        "id": 310132741,
        "sender_full_name": "Sean",
        "timestamp": 1668492092
    },
    {
        "content": "<p>A binary is available at <a href=\"https://brlcad.org/~sean/tmp/GeometryV&amp;V.zip\">https://brlcad.org/~sean/tmp/GeometryV&amp;V.zip</a>   (570MB)</p>",
        "id": 310133359,
        "sender_full_name": "Sean",
        "timestamp": 1668492574
    },
    {
        "content": "<p>On a related note -- any idea why the OpenGL context wouldn't be working once deployed/copied to another system?  I tried QT_OPENGL=desktop, angle, and software to no avail.  Tried setting QT_OPENGL_DLL too.  It raytraces to a window (and displays that image just fine), so it's something specific to the context I presume.</p>",
        "id": 310133832,
        "sender_full_name": "Sean",
        "timestamp": 1668492937
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/104062-general/topic/Arbalest.20V.26V/near/310132741\">said</a>:</p>\n<blockquote>\n<p>I would actually hope it's suitable to be integrated back or get a list of issues preventing integration.  I have a binary for Windows that can be tested and the code is at <a href=\"http://github.com/isaacy13/arbalest\">http://github.com/isaacy13/arbalest</a></p>\n</blockquote>\n<p>I'll have a look at it.</p>",
        "id": 310266312,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1668538079
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/104062-general/topic/Arbalest.20V.26V/near/310133832\">said</a>:</p>\n<blockquote>\n<p>On a related note -- any idea why the OpenGL context wouldn't be working once deployed/copied to another system?  I tried QT_OPENGL=desktop, angle, and software to no avail.  Tried setting QT_OPENGL_DLL too.  It raytraces to a window (and displays that image just fine), so it's something specific to the context I presume.</p>\n</blockquote>\n<p>Do you have dynamical run-time-library linkage? The are probably more DLLs needed than just the C-runtime. You could try to install the Visual C++ Redistributable at the target systems. Or is a Qt-plugin needed? Have you checked it wit a dependency walker?</p>\n<p>I prefer however the static linkage of the Visual Studio and Qt libraries. I had no issues with OpenGL with it so far.</p>",
        "id": 310268000,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1668538610
    },
    {
        "content": "<p>Unless something was missed, the zip includes the c++ redistributable dll's -- and since it's a debug mode compile, it throws up a dialog for dll's that are missing.  They're using arbalest's existing build files and just added their new files, so whatever linkage it was doing is what it should still be doing.  I think the only library added in addition to Qt was sqlite, which is used as a results storage mechanism. </p>\n<p>I'm not familiar with any dependency walkers on Windows.  What's the equivalent of ldd or otool ?</p>",
        "id": 310518012,
        "sender_full_name": "Sean",
        "timestamp": 1668640113
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102939\">Daniel Rossberg</span> <a href=\"#narrow/stream/104062-general/topic/Arbalest.20V.26V/near/310266312\">said</a>:</p>\n<blockquote>\n<p>I'll have a look at it.</p>\n</blockquote>\n<p>If you can provide feedback before Tuesday, that would be awesome.  App or source code feedback.  They'd really appreciate it.</p>",
        "id": 310518251,
        "sender_full_name": "Sean",
        "timestamp": 1668640220
    },
    {
        "content": "<blockquote>\n<p>If you can provide feedback before Tuesday, that would be awesome.  App or source code feedback.  They'd really appreciate it.</p>\n</blockquote>\n<p>I'm away these days, but I'll see what I can do. Maybe next weekend.</p>",
        "id": 310678939,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1668711917
    },
    {
        "content": "<p><a href=\"https://en.wikipedia.org/wiki/Dependency_Walker\">Dependency Walker</a> is like ldd.</p>",
        "id": 311140109,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1668950987
    },
    {
        "content": "<p>There are at least two showstoppers for a direct integration back:</p>\n<ul>\n<li>It requires a BRL-CAD standard installation. Beside the simplification, the C++ API aims to create a set of libraries and applications which could be integrated in a usual Linux distribution.</li>\n<li>Even worse, it doesn't work on the Arbalest document. It requires to save it first.</li>\n</ul>\n<p>I think that it would make more sense to integrate these V&amp;V routines in qged. As far as I understood, this is a (kind of a) port of Arbalest to BRL-CAD's basic C API. There, the standard BRL-CAD installation will always be around and you have access to the internal database handles, e.g. rt_wdb. In the original Arbalest the routines feel out of place.</p>",
        "id": 311157430,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1668960481
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"102939\">@Daniel Rossberg</span> I certainly understand the first bullet, though I think the scope could probably be limited to libged and the libged plugins that it calls into.  I think there are some libbu directory management routines (e.g., where's the system cache) it's calling that could potentially be integrated under the C++ api.</p>",
        "id": 311468237,
        "sender_full_name": "Sean",
        "timestamp": 1669062123
    },
    {
        "content": "<p>At least originally, my thinking was that the V&amp;V modifications would be plugin extension(s), using arbalest as an app platform so it can leverage from the GUI infrastructure, display/selection features, and the Qt facilities.</p>",
        "id": 311468353,
        "sender_full_name": "Sean",
        "timestamp": 1669062182
    },
    {
        "content": "<p>I'm not sure I understand the second bullet about not working on the Arbalest document though -- can you elaborate?  The V&amp;V checks are performed read-only.  The only thing written out should be a corresponding sqlite database that is stored in the cache folder (so when you return to that .g later, it can keep track of any changes made).</p>",
        "id": 311468591,
        "sender_full_name": "Sean",
        "timestamp": 1669062274
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102939\">Daniel Rossberg</span> <a href=\"#narrow/stream/104062-general/topic/Arbalest.20V.26V/near/311157430\">said</a>:</p>\n<blockquote>\n<p>I think that it would make more sense to integrate these V&amp;V routines in qged. As far as I understood, this is a (kind of a) port of Arbalest to BRL-CAD's basic C API. There, the standard BRL-CAD installation will always be around and you have access to the internal database handles, e.g. rt_wdb. In the original Arbalest the routines feel out of place.</p>\n</blockquote>\n<p>Personally, I'm not happy with there being two Qt efforts as they're highly duplicitous.  I really don't think it's helpful to split up development capacity like that..  I'd like to move towards the architecture plan I'd shared a while back where there's a new (Qt) GUI built on top of the C++ API but is also able to access ged commands.  Basically, the merge of qged+arbalest.  qged has a fantastic CLI and 3D display, but not as good on the overall appearance, usability, and cleanliness of the document management and underlying architecture encapsulation.  We have talked a bit about what it'd take to merge them, leverage the best of both.  I think there's real potential there.</p>",
        "id": 311469705,
        "sender_full_name": "Sean",
        "timestamp": 1669062783
    },
    {
        "content": "<p>If I'm alone in that, c'est la vie I suppose... but I feel compelled to try!   I really do think we finally have all the underlying pieces needed to replace mged in a big way, and they're currently spread across arbalest, rt^3/coreInterface, qged, libged, librt, and ospray.</p>",
        "id": 311470449,
        "sender_full_name": "Sean",
        "timestamp": 1669063055
    },
    {
        "content": "<p>A naive question about Arbalest's intent longer term - is it intended to eventually replace MGED?</p>",
        "id": 311470644,
        "sender_full_name": "starseeker",
        "timestamp": 1669063119
    },
    {
        "content": "<p>The talk about \"Documents\" sounded rather awkward for things like command line scripted processing, but that may just be my own limited understanding.</p>",
        "id": 311470821,
        "sender_full_name": "starseeker",
        "timestamp": 1669063197
    },
    {
        "content": "<p>In this context, document refers to the MDI model that arbalest is leveraging in Qt.  It's a standard app model for discretely managing separately open contexts.</p>",
        "id": 311471258,
        "sender_full_name": "Sean",
        "timestamp": 1669063362
    },
    {
        "content": "<p>Basically \"document\" is an open .g file.  Has nothing to do with the type of the file and doesn't imply documentation or a text file and such.</p>",
        "id": 311471650,
        "sender_full_name": "Sean",
        "timestamp": 1669063465
    },
    {
        "content": "<p>When we have more time I guess we should do an in-depth discussion about the details of the various interfaces' design features of qged and Arbalest.</p>",
        "id": 311472260,
        "sender_full_name": "starseeker",
        "timestamp": 1669063609
    },
    {
        "content": "<p>The two biggest differences, in my view, is that arbalest has clean classes (clean code) and encapsulation.  There's no data being accessed without going through an object that is responsible for or represents that data.  That is, clean object-oriented definitions.</p>\n<p>That makes it super easy to follow from a CS perspective.  No side effects, no gotchas.  It's almost text-book.</p>",
        "id": 311473414,
        "sender_full_name": "Sean",
        "timestamp": 1669064109
    },
    {
        "content": "<p>I've put a fair bit of effort into developing a Qt-style model for the .g file state - has Arbalest done that?</p>",
        "id": 311473566,
        "sender_full_name": "starseeker",
        "timestamp": 1669064174
    },
    {
        "content": "<p>qged is much more procedural in design.  There are classes by necessity where interfacing with Qt, but data is not encapsulated as much, and definitely not in a classical OO paradigm.</p>",
        "id": 311473755,
        "sender_full_name": "Sean",
        "timestamp": 1669064265
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112516\">starseeker</span> <a href=\"#narrow/stream/104062-general/topic/Arbalest.20V.26V/near/311473566\">said</a>:</p>\n<blockquote>\n<p>I've put a fair bit of effort into developing a Qt-style model for the .g file state - has Arbalest done that?</p>\n</blockquote>\n<p>I'm not sure what you mean by that.  I think the answer is a strict yes -- that's fully encapsulated in the aforementioned C++ api (rt^3/coreInterface) and a class representing that object.</p>",
        "id": 311475462,
        "sender_full_name": "Sean",
        "timestamp": 1669064977
    },
    {
        "content": "<p>I mean you can see some stark differences of the clean oo vs procedural that I'm referring to simply by looking at main() in both.  It extends throughout the code base, in general.</p>",
        "id": 311475744,
        "sender_full_name": "Sean",
        "timestamp": 1669065095
    },
    {
        "content": "<p>So if the command line adds or removes comb tree elements, the Arbalest tree is automatically updated?</p>",
        "id": 311475928,
        "sender_full_name": "starseeker",
        "timestamp": 1669065168
    },
    {
        "content": "<p>For example, in arbalest, the window is all encapsulated within a MainWindow class.  Main is short and sweet, and would be not much changed even if we introduced a CLI-only mode or made it support settings/options/etc.</p>\n<p>In qged, there's a BRLCAD_MainWindow (and CADapp, both expected) also.   But most of the rest is de-encapsulation.  There's procedural handling of console (instead of having a Console and GUI app classes that inherit from a base), procedural option handling (which should be handled by the app), some hard-insertion of settings for QOpenGLWidget that doesn't belong there, some theming  stuff (that probably belonged in the window class), settings ... and more, but you get the idea (hopefully?).</p>\n<p>It's not a critique, it's simply very different technical approach and has different coding practices.</p>",
        "id": 311476317,
        "sender_full_name": "Sean",
        "timestamp": 1669065314
    },
    {
        "content": "<p>&lt;nod&gt;  I think I do.  I guess I gravitate towards that approach at this stage because I'm still figuring out what the necessary pieces of the puzzle are, and it's easier (at least for me) to be able to adjust and tweak the procedural flows in a few pieces rather than having to unpack (and potentially re-design) the encapsulations during the design iterations.   Probably says more about my own limitations than anything else... it may be that qged simply ends up informing another design, in the end.</p>",
        "id": 311477202,
        "sender_full_name": "starseeker",
        "timestamp": 1669065711
    },
    {
        "content": "<p>That said, there are some very specific things that qged can currently do in a technical sense, that from my perspective would absolutely have to be present and working at scale in an alternative solution before it I could regard it as a viable alternative.</p>",
        "id": 311477453,
        "sender_full_name": "starseeker",
        "timestamp": 1669065825
    },
    {
        "content": "<p>The issue from a coding perspective is that style of procedural is very much like having a messy desk and saying \"I know where everything is\" ... that only works for one person.</p>\n<p>It's also still procedural and that does not translate to good OO.</p>",
        "id": 311478124,
        "sender_full_name": "Sean",
        "timestamp": 1669066201
    },
    {
        "content": "<p>Moreover, if there wasn't perceived value keeping it neat and tidy in the first place, that's demonstrably not likely to change and is still an issue for anyone else regardless.  When that's done across dozens of files, the learning curve becomes increasingly difficult with every de-encapsulated chunk of code.</p>",
        "id": 311478387,
        "sender_full_name": "Sean",
        "timestamp": 1669066296
    },
    {
        "content": "<p>Just looking at qged's main, we could probably talk for hours to transfer understanding for everything going on in there, why it's in there, where it possibly belonged if it were done properly, etc., and that's all on top of whatever effort that would be and hoping there's no side-effects for data tangled or implied.</p>",
        "id": 311478700,
        "sender_full_name": "Sean",
        "timestamp": 1669066426
    },
    {
        "content": "<p>That conversation literally doesn't exist in arbalest's main (or any of the other classes for that matter).  The learning curve is flat.</p>",
        "id": 311478792,
        "sender_full_name": "Sean",
        "timestamp": 1669066459
    },
    {
        "content": "<p>That's also why the capstone team was able to run with it.  I had them look at both.</p>",
        "id": 311479016,
        "sender_full_name": "Sean",
        "timestamp": 1669066573
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112516\">starseeker</span> <a href=\"#narrow/stream/104062-general/topic/Arbalest.20V.26V/near/311477453\">said</a>:</p>\n<blockquote>\n<p>That said, there are some very specific things that qged can currently do in a technical sense, that from my perspective would absolutely have to be present and working at scale in an alternative solution before it I could regard it as a viable alternative.</p>\n</blockquote>\n<p>I definitely agree with you there as well.  The command line and graphics displaying is superior from an end-user functionality perspective.  The hierarchy view might have a leg up too, but I've not looked as closely.  That is part why I was asking a few weeks ago how encapsulated/encapsulatable they are those.</p>",
        "id": 311479293,
        "sender_full_name": "Sean",
        "timestamp": 1669066706
    },
    {
        "content": "<p>They're definitely not OO, but it might not be terribly difficult to bridge what they use down through the same classes.</p>",
        "id": 311479408,
        "sender_full_name": "Sean",
        "timestamp": 1669066775
    },
    {
        "content": "<p>Here's a quick example of the draw_rework ability to integrate selection behavior from command line and GUI with drawing highlighting and tree highlighting:  <a href=\"/user_uploads/1549/H6LTdzeLWimavgDIiWPmEo4k/qged_select.gif\">qged_select.gif</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/1549/H6LTdzeLWimavgDIiWPmEo4k/qged_select.gif\" title=\"qged_select.gif\"><img src=\"/user_uploads/1549/H6LTdzeLWimavgDIiWPmEo4k/qged_select.gif\"></a></div>",
        "id": 311479613,
        "sender_full_name": "starseeker",
        "timestamp": 1669066873
    },
    {
        "content": "<p>I don't understand everything going on there, but I like the rect and point select.  Those would be good to have as default shift key bindings instead of having GUI widgetery.</p>",
        "id": 311480361,
        "sender_full_name": "Sean",
        "timestamp": 1669067239
    },
    {
        "content": "<p>What did select collapse and select expand do?</p>",
        "id": 311480552,
        "sender_full_name": "Sean",
        "timestamp": 1669067360
    },
    {
        "content": "<p>Change what particular level of selection was active in the tree paths.  A graphical selection always selects the full path - i.e. /a/b/c.s  This is the case even if every solid under b is selected.</p>",
        "id": 311480678,
        "sender_full_name": "starseeker",
        "timestamp": 1669067415
    },
    {
        "content": "<p>So if we have /a/b/c.s and a/b/d.s both selected, but don't have /a/e selected, a collapse can shift the selection \"up\" the tree to /a/b since all of b's components are active.</p>",
        "id": 311480745,
        "sender_full_name": "starseeker",
        "timestamp": 1669067462
    },
    {
        "content": "<p>If  the full definition of /a is /a/b and /a/e, and all of /a/b and /a/e 's child solids are selected, we can collapse the selection to /a</p>",
        "id": 311480915,
        "sender_full_name": "starseeker",
        "timestamp": 1669067545
    },
    {
        "content": "<p>Why wouldn't you always want to collapse?  Or always not collapse?</p>",
        "id": 311480920,
        "sender_full_name": "Sean",
        "timestamp": 1669067547
    },
    {
        "content": "<p>For editing purposes, you may specifically want your matrix applications to be at lower levels.</p>",
        "id": 311481002,
        "sender_full_name": "starseeker",
        "timestamp": 1669067597
    },
    {
        "content": "<p>As a general design principle, you want to be able to select any instance at any level of the hierarchy, or sets of them.</p>",
        "id": 311481036,
        "sender_full_name": "starseeker",
        "timestamp": 1669067625
    },
    {
        "content": "<p>With multiple applications of select and remove operations, you can zero in on comb instances graphically</p>",
        "id": 311481147,
        "sender_full_name": "starseeker",
        "timestamp": 1669067669
    },
    {
        "content": "<p>Sorry, I'm acting as a distraction.</p>",
        "id": 311481247,
        "sender_full_name": "starseeker",
        "timestamp": 1669067726
    },
    {
        "content": "<p>I can see that I guess, it's just the usability seems awkward.  It's a degree of freedom that seems like will have many edge cases .. especially assuming you allow expanding down to primitives..</p>",
        "id": 311481295,
        "sender_full_name": "Sean",
        "timestamp": 1669067752
    },
    {
        "content": "<p>btw, 'collapse' and 'expand' don't sound intuitive to me, maybe another verb describing the action</p>",
        "id": 311481469,
        "sender_full_name": "Sean",
        "timestamp": 1669067846
    },
    {
        "content": "<p>maybe lift and lower  ?</p>",
        "id": 311481703,
        "sender_full_name": "Sean",
        "timestamp": 1669067958
    },
    {
        "content": "<p>or even maybe push/pull if that doesn't conflict</p>",
        "id": 311481772,
        "sender_full_name": "Sean",
        "timestamp": 1669068001
    },
    {
        "content": "<p>when in selection mouse mode, could make shift+mouse do select and shift+drag do band select, both adding to the selection set.  creo does that and uses shift+double-click to deselect.  select nothing or hit esc to deselect all.</p>",
        "id": 311482342,
        "sender_full_name": "Sean",
        "timestamp": 1669068257
    },
    {
        "content": "<p>Phew, that's a long thread. I want however start with this one:<br>\n<span class=\"user-mention silent\" data-user-id=\"112516\">starseeker</span> <a href=\"#narrow/stream/104062-general/topic/Arbalest.20V.26V/near/311470644\">said</a>:</p>\n<blockquote>\n<p>A naive question about Arbalest's intent longer term - is it intended to eventually replace MGED?</p>\n</blockquote>\n<p>From my perspective, Arbalest is a test case for an application build on top of the C++ interface. I don't have the time to build an mged replacement. Instead, I'm interested in perfecting this API. It works well for my day job, but there may be others who would want to use it too, if it provides the functionality they need. Regarding this aspect, this V&amp;V effort was unfortunately a failure.</p>\n<p>For an alternative way of doing this V&amp;V stuff, look at CommandString in MOOSE.</p>",
        "id": 311550356,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1669108925
    },
    {
        "content": "<p>Some additional words about \"perfecting\" the interface: There is of course the API side: Headers, classes, ... But, I consider the system architecture (is this the right word?) too. I.e., the files necessary to provide the functionality. For example, it shall be possible to provide Debian libbrlcad and libbrlcad-dev packages which are doing just this: Providing a shared object and the header files to use it.</p>",
        "id": 311552538,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1669109731
    },
    {
        "content": "<p>Document orientation: Arbalest shall show a behavior like people familiar with an office suite would expect: They can open a file, view its content, change it, save the changes or discard them. Most other programs behave the same way. vi doesn't write the file after each key press but after the !w command. To achieve this, Archer works on in-memory databases.</p>",
        "id": 311555132,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1669110649
    },
    {
        "content": "<p>I.e., I see Arbalest more as a technology demonstrator. In this spirit, the MouseAction class was introduced too. It implements a design pattern which allows you to manage the different kinds of interactions you can have with the geometry: Changing the view (zooming, shifting, rotating, ...), changing the geometry (resizing, moving, create and delete something, ...), selecting, ...</p>\n<p>This doesn't however mean that nobody else can have bigger intentions with Arbalest. As long as they don't  collide with my goals, I'll support them. If they collide - well, it's open source.</p>",
        "id": 311558602,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1669111921
    },
    {
        "content": "<p>My and/or Himanshu's next steps will be to integrate the open pull requests in Arbalest (nothing is forgotten there, just short in time) and to port the program to MOOSE then. I see MOOSE as the attempt to make an own \"product\" from rt-cubed's coreIntercace \"prototype\".</p>",
        "id": 311559821,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1669112373
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/stream/104062-general/topic/Arbalest.20V.26V/near/311468591\">said</a>:</p>\n<blockquote>\n<p>I'm not sure I understand the second bullet about not working on the Arbalest document though -- can you elaborate?  The V&amp;V checks are performed read-only.  The only thing written out should be a corresponding sqlite database that is stored in the cache folder (so when you return to that .g later, it can keep track of any changes made).</p>\n</blockquote>\n<p>See lines 570ff in isaacy13's MainWindow.cpp. Arbalest works with in-memory databases, but the V&amp;V tool want's to use ged_open with a file path.</p>",
        "id": 311561381,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1669112962
    }
]