[
    {
        "content": "<p>Hey all, looking for feedback on <a href=\"https://sourceforge.net/p/brlcad/code/HEAD/tree/brlcad/trunk/doc/checklist.txt\" target=\"_blank\" title=\"https://sourceforge.net/p/brlcad/code/HEAD/tree/brlcad/trunk/doc/checklist.txt\">https://sourceforge.net/p/brlcad/code/HEAD/tree/brlcad/trunk/doc/checklist.txt</a> </p>\n<p>Feel free to point out any mistakes, essential criteria missing, or items you think don't belong.</p>",
        "id": 170415169,
        "sender_full_name": "Sean",
        "timestamp": 1562634031
    },
    {
        "content": "<p>In my opinion, it needs some polishing. It's in the state between a list of criteria and a check list where I can tick the items.</p>\n<p>For example, I'm already stuck in the first point <code>00. Are all changes legally compatible?  Per COPYING, assigned or 0BSD/PD.</code>. What shall I do here? Three checks come into my mind:</p>\n<ul>\n<li>Has the contributor consented to BRL-CAD's copyright and license?</li>\n<li>If it's a new file, does it have appropriate copyright and license header? (There should be a list of appropriate headers.)</li>\n<li>Has code taken from other projects a compatible license?</li>\n</ul>\n<p>But it could be more.</p>",
        "id": 171893112,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1564326948
    },
    {
        "content": "<p>thanks for the feedback, definitely do wanting a checklist that can be ticked and not subjective criteria</p>",
        "id": 172141730,
        "sender_full_name": "Sean",
        "timestamp": 1564590227
    },
    {
        "content": "<p>also trying to balance not having too many checklist entries, which is why legal was collapsed all into one item, and trying to avoid \"if X then Y\" checklist items that might not apply</p>",
        "id": 172142554,
        "sender_full_name": "Sean",
        "timestamp": 1564590892
    },
    {
        "content": "<p>updated the text of the first couple points to make them more testable and eliminate the conditional.</p>",
        "id": 172149611,
        "sender_full_name": "Sean",
        "timestamp": 1564595907
    }
]