[
    {
        "content": "<p>Here's a general topic stream for discussing recent commit activity and commit review.</p>",
        "id": 211794281,
        "sender_full_name": "Sean",
        "timestamp": 1601487048
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112516\">@starseeker</span> question on 77287, is there perhaps another way to go about it?  I've been working towards eliminating apps being aware of the compilation root.  Any code making assumptions about prefix/root end up being problematic for creating relocatable binaries</p>",
        "id": 211794557,
        "sender_full_name": "Sean",
        "timestamp": 1601487182
    },
    {
        "content": "<p>That's why the new bu_dir() API didn't expose it, so new code wouldn't be written against it.</p>",
        "id": 211794708,
        "sender_full_name": "Sean",
        "timestamp": 1601487244
    },
    {
        "content": "<p>Is there some issue in archer?  I did update and fix a slew of hard-coded assumptions throughout archer and may have missed some...</p>",
        "id": 211794778,
        "sender_full_name": "Sean",
        "timestamp": 1601487274
    },
    {
        "content": "<p>I wanted it to conditionalize a more aggressive  search behavior for init.tcl in the libtclcad initialization...</p>\n<p>You can yank it from trunk if you want - I only did it there because I couldn't test it in the thirdparty branch due to breakage, and I've got it in there now as part of 77288.</p>",
        "id": 211807051,
        "sender_full_name": "starseeker",
        "timestamp": 1601493381
    },
    {
        "content": "<p>I'm a ways from the dust settling in thirdparty - arguably I'm not even to the hard part yet (making the final install packages and install targets for the superbuild).  Once I've got something that actually works there and can boil it down to hard requirements it'll probably be more interesting/useful to consider how to handle certain issues.</p>",
        "id": 211807333,
        "sender_full_name": "starseeker",
        "timestamp": 1601493541
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"102902\">@Sean</span> from a design perspective, I seem to recall early on that an awareness of what the intended install directory was for the application was considered important, to make sure the installed binary always grabbed its associated files/plugins/scripts.</p>",
        "id": 211807835,
        "sender_full_name": "starseeker",
        "timestamp": 1601493808
    }
]