[
    {
        "content": "<p>Looking at the Visual Studio Community Edition (MSVC CE), I believe the Creo plugin very clearly falls under the \"Any number of your users may use the software to develop and test applications released under Open Source Initiative (OSI) approved open source software licenses.\"  It also falls under \"If you are an enterprise, your employees and contractors may not use the software to develop or test your applications, except for: (i) open source;\" with the key being an application that is \"released under OSI approved open source license.\"</p>\n<p>The source code is very clearly released under OSI license, so MSVC CE can be used for development and testing to my eyes.  Whether it's okay to use MSVC CE to create and redistribute a resulting binary looks like will depend entirely on what PTC's terms say.  If they give license for our compiled plugin to be shared/sold/licensed/redistributed separately, then that would mean the binary can be released under an OSI approved license and would make it also compatible with MSVC CE usage.  If it does not, then we're only able to use MSVC CE for coding, but not for producing redistributable binaries.  Of course, if PTC doesn't give licensing/redistribution rights, even using MSVC Pro wouldn't get around that limitation but at least wouldn't preclude building binaries for use within an organization.</p>\n<p>Have to see what PTC licensing says.</p>",
        "id": 218337072,
        "sender_full_name": "Sean",
        "timestamp": 1606766173
    },
    {
        "content": "<p>Okay, just found references in the TOOLKIT docs and it looks like they allow redistribution to end users if the plugin is unlocked.  Unlocking requires the Creo Parametric TOOLKIT license option, which can be discovered by running the Ptcstatus utility, clicking File <span aria-label=\"play\" class=\"emoji emoji-25b6\" role=\"img\" title=\"play\">:play:</span> Help <span aria-label=\"play\" class=\"emoji emoji-25b6\" role=\"img\" title=\"play\">:play:</span> System Information. In the INFORMATION WINDOW, under Configured Option Modules we check for the license option TOOLKIT.  If that's there and we can unlock, that would mean we can put binaries up built with MSVC CE.</p>",
        "id": 218410970,
        "sender_full_name": "Sean",
        "timestamp": 1606823401
    }
]