[
    {
        "content": "<p>import  IGES  or STEP<br>\nerror！！！</p>",
        "id": 518921704,
        "sender_full_name": "claymonkey",
        "timestamp": 1747574467
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"782450\">@claymonkey</span> iges import is tricky as you have to know and specify the type, and even then it can have problems if the data is not clean -- there are lots of iges exporters that export junk.  </p>\n<p>with step import, the most common cause is trying to import something that is not ap203e1 -- that's all that's presently supported.  some like ap214 or e2 are also common.</p>",
        "id": 518989530,
        "sender_full_name": "Sean",
        "timestamp": 1747627631
    },
    {
        "content": "<p>I tried to use the reading method of OpenCaseCAD to parse IGEs. However, it was very troublesome to convert all faces into NURBSface+NURBScurve logic. Especially when I wanted to translate the type into other BREPS models, the speed was very unsatisfactory. This reminded me of the BREPS structure in the current software, but errors frequently occurred when I tried to import it.</p>",
        "id": 520672759,
        "sender_full_name": "claymonkey",
        "timestamp": 1748353435
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"782450\">@claymonkey</span> what is your use case, end goal?</p>",
        "id": 521350136,
        "sender_full_name": "Sean",
        "timestamp": 1748629507
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 521495475,
        "sender_full_name": "claymonkey",
        "timestamp": 1748744229
    },
    {
        "content": "<p>Try to parse the CAD file by yourself and convert it into a creatable BREP type.</p>",
        "id": 521495515,
        "sender_full_name": "claymonkey",
        "timestamp": 1748744271
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"782450\">@claymonkey</span> so just for the technical challenge?  or some other purpose? parsing and converting from iges/step to some brep in-memory structure is not exactly an end-use case..  </p>\n<p>If you're working with BRL-CAD, the 3dm-g is by far the best brep import method that imports faithfully &amp; natively using OpenNURBS.  Next best is step-g if it's an ap203e1 file.  The iges-g importer hasn't been tested or used in production use for nearly a decade, but it has extensive code for multiple import methods and encoding types (including automatic re-encoding of bspline to NURBS) but also less reliable if there are any errors in the geometry.</p>",
        "id": 521505821,
        "sender_full_name": "Sean",
        "timestamp": 1748751757
    },
    {
        "content": "<p>Because I found that the Brep type of openNurbs is quite similar to that of opencascad, when some programs do not support certain operations, I thought of using the underlying feedback information to create corresponding ones, hoping that other open-source methods can handle them more precisely.</p>",
        "id": 521527716,
        "sender_full_name": "claymonkey",
        "timestamp": 1748766915
    },
    {
        "content": "<p>It is indeed similar, but not 1-1 identical if memory serves.</p>",
        "id": 521556957,
        "sender_full_name": "Sean",
        "timestamp": 1748786285
    },
    {
        "content": "<p>so are you looking to bridge geometry from some application built on opencascade into brl-cad, to some operation that brl-cad handles better, and then convert it back?</p>",
        "id": 521557028,
        "sender_full_name": "Sean",
        "timestamp": 1748786347
    },
    {
        "content": "<p>Yes, if multiple software functions are combined, then only common cad types can be used for conversion. After all, brep will not be exactly the same</p>",
        "id": 521557467,
        "sender_full_name": "claymonkey",
        "timestamp": 1748786620
    },
    {
        "content": "<p>that would certainly be feasible for brep and/or polygonal types I'd think</p>",
        "id": 521557568,
        "sender_full_name": "Sean",
        "timestamp": 1748786668
    },
    {
        "content": "<p>problematic encodings are typically:  implicits, csg booleans, volumetric/voxel data, level sets, subdivision surfaces, t-splines, medial axis, signed distance fields, and parametric ops like sweep/loft/extrude</p>",
        "id": 521557893,
        "sender_full_name": "Sean",
        "timestamp": 1748786875
    },
    {
        "content": "<p>brep is more amenable, includes triangles, polygons, bezier patches, b-spline patches, and nurbs surfaces</p>",
        "id": 521558037,
        "sender_full_name": "Sean",
        "timestamp": 1748786956
    },
    {
        "content": "<p>Perhaps FACE can be parsed as a combination of the basic NurbsSurface and CurvesToTrimed<br>\n. Then perhaps in any logic, there will be corresponding creation methods.</p>",
        "id": 521558374,
        "sender_full_name": "claymonkey",
        "timestamp": 1748787178
    },
    {
        "content": "<p>There was some work done a while back on opennurbs -&gt; opencascade, IIRC - I think it was this?  <a href=\"https://www.cnblogs.com/opencascade/p/opennurbs2opencascade.html\">https://www.cnblogs.com/opencascade/p/opennurbs2opencascade.html</a></p>",
        "id": 521616069,
        "sender_full_name": "starseeker",
        "timestamp": 1748822052
    },
    {
        "content": "<p>I recall hunting around a while back because going to/from opennurbs and opencascade data types would be a  keystone of a converter of .g geometry to/from FreeCAD</p>",
        "id": 521616154,
        "sender_full_name": "starseeker",
        "timestamp": 1748822128
    },
    {
        "content": "<p>It would be really awesome if we had two way communication with FreeCAD, but my recollection is that the problem is fairly involved - NURBS BRep objects have a LOT of subtypes, and there are subtleties that need to be taken into account.</p>",
        "id": 521616276,
        "sender_full_name": "starseeker",
        "timestamp": 1748822215
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"102939\">@Daniel Rossberg</span> do you work much with BoT models?  curious to hear if you or users you work with see noticeable change</p>",
        "id": 534681317,
        "sender_full_name": "Sean",
        "timestamp": 1755275868
    },
    {
        "content": "<p>The model creation is usually done with a commercial CAD, and then transferred via STL. Therefore, I would say yes. We'll keep an eye on it.</p>",
        "id": 534683684,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1755276996
    },
    {
        "content": "<p>Yeah, that should definitely be impacted.... in a pretty big way. Curious to know how much for you.</p>",
        "id": 534690241,
        "sender_full_name": "Sean",
        "timestamp": 1755280271
    },
    {
        "content": "<p>I have crunched a lot of numbers that I'll share here publicly soon, probably this upcoming week as I'm documenting them in even more detail.</p>",
        "id": 534690341,
        "sender_full_name": "Sean",
        "timestamp": 1755280316
    },
    {
        "content": "<p>seeing anywhere from 2x-20x on most models, some even going 200-2000x but atypical.  if you were using adrt, the main difference is that really long prep time is now gone.  if you weren't using adrt, prep is about same (ie. fast) but ray tracing is going to be 100+ times faster on most models.</p>",
        "id": 534690627,
        "sender_full_name": "Sean",
        "timestamp": 1755280464
    },
    {
        "content": "<p>Generic BRL-CAD article in the news:  <a href=\"https://www.3dnatives.com/en/brl-cad-the-design-software-created-for-defense-140520256/\">https://www.3dnatives.com/en/brl-cad-the-design-software-created-for-defense-140520256/</a></p>",
        "id": 534690655,
        "sender_full_name": "Sean",
        "timestamp": 1755280479
    },
    {
        "content": "<p>Hi everyone,<br>\nI’m currently working on setting up the Arbalest V&amp;V GUI project and wanted to ask for some guidance regarding build issues.</p>\n<p>What I’ve done so far<br>\nForked and cloned the Arbalest repository<br>\nInstalled Qt, CMake, and all required dependencies<br>\nTried building Arbalest following the available instructions</p>\n<p>Issues I’m facing<br>\nThe code in Arbalest does not seem to match the structure of the latest BRL-CAD version. Several BRL-CAD libraries appear to be renamed or missing in the latest release I could not find a BRL-CAD version where the file structure matches the Arbalest source Specifically, the db folder expected by Arbalest seems to be missing in recent BRL-CAD builds, causing additional errors. Some libraries referenced in the code seem outdated or changed, and I cannot locate their new equivalents<br>\nWhat I need help with<br>\nCould anyone please tell me which BRL-CAD version Arbalest was originally developed/tested with, so I can download the matching version and build successfully?</p>",
        "id": 556687922,
        "sender_full_name": "Kanchan Borole",
        "timestamp": 1763302285
    },
    {
        "content": "<p>Hi everyone,<br>\nI’m setting up the Geometric Verification &amp; Validation GUI in Qt project on Windows using CMake + MinGW + Qt 6.10.0, and I’ve followed these steps:</p>\n<ol>\n<li>Installed Qt 6.10.0 (mingw_64)</li>\n<li>Installed MinGW-w64 13.1.0 and added to PATH</li>\n<li>Installed BRL-CAD 7.32.2 and set <code>BRL-CAD_DIR</code> in CMake</li>\n<li>\n<p>Ran CMake in a <code>build</code> folder:<br>\n<code>cmake .. -G \"MinGW Makefiles\" -DCMAKE_PREFIX_PATH=\"C:\\Qt\\6.10.0\\mingw_64\" -DQt6_DIR=\"C:\\Qt\\6.10.0\\mingw_64\\lib\\cmake\\Qt6\"</code></p>\n</li>\n<li>\n<p>Ran <code>mingw32-make</code> – moc files generate successfully, but compilation fails at <code>MainWindow.cpp</code> with:<br>\nC:/PROGRA~1/BRL-CA~1.2/include/brlcad/rt/comb.h:30:12: fatal error: opennurbs.h: No such file or directory<br>\n   30 | #  include \"opennurbs.h\"<br>\nalso there is an error of NOMINMAX</p>\n</li>\n</ol>\n<p>I understand that <code>opennurbs.h</code> is part of OpenNURBS, which may not be included in the BRL-CAD binary. I’m not sure if  I need to:</p>\n<ul>\n<li>Install OpenNURBS separately,</li>\n<li>Adjust some CMake flags in the project, or</li>\n<li>Build BRL-CAD from source to include the headers.<br>\nI’d appreciate any guidance on whether how to fix this , or if this requires changes in the project setup. Screenshots regarding the CMake/MinGW issue couldn’t attach, so here’s the link to view them: <a href=\"https://drive.google.com/file/d/1igtZNh8XMu9IVdFuEVzoqkvQ_s_rNDll/view?usp=drive_link\">https://drive.google.com/file/d/1igtZNh8XMu9IVdFuEVzoqkvQ_s_rNDll/view?usp=drive_link</a></li>\n</ul>",
        "id": 561001231,
        "sender_full_name": "Kanchan Borole",
        "timestamp": 1764511381
    },
    {
        "content": "<p>I don't know much about the V&amp;V version of arbalest, but opennurbs.h should still be in the include folder of your BRL-CAD installation. Maybe, in the OpenNURBS directory?</p>",
        "id": 561022495,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1764528532
    },
    {
        "content": "<p>Thanks for the clarification!<br>\nI checked my BRL-CAD installation and found the <code>openNURBS</code> directory under the <code>include</code> folder, and I can see the header files there. There is some header name issues.<br>\nTo avoid version mismatches, I’m currently rebuilding BRL-CAD from source locally and configuring Arbalest against that build. I’ll update once I get past the current build issues.</p>",
        "id": 563820977,
        "sender_full_name": "Kanchan Borole",
        "timestamp": 1765804893
    },
    {
        "content": "<p>Hey everyone,<br>\nI’m Shayan. I’m a working professional with experience in Node.js, React, and Three.js, and I’m very interested in getting started with open-source contributions.</p>\n<p>I recently came across BRL-CAD and noticed an issue related to the OGV project, which was mentioned as part of GSoC 2025 ideas. From what I understand, OGV is an older project that could benefit from significant updates and the addition of new features, and I’d be really excited to contribute to its development.</p>\n<p>Although I’ve noticed that there hasn’t been much recent activity on this project, I’m quite curious to work on it. I wanted to ask whether contributions to OGV are still welcome, and if there is any recommended way to get started or specific areas that need attention.</p>\n<p>I also had a quick question regarding the future of this project. Is OGV expected to be proposed again for GSoC 2026?</p>",
        "id": 564527954,
        "sender_full_name": "Shayan Ghosh",
        "timestamp": 1766081031
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"892744\">@Kanchan Borole</span> any progress getting it to build?  feel free to share build issues you're stuck on.</p>\n<p><span class=\"user-mention\" data-user-id=\"1007536\">@Shayan Ghosh</span> welcome!  there has been recent activity -- it was a gsoc project just this past summer where it was prototyped as a pastebin-style webapp for geometry sharing.</p>",
        "id": 565933184,
        "sender_full_name": "Sean",
        "timestamp": 1767215390
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"102902\">@Sean</span>  Hi, I wanted to share a brief update and ask for some guidance.<br>\nI’ve been working on building BRL-CAD from source on Windows. I was able to clone the repository and set up the toolchain, and initially tried the Visual Studio generator. Due to long configure times and generator issues, I switched to using Ninja, which has been more stable so far.</p>\n<p>At the moment, I’m running into problems during the <code>bext</code> external dependency build step, and I’ve been trying clean rebuilds and different configuration options to understand it better. I wanted to check whether this is the right approach on Windows, or if there’s a recommended setup or workflow you’d suggest for this stage.</p>\n<p>Thanks — I’d appreciate any pointers.</p>",
        "id": 566052722,
        "sender_full_name": "Kanchan Borole",
        "timestamp": 1767356771
    },
    {
        "content": "<p>The long configuration time for brlcad is expected, because it includes the build of the external dependencies in bext. You can try to build bext separately instead:</p>\n<ul>\n<li>In your (empty) bext build directory: <code>cmake &lt;path to the bext sources&gt; -DCMAKE_BUILD_TYPE=Debug</code></li>\n<li>If this doesn't work, you can try to add <code> -DENABLE_ALL=ON</code> at the end of the cmake command</li>\n<li>In your (empty) brlcad build directory: <code>cmake &lt;path to the brlcad sources&gt; -DCMAKE_BUILD_TYPE=Debug -DCMAKE_INSTALL_PREFIX=&lt;path to a directory, where you can install the program without administrator rights&gt; -DBRLCAD_EXT_DIR=&lt;path to the bext build directory from the step before&gt;</code></li>\n<li>Build brlcad with MS Visual Studio by opening the solution file and building the ALL_BUILD project (INSTALL installs the programs in the directory given in the previous step)</li>\n</ul>",
        "id": 566078983,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1767372935
    },
    {
        "content": "<p>Everything Daniel said <span class=\"user-mention\" data-user-id=\"892744\">@Kanchan Borole</span> </p>\n<p>Ninja is definitely the faster path though I more often test the default non-ninja generator path myself.  Configure will take a long time because it downloads and compiles all external deps like Daniel mentioned.  Both should work though -- if they don't please share the first couple error.</p>\n<p>Note that by default the cmake build of the \"brlcad\" repo automatically obtains and compiles the \"bext\" repo.  If you clone and compile \"bext\" yourself, you do want to set that BRLCAD_EXT_DIR variable.  I do not usually open the solution myself unless I'm building a release, instead just relying on the default visual studio cmake configuration and compilation of everything.  Others here do regularly open the solution as their preferred approach which has way more options.</p>",
        "id": 566205065,
        "sender_full_name": "Sean",
        "timestamp": 1767512522
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"102939\">@Daniel Rossberg</span>  and <span class=\"user-mention\" data-user-id=\"102902\">@Sean</span>  for the guidance.</p>\n<p>I followed the suggested workflow and tried building <strong>bext separately</strong> using Ninja in a clean build directory. The CMake configuration completed successfully, but the build consistently fails during External Project steps (notably PROJ / GDAL / GEOGRAM), with errors related to missing PROJ libraries and dependency build failures.</p>\n<p>I then tried the alternative approach of opening the <strong>brlcad repository directly in Visual Studio</strong> and relying on the default CMake configuration to build bext automatically, but it still ends with -<br>\nCMake Error at misc/CMake/BRLCAD_Util.cmake:102 (_message):<br>\n  Unable to successfully build bext dependency repository</p>\n<p>At this stage, I wanted to ask what the recommended next step would be on Windows — whether there’s a preferred workaround (partial build, disabling certain deps, prebuilt deps).</p>",
        "id": 566210773,
        "sender_full_name": "Kanchan Borole",
        "timestamp": 1767519699
    },
    {
        "content": "<p>From your description, it looks like the PROJ build fails. Why? What's the CMake output regarding the compilation error there? What's in the logfiles?<br>\n(Currently, I've no Visual Studio at hand.)</p>",
        "id": 566232968,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1767543638
    },
    {
        "content": "<p>Earlier, I was building using Command Prompt with Ninja(Bext Separately), and in that attempt the build failed while compiling the PROJ external dependency (GDAL/PROJ-related errors).</p>\n<p>After that, I cleaned everything and opened the brlcad folder directly in Visual Studio to let CMake handle bext automatically. In this fresh Visual Studio configuration, the build now stops earlier in the dependency chain at GEOGRAM, so PROJ is not reached or downloaded in this run, which is why PROJ logs are not present now.</p>\n<p>The current failure in Visual Studio is:<br>\n[CMake] Building Custom Rule .../bext/gdal/CMakeLists.txt<br>\n[CMake] Completed 'TKTABLE_BLD'<br>\n[CMake] Completed 'GDAL_BLD'<br>\n[CMake] CMake Error at misc/CMake/BRLCAD_Util.cmake:102 (message):<br>\n[CMake]   Unable to successfully build bext dependency repository<br>\n[CMake] Call Stack (most recent call first):<br>\n[CMake]   misc/CMake/BRLCAD_EXT_Setup.cmake:442 (message)<br>\n[CMake]   misc/CMake/BRLCAD_ExternalDeps.cmake:529 (brlcad_ext_setup)<br>\n[CMake]   CMakeLists.txt:2114 (brlcad_bext_process)</p>\n<p>I’m attaching a Word file with the relevant CMake output and logs (screenshots  attaching aren’t working on my system currently). Please let me know whether you’d like me to rerun specifically to reproduce the PROJ failure again, or if debugging GEOGRAM first is the correct next step on Windows.<br>\nWord File Link - <a href=\"https://docs.google.com/document/d/1kQzoFzuWVjckSlX53hVw0G1QuUAm3Aig/edit?usp=drive_link&amp;ouid=117474697357203901480&amp;rtpof=true&amp;sd=true\">https://docs.google.com/document/d/1kQzoFzuWVjckSlX53hVw0G1QuUAm3Aig/edit?usp=drive_link&amp;ouid=117474697357203901480&amp;rtpof=true&amp;sd=true</a></p>",
        "id": 566540219,
        "sender_full_name": "Kanchan Borole",
        "timestamp": 1767704837
    },
    {
        "content": "<p>downloading and compiling external deps during the cmake phase is lame, especially for systems with lots of CPUs available. Can they be cloned and folded in during the ninja/make phase?</p>",
        "id": 566639779,
        "sender_full_name": "Erik",
        "timestamp": 1767744241
    },
    {
        "content": "<p>I'm all in on ninja, regressing to make when ninja is available is a loss, though the capability should be maintained. CMake is pretty good about this in general</p>",
        "id": 566639997,
        "sender_full_name": "Erik",
        "timestamp": 1767744390
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"892744\">@Kanchan Borole</span>, should I have mentioned that you have to call <code>cmake</code> in a Visual Studio shell? I've just tested the bext build with Visual Studio 2019 and it worked with the formerly posted CMake command followed by <code>cmake --build .</code> I haven't fully analysed the your Word file, but the first lines suggest that you haven't used a Visual Studio shell.</p>",
        "id": 566772896,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1767803267
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"102939\">@Daniel Rossberg</span>  , thanks for pointing that out and for testing it on your side.  I did rerun the entire bext build from the Visual Studio Shell after your guidance. With that, all dependencies completed successfully — only GEOGRAM fails. <br>\nThe Error is - <br>\nC:/Users/DELL/Documents/brlcad-work/build-bext/geogram/GEOGRAM_BLD-prefix/src/GEOGRAM_BLD-stamp/GEOGRAM_BLD-build-*.log<br>\n-- stdout --<br>\nMSBuild version 18.0.5+e22287bf1 for .NET Framework<br>\npoisson_geogram.cpp<br>\nC:\\Program Files\\Microsoft Visual Studio\\18\\Community\\VC\\Tools\\MSVC\\14.50.35717\\include\\xmemory(1525,23): error C2440:<br>\n'static_cast': cannot convert from 'const _Alloc' to 'GEO::Memory::aligned_allocator&lt;U,64&gt;'<br>\nC:\\Users\\DELL\\Documents\\brlcad-work\\build-bext\\geogram\\GEOGRAM_BLD-prefix\\src\\GEOGRAM_BLD\\src\\lib\\geogram\\basic\\memory.h(624,1):<br>\nno matching constructor; failed conversion for std::vector&lt;T, GEO::Memory::aligned_allocator&lt;T,64&gt;&gt;<br>\n-- stderr --<br>\nMSBuild\\Microsoft\\VC\\v180\\Microsoft.CppCommon.targets(254,5): error MSB8066:<br>\nCustom build for GEOGRAM_BLD exited with code 1</p>",
        "id": 566943477,
        "sender_full_name": "Kanchan Borole",
        "timestamp": 1767879470
    },
    {
        "content": "<p>This could be caused by your new compiler (Visual Studio 2026). Maybe the current geogram (<a href=\"https://github.com/BrunoLevy/geogram\">https://github.com/BrunoLevy/geogram</a>) can be build with VS2026. Maybe applying <a href=\"https://github.com/BrunoLevy/geogram/commit/5c18dc89209189ab7b507ad230b50ef2952cae49\">https://github.com/BrunoLevy/geogram/commit/5c18dc89209189ab7b507ad230b50ef2952cae49</a> to your code (cloned repository) helps. Hard to say, I'm still using VS2019.</p>",
        "id": 566997506,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1767893569
    },
    {
        "content": "<p>Thanks, Using Visual Studio 2019, GEOGRAM now builds successfully and the bext build completes without errors. I’m now proceeding with the BRL-CAD build as the next step and will update once that finishes.</p>",
        "id": 567542904,
        "sender_full_name": "Kanchan Borole",
        "timestamp": 1768226773
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"103542\">Erik</span> <a href=\"#narrow/channel/104062-brlcad/topic//near/566639779\">said</a>:</p>\n<blockquote>\n<p>downloading and compiling external deps during the cmake phase is lame, especially for systems with lots of CPUs available. Can they be cloned and folded in during the ninja/make phase?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"103542\">@Erik</span>   Unfortunately, the answer to that is a hard no.  It has to do with how and when CMake's find_package needs to make information about dependencies available.  Our previous generation build system actually did do that in the build phase (the only large scale project I am aware of to actually make that function correctly) but the necessary custom machinery was too extensive to be generally maintainable.  Qt, in particular, cannot be successfully managed as a dependency the way we were doing it in the previous iteration (although it's not the only problem child.</p>",
        "id": 567682578,
        "sender_full_name": "starseeker",
        "timestamp": 1768278429
    },
    {
        "content": "<p>That's why the recommended approach for serious development is to build bext yourself separately, and then point the BRL-CAD CMake to the prepared bext outputs.  It avoids more than the minimum copy and prep work during configure.</p>",
        "id": 567682663,
        "sender_full_name": "starseeker",
        "timestamp": 1768278500
    },
    {
        "content": "<p>I rebuilt <code>bext</code> from scratch with VS2019 using<br>\n<code>cmake ..\\src\\bext -G \"Visual Studio 16 2019\" -A x64 -DBRLCAD_ENABLE_RLE=ON</code><br>\nfollowed by <code>cmake --build . --config Debug</code>.<br>\nThe build completes successfully, but no UTAHRLE artifacts are produced —<br>\n<code>dir . /s | findstr utahrle</code> returns nothing.<br>\nWhen configuring BRL-CAD, CMake fails with<br>\n<code>Could NOT find UTAHRLE (UTAHRLE_LIBRARY, UTAHRLE_INCLUDE_DIR)</code>.<br>\nCould you advise whether UTAHRLE is expected to build on Windows, or if it should be disabled / handled differently in the Windows toolchain?</p>",
        "id": 567994923,
        "sender_full_name": "Kanchan Borole",
        "timestamp": 1768399771
    },
    {
        "content": "<p>UTAHRLE was removed from bext: <a href=\"https://github.com/BRL-CAD/bext/commit/cfdef3de771c38a7da7a4edea2b61541c029ae6a\">https://github.com/BRL-CAD/bext/commit/cfdef3de771c38a7da7a4edea2b61541c029ae6a</a><br>\nSee also <a href=\"https://github.com/BRL-CAD/brlcad/commit/446c9604feaecf9a90c58213e65f06f6a0aa65cf\">https://github.com/BRL-CAD/brlcad/commit/446c9604feaecf9a90c58213e65f06f6a0aa65cf</a> (however, github shows a warning for this commit)</p>\n<p>If</p>\n<ul>\n<li>updating the <strong>brlcad</strong> repository</li>\n<li>rerunning cmake for <strong>brlcad</strong></li>\n</ul>\n<p>doesn't solve the problem, you should ask <span class=\"user-mention\" data-user-id=\"112516\">@starseeker</span> for help.</p>",
        "id": 568009879,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1768403329
    },
    {
        "content": "<p>After updating BRL-CAD and rerunning CMake, BRL-CAD builds successfully on Windows (mged/rt working). While building with VS 2019, I fixed an MSVC-specific issue in <code>bot.c</code> related to <code>_Thread_local</code>.<br>\nWhile configuring Arbalest, CMake fails to find Qt6 with VS 2019:<br>\n<code>Could not find Qt6Config.cmake</code><br>\nIt appears current Qt 6 Windows installers no longer provide MSVC 2019 builds, so I moved to VS 2022 + Qt 6 (MSVC 2022). With VS 2022, BRL-CAD configuration proceeds, but I am currently resolving an ASM-related issue during <code>bext</code> (PNG) builds (<code>No CMAKE_ASM_COMPILER could be found</code>) This persists despite NASM/ML64 being installed and available in PATH. At this point I may be missing a BRL-CAD–specific or Windows-specific configuration detail — could you advise the correct approach here, or whether ASM should be explicitly disabled for this dependency?. I am actively debugging this and continuing the rebuild cleanly. <br>\nPlease let me know if this direction looks correct.</p>",
        "id": 569298176,
        "sender_full_name": "Kanchan Borole",
        "timestamp": 1769012644
    },
    {
        "content": "<p>Indeed, there was a discussion regarding the _Thread_local issue last year: <a class=\"message-link\" href=\"/#narrow/channel/104062-brlcad/topic/BRL-CAD.20release/near/534191365\">#brlcad &gt; BRL-CAD release @ 💬</a></p>\n<p>Regarding Arbalest and Qt6: You could build brlcad and MOOSE with MSVS 2019 and arbalest with MSVS 202x. This should work. Arbalest (at least the version on GitHub) has the MOOSE library as only BRL-CAD dependency.</p>",
        "id": 569321838,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1769018696
    },
    {
        "content": "<p>Following advice - building BRL-CAD + MOOSE with MSVC 2019 and Arbalest with MSVC 202x.<br>\nEarlier, BRL-CAD built successfully with VS 2019 (including <code>mged</code>). During the Qt/Arbalest investigation, I switched to VS 2022, did a clean rebuild, and later reverted back to VS 2019 as suggested. After the clean rebuild and switching back to VS 2019, I am now consistently hitting an <strong>ASM/PNG issue during bext</strong>, which I did not encounter earlier with the same toolchain:<br>\n<code>CMake Error at CMakeLists.txt:28 (project):   No CMAKE_ASM_COMPILER could be found.</code><br>\nThis occurs during the PNG step in bext, even when configuring from the VS 2019. I’m currently debugging this, but wanted to confirm whether this is a known bext/PNG edge case on Windows or if there’s a recommended way to bypass/handle ASM for PNG in this setup.</p>",
        "id": 569724202,
        "sender_full_name": "Kanchan Borole",
        "timestamp": 1769177382
    },
    {
        "content": "<p>I haven't seen it before, but googling for \"No CMAKE_ASM_COMPILER could be found\" gives e.g. <a href=\"https://gitlab.kitware.com/cmake/cmake/-/issues/17532\">https://gitlab.kitware.com/cmake/cmake/-/issues/17532</a></p>",
        "id": 569797857,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1769200137
    },
    {
        "content": "<p>hey <span class=\"user-mention\" data-user-id=\"102939\">@Daniel Rossberg</span>  is this issue <a href=\"https://github.com/opencax/GSoC/issues/52\">https://github.com/opencax/GSoC/issues/52</a><br>\n still open ,or it has been completed as it was proposed way back in 2022</p>",
        "id": 571300941,
        "sender_full_name": "Parag Debnath",
        "timestamp": 1769965366
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"1020260\">@Parag Debnath</span>, the Python bindings are still open. No work was done regarding this issue last year. I can however not promise that BRL-CAD will apply for GSoC 2026.</p>",
        "id": 571376072,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1770022611
    },
    {
        "content": "<p>I’m trying to build <strong>BRL-CAD</strong> on Windows using Visual Studio, but I’m encountering an issue related to the <strong>bext dependency repository</strong>.<br>\n<strong>Environment</strong>, </p>\n<ul>\n<li>Windows 11(64-bit)</li>\n<li>Visual Studio 2019 (also tried 2026)</li>\n</ul>\n<div class=\"codehilite\"><pre><span></span><code>cmake .. -DBRLCAD_ENABLE_STRICT=NO -DBRLCAD_BUNDLED_LIBS=ON -DCMAKE_BUILD_TYPE=Release -G &quot;Visual Studio 16 2019&quot;\n</code></pre></div>\n<p><strong>Error Encountered</strong></p>\n<div class=\"codehilite\"><pre><span></span><code>CMake Error at misc/CMake/BRLCAD_Util.cmake:102 (_message):\nUnable to successfully build bext dependency repository, Call Stack (most recent call first):, misc/CMake/BRLCAD_EXT_Setup.cmake:442 (message), misc/CMake/BRLCAD_ExternalDeps.cmake:529 (brlcad_ext_setup), CMakeLists.txt:2114 (brlcad_bext_process)\n</code></pre></div>",
        "id": 573597642,
        "sender_full_name": "Shorya Singhal",
        "timestamp": 1770922782
    },
    {
        "content": "<p>Hi, I’ve been working with BRL-CAD locally using the binary installation, and MGED is running correctly on my system. I also cloned Arbalest and have been reviewing the Qt structure to understand how the main window and widgets are organized. I attempted building BRL-CAD from source but encountered a compiler/ASM issue, so for now I’m continuing exploration using the binary setup.</p>\n<p>I’d like to begin contributing on the GUI side. Since the Geometry Validation &amp; Verification project focuses on developing a validation interface, would it be aligned with the current direction if I start by adding a modular “Geometry Validation” dock/panel skeleton (for example, an issues table and summary UI) that can later integrate validation results?</p>\n<p>I want to make sure I’m contributing in the correct architectural direction before proceeding further.</p>",
        "id": 575064378,
        "sender_full_name": "Kanchan Borole",
        "timestamp": 1771654108
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"892744\">@Kanchan Borole</span> did you check out the prior geometry V&amp;V GUI work-in-progress code?  It should be linked on the idea page but ping me if it's not there. </p>\n<p>Basically, you are on the right track, but there has been some work on the V&amp;V GUI.  My thoughts on priorities would be 1) to update to the latest Arbalest codebase as previous effort was a couple years ago as a fork and it hasn't been kept up-to-date in sync and 2) to vastly improve the visualization and workflow aspects.  The latter is open-ended but hard to discuss without you first seeing what was done previously.</p>",
        "id": 575372269,
        "sender_full_name": "Sean",
        "timestamp": 1771872215
    }
]