[
    {
        "content": "<p>import  IGES  or STEP<br>\nerror！！！</p>",
        "id": 518921704,
        "sender_full_name": "claymonkey",
        "timestamp": 1747574467
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"782450\">@claymonkey</span> iges import is tricky as you have to know and specify the type, and even then it can have problems if the data is not clean -- there are lots of iges exporters that export junk.  </p>\n<p>with step import, the most common cause is trying to import something that is not ap203e1 -- that's all that's presently supported.  some like ap214 or e2 are also common.</p>",
        "id": 518989530,
        "sender_full_name": "Sean",
        "timestamp": 1747627631
    },
    {
        "content": "<p>I tried to use the reading method of OpenCaseCAD to parse IGEs. However, it was very troublesome to convert all faces into NURBSface+NURBScurve logic. Especially when I wanted to translate the type into other BREPS models, the speed was very unsatisfactory. This reminded me of the BREPS structure in the current software, but errors frequently occurred when I tried to import it.</p>",
        "id": 520672759,
        "sender_full_name": "claymonkey",
        "timestamp": 1748353435
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"782450\">@claymonkey</span> what is your use case, end goal?</p>",
        "id": 521350136,
        "sender_full_name": "Sean",
        "timestamp": 1748629507
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 521495475,
        "sender_full_name": "claymonkey",
        "timestamp": 1748744229
    },
    {
        "content": "<p>Try to parse the CAD file by yourself and convert it into a creatable BREP type.</p>",
        "id": 521495515,
        "sender_full_name": "claymonkey",
        "timestamp": 1748744271
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"782450\">@claymonkey</span> so just for the technical challenge?  or some other purpose? parsing and converting from iges/step to some brep in-memory structure is not exactly an end-use case..  </p>\n<p>If you're working with BRL-CAD, the 3dm-g is by far the best brep import method that imports faithfully &amp; natively using OpenNURBS.  Next best is step-g if it's an ap203e1 file.  The iges-g importer hasn't been tested or used in production use for nearly a decade, but it has extensive code for multiple import methods and encoding types (including automatic re-encoding of bspline to NURBS) but also less reliable if there are any errors in the geometry.</p>",
        "id": 521505821,
        "sender_full_name": "Sean",
        "timestamp": 1748751757
    },
    {
        "content": "<p>Because I found that the Brep type of openNurbs is quite similar to that of opencascad, when some programs do not support certain operations, I thought of using the underlying feedback information to create corresponding ones, hoping that other open-source methods can handle them more precisely.</p>",
        "id": 521527716,
        "sender_full_name": "claymonkey",
        "timestamp": 1748766915
    },
    {
        "content": "<p>It is indeed similar, but not 1-1 identical if memory serves.</p>",
        "id": 521556957,
        "sender_full_name": "Sean",
        "timestamp": 1748786285
    },
    {
        "content": "<p>so are you looking to bridge geometry from some application built on opencascade into brl-cad, to some operation that brl-cad handles better, and then convert it back?</p>",
        "id": 521557028,
        "sender_full_name": "Sean",
        "timestamp": 1748786347
    },
    {
        "content": "<p>Yes, if multiple software functions are combined, then only common cad types can be used for conversion. After all, brep will not be exactly the same</p>",
        "id": 521557467,
        "sender_full_name": "claymonkey",
        "timestamp": 1748786620
    },
    {
        "content": "<p>that would certainly be feasible for brep and/or polygonal types I'd think</p>",
        "id": 521557568,
        "sender_full_name": "Sean",
        "timestamp": 1748786668
    },
    {
        "content": "<p>problematic encodings are typically:  implicits, csg booleans, volumetric/voxel data, level sets, subdivision surfaces, t-splines, medial axis, signed distance fields, and parametric ops like sweep/loft/extrude</p>",
        "id": 521557893,
        "sender_full_name": "Sean",
        "timestamp": 1748786875
    },
    {
        "content": "<p>brep is more amenable, includes triangles, polygons, bezier patches, b-spline patches, and nurbs surfaces</p>",
        "id": 521558037,
        "sender_full_name": "Sean",
        "timestamp": 1748786956
    },
    {
        "content": "<p>Perhaps FACE can be parsed as a combination of the basic NurbsSurface and CurvesToTrimed<br>\n. Then perhaps in any logic, there will be corresponding creation methods.</p>",
        "id": 521558374,
        "sender_full_name": "claymonkey",
        "timestamp": 1748787178
    },
    {
        "content": "<p>There was some work done a while back on opennurbs -&gt; opencascade, IIRC - I think it was this?  <a href=\"https://www.cnblogs.com/opencascade/p/opennurbs2opencascade.html\">https://www.cnblogs.com/opencascade/p/opennurbs2opencascade.html</a></p>",
        "id": 521616069,
        "sender_full_name": "starseeker",
        "timestamp": 1748822052
    },
    {
        "content": "<p>I recall hunting around a while back because going to/from opennurbs and opencascade data types would be a  keystone of a converter of .g geometry to/from FreeCAD</p>",
        "id": 521616154,
        "sender_full_name": "starseeker",
        "timestamp": 1748822128
    },
    {
        "content": "<p>It would be really awesome if we had two way communication with FreeCAD, but my recollection is that the problem is fairly involved - NURBS BRep objects have a LOT of subtypes, and there are subtleties that need to be taken into account.</p>",
        "id": 521616276,
        "sender_full_name": "starseeker",
        "timestamp": 1748822215
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"102939\">@Daniel Rossberg</span> do you work much with BoT models?  curious to hear if you or users you work with see noticeable change</p>",
        "id": 534681317,
        "sender_full_name": "Sean",
        "timestamp": 1755275868
    },
    {
        "content": "<p>The model creation is usually done with a commercial CAD, and then transferred via STL. Therefore, I would say yes. We'll keep an eye on it.</p>",
        "id": 534683684,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1755276996
    },
    {
        "content": "<p>Yeah, that should definitely be impacted.... in a pretty big way. Curious to know how much for you.</p>",
        "id": 534690241,
        "sender_full_name": "Sean",
        "timestamp": 1755280271
    },
    {
        "content": "<p>I have crunched a lot of numbers that I'll share here publicly soon, probably this upcoming week as I'm documenting them in even more detail.</p>",
        "id": 534690341,
        "sender_full_name": "Sean",
        "timestamp": 1755280316
    },
    {
        "content": "<p>seeing anywhere from 2x-20x on most models, some even going 200-2000x but atypical.  if you were using adrt, the main difference is that really long prep time is now gone.  if you weren't using adrt, prep is about same (ie. fast) but ray tracing is going to be 100+ times faster on most models.</p>",
        "id": 534690627,
        "sender_full_name": "Sean",
        "timestamp": 1755280464
    },
    {
        "content": "<p>Generic BRL-CAD article in the news:  <a href=\"https://www.3dnatives.com/en/brl-cad-the-design-software-created-for-defense-140520256/\">https://www.3dnatives.com/en/brl-cad-the-design-software-created-for-defense-140520256/</a></p>",
        "id": 534690655,
        "sender_full_name": "Sean",
        "timestamp": 1755280479
    },
    {
        "content": "<p>Hi everyone,<br>\nI’m currently working on setting up the Arbalest V&amp;V GUI project and wanted to ask for some guidance regarding build issues.</p>\n<p>What I’ve done so far<br>\nForked and cloned the Arbalest repository<br>\nInstalled Qt, CMake, and all required dependencies<br>\nTried building Arbalest following the available instructions</p>\n<p>Issues I’m facing<br>\nThe code in Arbalest does not seem to match the structure of the latest BRL-CAD version. Several BRL-CAD libraries appear to be renamed or missing in the latest release I could not find a BRL-CAD version where the file structure matches the Arbalest source Specifically, the db folder expected by Arbalest seems to be missing in recent BRL-CAD builds, causing additional errors. Some libraries referenced in the code seem outdated or changed, and I cannot locate their new equivalents<br>\nWhat I need help with<br>\nCould anyone please tell me which BRL-CAD version Arbalest was originally developed/tested with, so I can download the matching version and build successfully?</p>",
        "id": 556687922,
        "sender_full_name": "Kanchan Borole",
        "timestamp": 1763302285
    }
]