[
    {
        "content": "<p>Brainstorming some ways to visualize the hierarchy effectively and thought I'd share some progress.  It's not fully explored, but the general idea is a small 2-level hierarchy infographic that shows the object in question, it's top N subassemblies (based on volume), and associated object counts.<br>\n<a href=\"/user_uploads/1549/6UnruCNO1YQ25DTLWss7UnUH/Screenshot-2023-03-13-at-11.26.33-PM.png\">Screenshot-2023-03-13-at-11.26.33-PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/1549/6UnruCNO1YQ25DTLWss7UnUH/Screenshot-2023-03-13-at-11.26.33-PM.png\" title=\"Screenshot-2023-03-13-at-11.26.33-PM.png\"><img src=\"/user_uploads/1549/6UnruCNO1YQ25DTLWss7UnUH/Screenshot-2023-03-13-at-11.26.33-PM.png\"></a></div>",
        "id": 341623406,
        "sender_full_name": "Sean",
        "timestamp": 1678771441
    },
    {
        "content": "<p>I wonder how close of an approximation I'd get if we run analyze on all primitives to get their volume (which is fast) and then apply a basic heuristic perhaps based on bounding box overlap, to estimate booleans on the volume.  Could possibly give a really fast / instantaneous volume approximation that'd be better than simply summing up the individual volumes.  gqa takes seconds or minutes, so having something that gives a fast rough answer could be super useful for some things. I wonder what that error bars look like...</p>",
        "id": 342221070,
        "sender_full_name": "Sean",
        "timestamp": 1678946184
    },
    {
        "content": "<p>I'm working with a team of students this semester that are working on making a tool to automatically generate a single page summaries of geometry.  The design's starting to solidify, so I thought it'd be great to good to share a preview of one of the design sketches for feedback and discussion:  <a href=\"/user_uploads/1549/cynxxk2Im74-miaksdXyQKJm/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/1549/cynxxk2Im74-miaksdXyQKJm/image.png\" title=\"image.png\"><img src=\"/user_uploads/1549/cynxxk2Im74-miaksdXyQKJm/image.png\"></a></div>",
        "id": 342435624,
        "sender_full_name": "Sean",
        "timestamp": 1679006537
    },
    {
        "content": "<p>The general utility is this will make it really easy to index and catalog a repository of models, and to share what's essentially a geometry v&amp;v tech sheet for those models.  That is, a way to share details about a model (textually, graphically, and contextually) without necessarily sharing the model itself and/or having to open it up in a GUI, etc.</p>",
        "id": 342435942,
        "sender_full_name": "Sean",
        "timestamp": 1679006677
    }
]