[
    {
        "content": "<p>Okay, so after MUCH testing and debugging, I'm getting up to speed on our IGES export support.</p>",
        "id": 235202707,
        "sender_full_name": "Sean",
        "timestamp": 1618846986
    },
    {
        "content": "<p>I'd rather forgotten just how actually rather impressive it is... even more complex than our STEP converter, with more flexibility and options.</p>",
        "id": 235202802,
        "sender_full_name": "Sean",
        "timestamp": 1618847039
    },
    {
        "content": "<p>Short summary is that it looks like it IS outputting correctly, at least as far as I can tell, BUT...</p>",
        "id": 235202887,
        "sender_full_name": "Sean",
        "timestamp": 1618847064
    },
    {
        "content": "<p>our converter is (by default) exporting more than most IGES importers are implemented to handle.  For example, by default IGES has a suite of primitives that it supports (like arb8, ell, rcc, etc) and g-iges actually exports them as such, but those entity types are not supported by loads of importers (e.g., opencascade, ACIS, Granite, ...).  Presumably one of the 2nd gen CAD like NX maybe supports them, as they were king when it was implemented and would have been in the testing regimen.</p>",
        "id": 235203219,
        "sender_full_name": "Sean",
        "timestamp": 1618847216
    },
    {
        "content": "<p>IGES is rather expressive and supports other entity types, though, so g-iges ALSO has support to export those primitives tessellated as either meshes or breps.  The latter appears to be the supported format for Granite, but some CAD appear to support mesh format too.</p>",
        "id": 235203505,
        "sender_full_name": "Sean",
        "timestamp": 1618847317
    },
    {
        "content": "<p>Now what I'm still trying to sort out is some systems (e.g., OpenCASCADE) still fail at importing our IGES when there's a bigger hierarchy and I'm not yet sure why.  I suspect we're exporting some hierarchy metadata (e.g., regionID, materialID) that causes them to fail/bail/dunno.   Simple hierarchies even with regions seem to work just fine.</p>",
        "id": 235203821,
        "sender_full_name": "Sean",
        "timestamp": 1618847434
    },
    {
        "content": "<p>I did find one issue in the IGES header where we're not exporting two fields commonly found, but I got to read up on the spec to see if they're optional or required.</p>",
        "id": 235203930,
        "sender_full_name": "Sean",
        "timestamp": 1618847474
    }
]