[
    {
        "content": "<p>the GSoC pages mentioned that it's recommended to make at least one patch, what I'd like to know is: is SF the place to look for bugs? because it seems to be a very one-way avenue of bug reporting (ie.: none of the latest bugs have a single comment or follow-up on them)</p>",
        "id": 124130719,
        "sender_full_name": "Peter Pronai",
        "timestamp": 1521847048
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"111633\">@Peter Pronai</span> the best place for bugs and issues is in our BUGS and TODO files in a source checkout.  sf trackers don't receive much attention except for the Patches tracker.</p>",
        "id": 124136888,
        "sender_full_name": "Sean",
        "timestamp": 1521860844
    },
    {
        "content": "<p>Reviving this ancient thread to have a discussion about BRL-CAD issue management.  I think it's time for a radical change to our ongoing issue management and wanted to propose some changes for discussion and consideration.  If <span class=\"user-mention channel-wildcard-mention\" data-user-id=\"*\">@everyone</span> is happy with the status quo, so be it, but hoping we can structurally fix some long-standing problems.</p>",
        "id": 534739144,
        "sender_full_name": "Sean",
        "timestamp": 1755320977
    },
    {
        "content": "<p>First and foremost, some context on the current situation:</p>\n<p>We currently have a BUGS file and a TODO file that are simple text files for quick and easy annotation by devs when they encounter bugs or want to express things we want to do in BRL-CAD (which sometimes includes fixing bugs, and sometimes it's new features or change). This is far lower overhead and has historically been effective at communicating release tasks and issues encountered, but the files now have 182 and 520 entries respectively and have proven not terribly effective at being useful to new developers looking to get involved, and not terribly effective at indicating how important or how complex/hard/time-consuming any of them might be in order to influence prioritization (which is resulting more ad hoc than we would like). The BUGS and TODO files are in addition to our GitHub issues tracker which has 51 open issues, our former Sourceforge repo which has several hundred issues (never migrated to GitHub), and a private issue tracker for a particular production environment that also has several hundred issues. Some of the entries in these five collections overlap. They cannot be unified into a single environment (at least the private one cannot).</p>",
        "id": 534739248,
        "sender_full_name": "Sean",
        "timestamp": 1755321113
    },
    {
        "content": "<p>The quick-edit files were originally to ensure we didn't lose track, but that's demonstrably not an issue (pun intended).  The biggest problem we have is the identification of tasks amenable to new contributors -- that's my top concern to hopefully address, but not the only one.</p>",
        "id": 534739329,
        "sender_full_name": "Sean",
        "timestamp": 1755321189
    },
    {
        "content": "<p>More I can comment on and proposed set of actions forthcoming, but wanted to start the discussion there so the topic is at least elevated to attention.  The solutions/actions I have in mind will require some disruption, migration, adoption by all to be successful.</p>",
        "id": 534739442,
        "sender_full_name": "Sean",
        "timestamp": 1755321345
    },
    {
        "content": "<p>I have never done anything on zulip, I have no clue why you would be<br>\ncontacting me about anything. Your email wrote nothing but nonsense. Please<br>\nremove me from your contact list immediately.</p>",
        "id": 534773959,
        "sender_full_name": "Ty Martiniuk",
        "timestamp": 1755363688
    }
]