[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112516\">@starseeker</span> I really like that adaptive_plot2() is gone!  I'm rather concerned about moving torus from an architecture perspective, though.</p>",
        "id": 281319455,
        "sender_full_name": "Sean",
        "timestamp": 1651766391
    },
    {
        "content": "<p>That part doesn't make sense to me..  What's the thinking?  By extension, all the implicits would end up in libbg and that doesn't seem like a good direction (it's de-encapsulating them).  It's also expanding scope (redefining what basic means seemingly arbitrarily).</p>",
        "id": 281319470,
        "sender_full_name": "Sean",
        "timestamp": 1651766398
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112516\">@starseeker</span> 5ad26ec3da9bfcf72d581241db25f8c6a46aeff6 really looks to be even more backwards... what's going on?   Having libbg know anything about database entity minor type codes isn't right.   earlier change de-encapsulated a single entity was backwards, but now having part of the file format itself be decomposed across libraries is really making a mess of things...  all for lod?  there's got to be a better way that doesn't keep packing on architecture debt.</p>",
        "id": 281392050,
        "sender_full_name": "Sean",
        "timestamp": 1651816063
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"102902\">@Sean</span> I'll be backing it out the torus changes anyway - I didn't get the speedup I was trying for, so it's not worth fooling with.  I suspect we may have some rather fundamentally different ideas about libbg/librt scope, but there's no need to try and hash it out now.</p>",
        "id": 281424517,
        "sender_full_name": "starseeker",
        "timestamp": 1651836229
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"102902\">@Sean</span> removed, 6849ae8bc6b1d4b60536c02af7716b26bfe8fa08</p>",
        "id": 281426882,
        "sender_full_name": "starseeker",
        "timestamp": 1651837884
    }
]