[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"102902\">@Sean</span>  Question.  Is the intent of libtclcad to be able to manage multiple simultaneous open databases?  If so, how does (say) an Archer command prompt denote what database is the \"current\" database for a ged command?  Most of our commands have an implicit assumption of a \"current\" gedp/dbip, but looking at tclcad_obj and ged_obj in libtclcad the intent seems to be to allow iteration over multiple databases?</p>",
        "id": 204087296,
        "sender_full_name": "starseeker",
        "timestamp": 1594908110
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"217384\">@Sadeep Darshana</span>'s new GUI can open multiple simultaneously.</p>",
        "id": 204095687,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1594911648
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112516\">@starseeker</span>  said there might be global variables in librt. However I didn't face trouble yet. I did not raytrace. Displaying wireframes works fine (there might be issues, not that I have noticed any).</p>",
        "id": 204096715,
        "sender_full_name": "Sadeep Darshana",
        "timestamp": 1594912090
    },
    {
        "content": "<p><code>RTG.rtg_vlfree</code> might be an issue(?)</p>",
        "id": 204097245,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1594912318
    },
    {
        "content": "<p>How are you managing libged's ged pointer? (struct ged)</p>",
        "id": 204111197,
        "sender_full_name": "starseeker",
        "timestamp": 1594918333
    },
    {
        "content": "<p>One per database?</p>",
        "id": 204111221,
        "sender_full_name": "starseeker",
        "timestamp": 1594918344
    },
    {
        "content": "<p>Also, once a command prompt is available, do operations on that command prompt operate only on one database or on all open databases?  It should probably be the former in my opinion (I don't think the latter is practical, certainly at the moment...)</p>",
        "id": 204111505,
        "sender_full_name": "starseeker",
        "timestamp": 1594918529
    },
    {
        "content": "<p>In libtclcad there is a list of views, which in turn have ged pointers.  Structurally this requires unwrapping the Tcl interp's data container to get the gedp pointer before calling any libged commands, which is unfortunate - there's a lot of verbose infrastructure in libtclcad that does this job at the moment.</p>\n<p>I'm trying to think through if and how the gedp itself might contain the set of views active for the given database, so we can (at least for the libged commands) minimize the amount of wrapping logic needed.</p>",
        "id": 204111987,
        "sender_full_name": "starseeker",
        "timestamp": 1594918746
    }
]