[
    {
        "content": "<p>For those of you that haven't been tracking, we've had a team at Texas A&amp;M working on improving the performance of BoT ray tracing the past 4 months.  Their goal was to evaluate and leverage an existing accelerated BVH spatial structure to replace ADRT's slow kd-tree build.  </p>\n<p>Preliminary results show all objectives met which includes <em>vastly</em> faster-than-ADRT prep times (seriously, 2500x improvement in some cases) and <em>vastly</em> faster-than-RT shot times, often faster-than-ADRT just with some exceptions like when the models are very simple and/or already sub-second.  Typical overall reduction depends on the model but is looking like most times are at least cut in half or more.</p>\n<p>TAMU team of five wrapped up their semester work and submitted a PR last week.  Once fully reviewed and validated, this work is expected to replace both the traditional RT ray tracing and the ADRT accelerated ray tracing implementations.  That will not only be a decent code complexity consolidation, it'll make both the \"bot_minpieces\" and \"bot_mintie\" controls obsolete (e.g., no longer need to set LIBRT_BOT_MINTIE environment variable). </p>\n<p>The implementation keeps the behavior of RT+ADRT w.r.t. intersection queries, and initial testing on primary ray first hits are already spot-on.  Testing of subsequent hits and secondary rays is in the works.</p>\n<p>If anyone would like more details, I can work to get you a copy of their final user-acceptance test report for review and feedback.</p>",
        "id": 436106694,
        "sender_full_name": "Sean",
        "timestamp": 1714413340
    },
    {
        "content": "<p>cool! are they going to write a paper? (y'know, almost 30 years ago I knew a guy who graduated from a&amp;m, he said there is only one Aggie joke, the rest are true stories... apparently, they also have an annual bonfire that was often cataclysmic)</p>",
        "id": 436981474,
        "sender_full_name": "Erik",
        "timestamp": 1714786501
    },
    {
        "content": "<p>They no longer due the cataclysmic bonfire, <span class=\"user-mention\" data-user-id=\"103542\">@Erik</span> ... ever since a bunch of kids died a few years back when there was a structural collapse.</p>",
        "id": 437108825,
        "sender_full_name": "Sean",
        "timestamp": 1714913386
    },
    {
        "content": "<p>But yes, they did write up a final report, final presentation, and some nice demo videos.</p>",
        "id": 437108899,
        "sender_full_name": "Sean",
        "timestamp": 1714913431
    },
    {
        "content": "<p>For example, hairball:  <a href=\"/user_uploads/1549/f9LFeZwRMWMsM0QBYpgep_kf/Comparison.mov\">Comparison.mov</a></p>",
        "id": 437109112,
        "sender_full_name": "Sean",
        "timestamp": 1714913637
    },
    {
        "content": "<p>Note that's one of the few cases where the ray tracing is technically slightly slower, but the prep time is so drastically different that it's still overall a huge improvement.  Stark difference.</p>",
        "id": 437109178,
        "sender_full_name": "Sean",
        "timestamp": 1714913685
    },
    {
        "content": "<p>impressive, I'd be interested in reading that report o.O :D</p>",
        "id": 437473622,
        "sender_full_name": "Erik",
        "timestamp": 1715094330
    },
    {
        "content": "<p>I'll see if I can get it uploaded</p>",
        "id": 437476156,
        "sender_full_name": "Sean",
        "timestamp": 1715095117
    }
]