[
    {
        "content": "<p>@starseeker I recall all the vestiges of interfacing with muves were ripped out in 7.30, and someone noticed.  Do you recall what the migration plan is/was for read_muves?</p>",
        "id": 273707279,
        "sender_full_name": "Sean",
        "timestamp": 1646167485
    },
    {
        "content": "<p>there's of course a user that relied on it, now wondering where it went</p>",
        "id": 273707345,
        "sender_full_name": "Sean",
        "timestamp": 1646167528
    },
    {
        "content": "<p>I couldn't recall if there was a tool / command in ajem that did that mapping or if you'd added an option to one of the commands for reading a mapping file?</p>",
        "id": 273707434,
        "sender_full_name": "Sean",
        "timestamp": 1646167574
    },
    {
        "content": "<p>I'm trying to remember - are you referring to read_muves?  muves_read doesn't show up in CHANGES</p>",
        "id": 273707501,
        "sender_full_name": "starseeker",
        "timestamp": 1646167615
    },
    {
        "content": "<p>right, read_muves sorry</p>",
        "id": 273707523,
        "sender_full_name": "Sean",
        "timestamp": 1646167630
    },
    {
        "content": "<p>Let me take a look...</p>",
        "id": 273707545,
        "sender_full_name": "starseeker",
        "timestamp": 1646167645
    },
    {
        "content": "<p>From what I got from the docs, the command basically iterated over the region map file, and set the MUVES_Component attribute on the corresponding objects.  That's an interesting use case I'd not remembered, and not one I know of anywhere else... might be a way to generalize it if it doesn't exist (by restoring, but just not calling it read_muves).</p>",
        "id": 273708004,
        "sender_full_name": "Sean",
        "timestamp": 1646167884
    },
    {
        "content": "<p>create combs or set attrs based on a text input file</p>",
        "id": 273708044,
        "sender_full_name": "Sean",
        "timestamp": 1646167905
    },
    {
        "content": "<p>Well, kind of.  If the user is depending on knowledge of the parsing of the MUVES files, that's not really generalizable (and is no longer present in current code.)</p>",
        "id": 273708250,
        "sender_full_name": "starseeker",
        "timestamp": 1646167978
    },
    {
        "content": "<p>It would simply be standardizing on a text input that is similar (if not identical) with a line describing a mapping, each line being an identifier followed by whitespace followed by a list of names or ids.  basically just say \"here's how you can create a text mapping file\" and that format would just happen to match most regmaps.  Alternatively, we could go the nirt route and define the input using a parser grammer, and have a a couple pre-canned formats, but that'd be new work and doesn't address this guy's issue.</p>",
        "id": 273710613,
        "sender_full_name": "Sean",
        "timestamp": 1646168930
    },
    {
        "content": "<p><a href=\"https://github.com/BRL-CAD/brlcad/blob/refs/tags/rel-7-28-2/src/mged/muves.c\">https://github.com/BRL-CAD/brlcad/blob/refs/tags/rel-7-28-2/src/mged/muves.c</a></p>",
        "id": 273711189,
        "sender_full_name": "starseeker",
        "timestamp": 1646169169
    },
    {
        "content": "<p>I remember that file.  What was the migration plan?</p>",
        "id": 273711728,
        "sender_full_name": "Sean",
        "timestamp": 1646169480
    }
]