[
    {
        "content": "<p>I've been working on developing view manipulation iconography (aka a \"view gizmo\") for quickly switching views and exploring  using a rhombicuboctahedron: <a href=\"/user_uploads/1549/88HHXeX6NYS_n0FzbsbQZ4V6/rhombicuboctahedron.png\">rhombicuboctahedron.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/1549/88HHXeX6NYS_n0FzbsbQZ4V6/rhombicuboctahedron.png\" title=\"rhombicuboctahedron.png\"><img src=\"/user_uploads/1549/88HHXeX6NYS_n0FzbsbQZ4V6/rhombicuboctahedron.png\"></a></div>",
        "id": 342814093,
        "sender_full_name": "Sean",
        "timestamp": 1679158531
    },
    {
        "content": "<p>General idea is it would be displayed in a corner of the graphics window and switches views when you click on faces or drag it around.  There are 26 faces including all 45 off-angle views.  If the vertices are made selectable, that adds 24 more views at elevations 35, 70, -35, and -75. and azimuths 25, 65, 115, 155, -25, -65, -115, and -155 for a total of 50 view orientations.</p>",
        "id": 342815543,
        "sender_full_name": "Sean",
        "timestamp": 1679159212
    },
    {
        "content": "<p>If edges are made selectable, that brings the total to 96 views.</p>",
        "id": 342815584,
        "sender_full_name": "Sean",
        "timestamp": 1679159227
    },
    {
        "content": "<p>need (heh, bevelbox) any thought to indicating 0 x/y/z for orientation?</p>",
        "id": 342816011,
        "sender_full_name": "Erik",
        "timestamp": 1679159435
    },
    {
        "content": "<p>Even without edges, I believe that covers all 32 standard analysis views.  Only issue is whether to try and pack face names (e.g., \"front\", \"top\", \"left\", \"45/45\" etc, and whether to display any other graphical components like the xyz axes extending out or planar rotation discs.</p>",
        "id": 342816013,
        "sender_full_name": "Sean",
        "timestamp": 1679159438
    },
    {
        "content": "<p>maybe lines sticking out of the three with the letter by the end?</p>",
        "id": 342816095,
        "sender_full_name": "Erik",
        "timestamp": 1679159488
    },
    {
        "content": "<p>Yeah, that image is just the shape -- I'm thinking the faces can be color-coded with red/green/blue for x/y/z with + being prominent and - being lighter color</p>",
        "id": 342816138,
        "sender_full_name": "Sean",
        "timestamp": 1679159510
    },
    {
        "content": "<p>Or maybe that it shows axes, but then as you mouse over, the axes disappear so it's more clear that you're interacting with the rhombicuboctahedron and not grabbing the axes lines</p>",
        "id": 342816276,
        "sender_full_name": "Sean",
        "timestamp": 1679159579
    },
    {
        "content": "<p>The only thing we'll have to be wary of is Autodesk has a couple patents related to this, though the one most relevant (<a href=\"https://patents.google.com/patent/US7782319\">https://patents.google.com/patent/US7782319</a>) specifically calls out using a cube.  A rhombicuboctahedron should not only avoids patent infringement but arguably be a better fit for our standard views (specifically wanting to cater to 35/25 offset views) and the construction is actually a beautiful collection of arb5's and arb4's.  That means we'll be able to do some novel things like highlight view selections by extruding faces/edges/vertices during mouse over.</p>",
        "id": 342821498,
        "sender_full_name": "Sean",
        "timestamp": 1679162274
    }
]