[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112516\">@starseeker</span> I was working on spherical sampling and noticed you added a sobol sequence generator and related code in libanalyze.  That's awesome!  Is that exposed/presented anywhere user-visible?</p>",
        "id": 217795073,
        "sender_full_name": "Sean",
        "timestamp": 1606242641
    },
    {
        "content": "<p>I want to compare it with another generator I have for incremental spherical sets, use it as a base for convergence testing on closures.</p>",
        "id": 217795241,
        "sender_full_name": "Sean",
        "timestamp": 1606242718
    },
    {
        "content": "<p>It's exposed in the pnts command, IIRC... one sec</p>",
        "id": 217798147,
        "sender_full_name": "starseeker",
        "timestamp": 1606244126
    },
    {
        "content": "<p>pnts gen --sobol</p>",
        "id": 217798397,
        "sender_full_name": "starseeker",
        "timestamp": 1606244253
    },
    {
        "content": "<p>If you generate points from a sphere using --rand and --sobol, you'll see the difference</p>",
        "id": 217798439,
        "sender_full_name": "starseeker",
        "timestamp": 1606244273
    },
    {
        "content": "<p>sobol ended up being of dubious utility for that - it clusters near the poles of the sphere, and I never got deep enough in to see if there was a correction that might be applied.</p>",
        "id": 217798558,
        "sender_full_name": "starseeker",
        "timestamp": 1606244317
    },
    {
        "content": "<p>Really should have ripped it out, to be honest - it took a while to find a sobol generator that was appropriately licensed and able to be integrated cleanly, so I hated to get rid of it, but honesty compels me to admit  it's mostly code bloat right now...</p>",
        "id": 217798869,
        "sender_full_name": "starseeker",
        "timestamp": 1606244456
    },
    {
        "content": "<p>clustering near the poles is just a classic mistake in how the random numbers are being used</p>",
        "id": 217799048,
        "sender_full_name": "Sean",
        "timestamp": 1606244525
    },
    {
        "content": "<p>the code itself is simple enough and sobol is a useful sequence for quasi-random montecarlo</p>",
        "id": 217799124,
        "sender_full_name": "Sean",
        "timestamp": 1606244567
    },
    {
        "content": "<p>I did see a few issues in the code that need clean up, few mistakes to correct</p>",
        "id": 217799403,
        "sender_full_name": "Sean",
        "timestamp": 1606244701
    },
    {
        "content": "<p>few things I just don't understand yet (like the next ranges and skip function, the example snippet has typos and comments aren't clear to me yet)</p>",
        "id": 217799579,
        "sender_full_name": "Sean",
        "timestamp": 1606244790
    },
    {
        "content": "<p>thanks for the lead on pnts.  I'll check it out.</p>",
        "id": 217799793,
        "sender_full_name": "Sean",
        "timestamp": 1606244891
    }
]