[
    {
        "content": "<p>I wonder, why there is no tessellation for plate mode bots implemented. Okay, a reason could be that there is no perfect boundary representation for these primitives, because the shape of the boundary depends on the viewing direction. But, the BREP is very important for the exchange with other CAD software, and there are so many models with plate mode bots out there, what creates the urge to do at least something.</p>\n<p>However, to start a discussion, I drafted an idea: <a href=\"https://github.com/BRL-CAD/brlcad/pull/181\">https://github.com/BRL-CAD/brlcad/pull/181</a><br>\nIt's not perfect, but better than nothing?</p>",
        "id": 511638031,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1744374169
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"102939\">@Daniel Rossberg</span> no tessellation for the reason you mentioned, but also just because it's not been tried outside of starseeker's extrusion method that he mentioned. </p>\n<p>Personally, I think a good default is to simply ignore the directionality issue and presume centering (i.e., bidirectional half-extrusion in each dir).  That's nominally what I'd typically expect on something randomly imported.  There's of course also value in extruding inwards/outwards so that the original triangle data is preserved exactly, in cases where the thickness is supposed to go in one direction.</p>",
        "id": 513352804,
        "sender_full_name": "Sean",
        "timestamp": 1745218852
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"102902\">Sean</span> <a href=\"#narrow/channel/104062-brlcad/topic/tessellation.20of.20plate.20mode.20bots/near/513352804\">said</a>:</p>\n<blockquote>\n<p>..., in cases where the thickness is supposed to go in one direction.</p>\n</blockquote>\n<p>But, in <strong>which</strong> direction? It depends on the shooting direction. How do you make a BREP of it?</p>\n<p>As I said, there is no perfect solution. For every plate mode bot, the resulting solid depends always on the shooting direction. Therefore, I gave up searching for the perfect solution and was looking for something feasible.</p>",
        "id": 513439521,
        "sender_full_name": "Daniel Rossberg",
        "timestamp": 1745256295
    }
]